SET FOREIGN_KEY_CHECKS=0;
DROP TABLE IF EXISTS `pre_address`;
CREATE TABLE `pre_address` (
  `address_id` mediumint(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '地址ID',
  `member_id` mediumint(10) unsigned NOT NULL DEFAULT '0' COMMENT '会员ID',
  `member_username` varchar(20) NOT NULL DEFAULT '' COMMENT '登录账号',
  `true_name` varchar(50) NOT NULL DEFAULT '' COMMENT '会员姓名',
  `area_id` mediumint(10) unsigned NOT NULL DEFAULT '0' COMMENT '地区ID',
  `city_id` mediumint(9) DEFAULT NULL DEFAULT '0' COMMENT '市级ID',
  `province_id` mediumint(10) unsigned NOT NULL DEFAULT '0' COMMENT '省级ID',
  `area_info` varchar(255) NOT NULL DEFAULT '' COMMENT '地区内容',
  `address` varchar(255) NOT NULL COMMENT '地址',
  `tel_phone` varchar(20) DEFAULT NULL DEFAULT '' COMMENT '座机电话',
  `mob_phone` varchar(15) DEFAULT NULL DEFAULT '' COMMENT '手机电话',
  `is_default` enum('0','1') NOT NULL DEFAULT '0' COMMENT '1默认收货地址',
  PRIMARY KEY (`address_id`),
  KEY `member_id` (`member_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_address` */


/*Table structure for table `pre_admin_log` */

DROP TABLE IF EXISTS `pre_admin_log`;

CREATE TABLE `pre_admin_log` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `action` char(225) NOT NULL DEFAULT '',
  `content` text NOT NULL DEFAULT '',
  `createtime` int(10) unsigned NOT NULL DEFAULT '0',
  `username` char(20) NOT NULL DEFAULT '',
  `uid` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT 'ID',
  `ip` char(20) NOT NULL DEFAULT '' COMMENT 'IP',
  `url` varchar(50) NOT NULL DEFAULT '' COMMENT 'controller&action',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8;

/*Data for the table `pre_admin_log` */

insert  into `pre_admin_log`(`id`,`action`,`content`,`createtime`,`username`,`uid`,`ip`,`url`) values (1,'商城基本信息设置-清除缓存','array (\n  \'radio-1-set\' => \'on\',\n  \'cleans\' => \n  array (\n    0 => \'get_special_item\',\n    1 => \'get_setting\',\n    2 => \'get_all_category\',\n    3 => \'spu\',\n  ),\n)',1472027430,'admin',1,'0.0.0.0','Setting/clean_cache'),(2,'登录','登录',1473219601,'admin',1,'124.207.8.66','Login/login'),(3,'第三方登录','array (\n  \'wx_AppID\' => \'\',\n  \'wx_AppSecret\' => \'\',\n  \'wx_login\' => \'off\',\n)',1473219659,'admin',1,'124.207.8.66','Wx/wxloginOp'),(4,'登录','登录',1473228285,'admin',1,'124.207.8.66','Login/login');

/*Table structure for table `pre_adv` */

DROP TABLE IF EXISTS `pre_adv`;

CREATE TABLE `pre_adv` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `type` enum('layer','bannerimg','bannertext') NOT NULL,
  `title` varchar(64) NOT NULL DEFAULT '',
  `position` enum('top','bottom','window','none') NOT NULL DEFAULT 'none',
  `clickevent` enum('url','redpacket','category','goods','none') NOT NULL DEFAULT 'none',
  `img` varchar(64) NOT NULL DEFAULT '',
  `height` smallint(6) NOT NULL DEFAULT '0',
  `content` text NOT NULL  DEFAULT '' COMMENT 'html',
  `extendfield` varchar(128) NOT NULL DEFAULT '',
  `starttime` int(10) unsigned NOT NULL DEFAULT '0',
  `endtime` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_adv` */

/*Table structure for table `pre_area` */

DROP TABLE IF EXISTS `pre_area`;

CREATE TABLE `pre_area` (
  `area_id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '索引ID',
  `area_name` varchar(50) NOT NULL COMMENT '地区名称',
  `area_parent_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '地区父ID',
  `area_sort` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '排序',
  `area_deep` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '地区深度，从1开始',
  `area_region` varchar(3) DEFAULT NULL COMMENT '大区名称',
  PRIMARY KEY (`area_id`),
  KEY `area_parent_id` (`area_parent_id`)
) ENGINE=InnoDB AUTO_INCREMENT=45086 DEFAULT CHARSET=utf8;

/*Data for the table `pre_area` */

insert  into `pre_area`(`area_id`,`area_name`,`area_parent_id`,`area_sort`,`area_deep`,`area_region`) values (1,'北京',0,0,1,NULL),(2,'天津',0,0,1,NULL),(3,'河北',0,0,1,'华北'),(4,'山西',0,0,1,'华北'),(5,'内蒙古',0,0,1,'华北'),(6,'辽宁',0,0,1,'东北'),(7,'吉林',0,0,1,'东北'),(8,'黑龙江',0,0,1,'东北'),(9,'上海',0,0,1,'华东'),(10,'江苏',0,0,1,'华东'),(11,'浙江',0,0,1,'华东'),(12,'安徽',0,0,1,'华东'),(13,'福建',0,0,1,NULL),(14,'江西',0,0,1,'华东'),(15,'山东',0,0,1,'华东'),(16,'河南',0,0,1,'华中'),(17,'湖北',0,0,1,'华中'),(18,'湖南',0,0,1,'华中'),(19,'广东',0,0,1,'华南'),(20,'广西',0,0,1,'华南'),(21,'海南',0,0,1,'华南'),(22,'重庆',0,0,1,'西南'),(23,'四川',0,0,1,'西南'),(24,'贵州',0,0,1,'西南'),(25,'云南',0,0,1,'西南'),(26,'西藏',0,0,1,'西南'),(27,'陕西',0,0,1,'西北'),(28,'甘肃',0,0,1,'西北'),(29,'青海',0,0,1,'西北'),(30,'宁夏',0,0,1,'西北'),(31,'新疆',0,0,1,'西北'),(32,'台湾',0,0,1,'港澳台'),(33,'香港',0,0,1,'港澳台'),(34,'澳门',0,0,1,'港澳台'),(35,'海外',0,0,1,'海外'),(36,'北京市',1,0,2,NULL),(37,'东城区',36,0,3,NULL),(38,'西城区',36,0,3,NULL),(39,'上海市',9,0,2,NULL),(40,'天津市',2,0,2,NULL),(41,'朝阳区',36,0,3,NULL),(42,'丰台区',36,0,3,NULL),(43,'石景山区',36,0,3,NULL),(44,'海淀区',36,0,3,NULL),(45,'门头沟区',36,0,3,NULL),(46,'房山区',36,0,3,NULL),(47,'通州区',36,0,3,NULL),(48,'顺义区',36,0,3,NULL),(49,'昌平区',36,0,3,NULL),(50,'大兴区',36,0,3,NULL),(51,'怀柔区',36,0,3,NULL),(52,'平谷区',36,0,3,NULL),(53,'密云县',36,0,3,NULL),(54,'延庆县',36,0,3,NULL),(55,'和平区',40,0,3,NULL),(56,'河东区',40,0,3,NULL),(57,'河西区',40,0,3,NULL),(58,'南开区',40,0,3,NULL),(59,'河北区',40,0,3,NULL),(60,'红桥区',40,0,3,NULL),(61,'塘沽区',40,0,3,NULL),(62,'重庆市',22,0,2,NULL),(64,'东丽区',40,0,3,NULL),(65,'西青区',40,0,3,NULL),(66,'津南区',40,0,3,NULL),(67,'北辰区',40,0,3,NULL),(68,'武清区',40,0,3,NULL),(69,'宝坻区',40,0,3,NULL),(70,'宁河县',40,0,3,NULL),(71,'静海县',40,0,3,NULL),(72,'蓟县',40,0,3,NULL),(73,'石家庄市',3,0,2,NULL),(74,'唐山市',3,0,2,NULL),(75,'秦皇岛市',3,0,2,NULL),(76,'邯郸市',3,0,2,NULL),(77,'邢台市',3,0,2,NULL),(78,'保定市',3,0,2,NULL),(79,'张家口市',3,0,2,NULL),(80,'承德市',3,0,2,NULL),(81,'衡水市',3,0,2,NULL),(82,'廊坊市',3,0,2,NULL),(83,'沧州市',3,0,2,NULL),(84,'太原市',4,0,2,NULL),(85,'大同市',4,0,2,NULL),(86,'阳泉市',4,0,2,NULL),(87,'长治市',4,0,2,NULL),(88,'晋城市',4,0,2,NULL),(89,'朔州市',4,0,2,NULL),(90,'晋中市',4,0,2,NULL),(91,'运城市',4,0,2,NULL),(92,'忻州市',4,0,2,NULL),(93,'临汾市',4,0,2,NULL),(94,'吕梁市',4,0,2,NULL),(95,'呼和浩特市',5,0,2,NULL),(96,'包头市',5,0,2,NULL),(97,'乌海市',5,0,2,NULL),(98,'赤峰市',5,0,2,NULL),(99,'通辽市',5,0,2,NULL),(100,'鄂尔多斯市',5,0,2,NULL),(101,'呼伦贝尔市',5,0,2,NULL),(102,'巴彦淖尔市',5,0,2,NULL),(103,'乌兰察布市',5,0,2,NULL),(104,'兴安盟',5,0,2,NULL),(105,'锡林郭勒盟',5,0,2,NULL),(106,'阿拉善盟',5,0,2,NULL),(107,'沈阳市',6,0,2,NULL),(108,'大连市',6,0,2,NULL),(109,'鞍山市',6,0,2,NULL),(110,'抚顺市',6,0,2,NULL),(111,'本溪市',6,0,2,NULL),(112,'丹东市',6,0,2,NULL),(113,'锦州市',6,0,2,NULL),(114,'营口市',6,0,2,NULL),(115,'阜新市',6,0,2,NULL),(116,'辽阳市',6,0,2,NULL),(117,'盘锦市',6,0,2,NULL),(118,'铁岭市',6,0,2,NULL),(119,'朝阳市',6,0,2,NULL),(120,'葫芦岛市',6,0,2,NULL),(121,'长春市',7,0,2,NULL),(122,'吉林市',7,0,2,NULL),(123,'四平市',7,0,2,NULL),(124,'辽源市',7,0,2,NULL),(125,'通化市',7,0,2,NULL),(126,'白山市',7,0,2,NULL),(127,'松原市',7,0,2,NULL),(128,'白城市',7,0,2,NULL),(129,'延边朝鲜族自治州',7,0,2,NULL),(130,'哈尔滨市',8,0,2,NULL),(131,'齐齐哈尔市',8,0,2,NULL),(132,'鸡西市',8,0,2,NULL),(133,'鹤岗市',8,0,2,NULL),(134,'双鸭山市',8,0,2,NULL),(135,'大庆市',8,0,2,NULL),(136,'伊春市',8,0,2,NULL),(137,'佳木斯市',8,0,2,NULL),(138,'七台河市',8,0,2,NULL),(139,'牡丹江市',8,0,2,NULL),(140,'黑河市',8,0,2,NULL),(141,'绥化市',8,0,2,NULL),(142,'大兴安岭地区',8,0,2,NULL),(143,'黄浦区',39,0,3,NULL),(144,'卢湾区',39,0,3,NULL),(145,'徐汇区',39,0,3,NULL),(146,'长宁区',39,0,3,NULL),(147,'静安区',39,0,3,NULL),(148,'普陀区',39,0,3,NULL),(149,'闸北区',39,0,3,NULL),(150,'虹口区',39,0,3,NULL),(151,'杨浦区',39,0,3,NULL),(152,'闵行区',39,0,3,NULL),(153,'宝山区',39,0,3,NULL),(154,'嘉定区',39,0,3,NULL),(155,'浦东新区',39,0,3,NULL),(156,'金山区',39,0,3,NULL),(157,'松江区',39,0,3,NULL),(158,'青浦区',39,0,3,NULL),(159,'南汇区',39,0,3,NULL),(160,'奉贤区',39,0,3,NULL),(161,'崇明县',39,0,3,NULL),(162,'南京市',10,0,2,NULL),(163,'无锡市',10,0,2,NULL),(164,'徐州市',10,0,2,NULL),(165,'常州市',10,0,2,NULL),(166,'苏州市',10,0,2,NULL),(167,'南通市',10,0,2,NULL),(168,'连云港市',10,0,2,NULL),(169,'淮安市',10,0,2,NULL),(170,'盐城市',10,0,2,NULL),(171,'扬州市',10,0,2,NULL),(172,'镇江市',10,0,2,NULL),(173,'泰州市',10,0,2,NULL),(174,'宿迁市',10,0,2,NULL),(175,'杭州市',11,0,2,NULL),(176,'宁波市',11,0,2,NULL),(177,'温州市',11,0,2,NULL),(178,'嘉兴市',11,0,2,NULL),(179,'湖州市',11,0,2,NULL),(180,'绍兴市',11,0,2,NULL),(181,'舟山市',11,0,2,NULL),(182,'衢州市',11,0,2,NULL),(183,'金华市',11,0,2,NULL),(184,'台州市',11,0,2,NULL),(185,'丽水市',11,0,2,NULL),(186,'合肥市',12,0,2,NULL),(187,'芜湖市',12,0,2,NULL),(188,'蚌埠市',12,0,2,NULL),(189,'淮南市',12,0,2,NULL),(190,'马鞍山市',12,0,2,NULL),(191,'淮北市',12,0,2,NULL),(192,'铜陵市',12,0,2,NULL),(193,'安庆市',12,0,2,NULL),(194,'黄山市',12,0,2,NULL),(195,'滁州市',12,0,2,NULL),(196,'阜阳市',12,0,2,NULL),(197,'宿州市',12,0,2,NULL),(198,'巢湖市',12,0,2,NULL),(199,'六安市',12,0,2,NULL),(200,'亳州市',12,0,2,NULL),(201,'池州市',12,0,2,NULL),(202,'宣城市',12,0,2,NULL),(203,'福州市',13,0,2,NULL),(204,'厦门市',13,0,2,NULL),(205,'莆田市',13,0,2,NULL),(206,'三明市',13,0,2,NULL),(207,'泉州市',13,0,2,NULL),(208,'漳州市',13,0,2,NULL),(209,'南平市',13,0,2,NULL),(210,'龙岩市',13,0,2,NULL),(211,'宁德市',13,0,2,NULL),(212,'南昌市',14,0,2,NULL),(213,'景德镇市',14,0,2,NULL),(214,'萍乡市',14,0,2,NULL),(215,'九江市',14,0,2,NULL),(216,'新余市',14,0,2,NULL),(217,'鹰潭市',14,0,2,NULL),(218,'赣州市',14,0,2,NULL),(219,'吉安市',14,0,2,NULL),(220,'宜春市',14,0,2,NULL),(221,'抚州市',14,0,2,NULL),(222,'上饶市',14,0,2,NULL),(223,'济南市',15,0,2,NULL),(224,'青岛市',15,0,2,NULL),(225,'淄博市',15,0,2,NULL),(226,'枣庄市',15,0,2,NULL),(227,'东营市',15,0,2,NULL),(228,'烟台市',15,0,2,NULL),(229,'潍坊市',15,0,2,NULL),(230,'济宁市',15,0,2,NULL),(231,'泰安市',15,0,2,NULL),(232,'威海市',15,0,2,NULL),(233,'日照市',15,0,2,NULL),(234,'莱芜市',15,0,2,NULL),(235,'临沂市',15,0,2,NULL),(236,'德州市',15,0,2,NULL),(237,'聊城市',15,0,2,NULL),(238,'滨州市',15,0,2,NULL),(239,'菏泽市',15,0,2,NULL),(240,'郑州市',16,0,2,NULL),(241,'开封市',16,0,2,NULL),(242,'洛阳市',16,0,2,NULL),(243,'平顶山市',16,0,2,NULL),(244,'安阳市',16,0,2,NULL),(245,'鹤壁市',16,0,2,NULL),(246,'新乡市',16,0,2,NULL),(247,'焦作市',16,0,2,NULL),(248,'濮阳市',16,0,2,NULL),(249,'许昌市',16,0,2,NULL),(250,'漯河市',16,0,2,NULL),(251,'三门峡市',16,0,2,NULL),(252,'南阳市',16,0,2,NULL),(253,'商丘市',16,0,2,NULL),(254,'信阳市',16,0,2,NULL),(255,'周口市',16,0,2,NULL),(256,'驻马店市',16,0,2,NULL),(257,'济源市',16,0,2,NULL),(258,'武汉市',17,0,2,NULL),(259,'黄石市',17,0,2,NULL),(260,'十堰市',17,0,2,NULL),(261,'宜昌市',17,0,2,NULL),(262,'襄樊市',17,0,2,NULL),(263,'鄂州市',17,0,2,NULL),(264,'荆门市',17,0,2,NULL),(265,'孝感市',17,0,2,NULL),(266,'荆州市',17,0,2,NULL),(267,'黄冈市',17,0,2,NULL),(268,'咸宁市',17,0,2,NULL),(269,'随州市',17,0,2,NULL),(270,'恩施土家族苗族自治州',17,0,2,NULL),(271,'仙桃市',17,0,2,NULL),(272,'潜江市',17,0,2,NULL),(273,'天门市',17,0,2,NULL),(274,'神农架林区',17,0,2,NULL),(275,'长沙市',18,0,2,NULL),(276,'株洲市',18,0,2,NULL),(277,'湘潭市',18,0,2,NULL),(278,'衡阳市',18,0,2,NULL),(279,'邵阳市',18,0,2,NULL),(280,'岳阳市',18,0,2,NULL),(281,'常德市',18,0,2,NULL),(282,'张家界市',18,0,2,NULL),(283,'益阳市',18,0,2,NULL),(284,'郴州市',18,0,2,NULL),(285,'永州市',18,0,2,NULL),(286,'怀化市',18,0,2,NULL),(287,'娄底市',18,0,2,NULL),(288,'湘西土家族苗族自治州',18,0,2,NULL),(289,'广州市',19,0,2,NULL),(290,'韶关市',19,0,2,NULL),(291,'深圳市',19,0,2,NULL),(292,'珠海市',19,0,2,NULL),(293,'汕头市',19,0,2,NULL),(294,'佛山市',19,0,2,NULL),(295,'江门市',19,0,2,NULL),(296,'湛江市',19,0,2,NULL),(297,'茂名市',19,0,2,NULL),(298,'肇庆市',19,0,2,NULL),(299,'惠州市',19,0,2,NULL),(300,'梅州市',19,0,2,NULL),(301,'汕尾市',19,0,2,NULL),(302,'河源市',19,0,2,NULL),(303,'阳江市',19,0,2,NULL),(304,'清远市',19,0,2,NULL),(305,'东莞市',19,0,2,NULL),(306,'中山市',19,0,2,NULL),(307,'潮州市',19,0,2,NULL),(308,'揭阳市',19,0,2,NULL),(309,'云浮市',19,0,2,NULL),(310,'南宁市',20,0,2,NULL),(311,'柳州市',20,0,2,NULL),(312,'桂林市',20,0,2,NULL),(313,'梧州市',20,0,2,NULL),(314,'北海市',20,0,2,NULL),(315,'防城港市',20,0,2,NULL),(316,'钦州市',20,0,2,NULL),(317,'贵港市',20,0,2,NULL),(318,'玉林市',20,0,2,NULL),(319,'百色市',20,0,2,NULL),(320,'贺州市',20,0,2,NULL),(321,'河池市',20,0,2,NULL),(322,'来宾市',20,0,2,NULL),(323,'崇左市',20,0,2,NULL),(324,'海口市',21,0,2,NULL),(325,'三亚市',21,0,2,NULL),(326,'五指山市',21,0,2,NULL),(327,'琼海市',21,0,2,NULL),(328,'儋州市',21,0,2,NULL),(329,'文昌市',21,0,2,NULL),(330,'万宁市',21,0,2,NULL),(331,'东方市',21,0,2,NULL),(332,'定安县',21,0,2,NULL),(333,'屯昌县',21,0,2,NULL),(334,'澄迈县',21,0,2,NULL),(335,'临高县',21,0,2,NULL),(336,'白沙黎族自治县',21,0,2,NULL),(337,'昌江黎族自治县',21,0,2,NULL),(338,'乐东黎族自治县',21,0,2,NULL),(339,'陵水黎族自治县',21,0,2,NULL),(340,'保亭黎族苗族自治县',21,0,2,NULL),(341,'琼中黎族苗族自治县',21,0,2,NULL),(342,'西沙群岛',21,0,2,NULL),(343,'南沙群岛',21,0,2,NULL),(344,'中沙群岛的岛礁及其海域',21,0,2,NULL),(345,'万州区',62,0,3,NULL),(346,'涪陵区',62,0,3,NULL),(347,'渝中区',62,0,3,NULL),(348,'大渡口区',62,0,3,NULL),(349,'江北区',62,0,3,NULL),(350,'沙坪坝区',62,0,3,NULL),(351,'九龙坡区',62,0,3,NULL),(352,'南岸区',62,0,3,NULL),(353,'北碚区',62,0,3,NULL),(354,'双桥区',62,0,3,NULL),(355,'万盛区',62,0,3,NULL),(356,'渝北区',62,0,3,NULL),(357,'巴南区',62,0,3,NULL),(358,'黔江区',62,0,3,NULL),(359,'长寿区',62,0,3,NULL),(360,'綦江县',62,0,3,NULL),(361,'潼南县',62,0,3,NULL),(362,'铜梁县',62,0,3,NULL),(363,'大足县',62,0,3,NULL),(364,'荣昌县',62,0,3,NULL),(365,'璧山县',62,0,3,NULL),(366,'梁平县',62,0,3,NULL),(367,'城口县',62,0,3,NULL),(368,'丰都县',62,0,3,NULL),(369,'垫江县',62,0,3,NULL),(370,'武隆县',62,0,3,NULL),(371,'忠县',62,0,3,NULL),(372,'开县',62,0,3,NULL),(373,'云阳县',62,0,3,NULL),(374,'奉节县',62,0,3,NULL),(375,'巫山县',62,0,3,NULL),(376,'巫溪县',62,0,3,NULL),(377,'石柱土家族自治县',62,0,3,NULL),(378,'秀山土家族苗族自治县',62,0,3,NULL),(379,'酉阳土家族苗族自治县',62,0,3,NULL),(380,'彭水苗族土家族自治县',62,0,3,NULL),(381,'江津市',62,0,3,NULL),(382,'合川市',62,0,3,NULL),(383,'永川市',62,0,3,NULL),(384,'南川市',62,0,3,NULL),(385,'成都市',23,0,2,NULL),(386,'自贡市',23,0,2,NULL),(387,'攀枝花市',23,0,2,NULL),(388,'泸州市',23,0,2,NULL),(389,'德阳市',23,0,2,NULL),(390,'绵阳市',23,0,2,NULL),(391,'广元市',23,0,2,NULL),(392,'遂宁市',23,0,2,NULL),(393,'内江市',23,0,2,NULL),(394,'乐山市',23,0,2,NULL),(395,'南充市',23,0,2,NULL),(396,'眉山市',23,0,2,NULL),(397,'宜宾市',23,0,2,NULL),(398,'广安市',23,0,2,NULL),(399,'达州市',23,0,2,NULL),(400,'雅安市',23,0,2,NULL),(401,'巴中市',23,0,2,NULL),(402,'资阳市',23,0,2,NULL),(403,'阿坝藏族羌族自治州',23,0,2,NULL),(404,'甘孜藏族自治州',23,0,2,NULL),(405,'凉山彝族自治州',23,0,2,NULL),(406,'贵阳市',24,0,2,NULL),(407,'六盘水市',24,0,2,NULL),(408,'遵义市',24,0,2,NULL),(409,'安顺市',24,0,2,NULL),(410,'铜仁地区',24,0,2,NULL),(411,'黔西南布依族苗族自治州',24,0,2,NULL),(412,'毕节地区',24,0,2,NULL),(413,'黔东南苗族侗族自治州',24,0,2,NULL),(414,'黔南布依族苗族自治州',24,0,2,NULL),(415,'昆明市',25,0,2,NULL),(416,'曲靖市',25,0,2,NULL),(417,'玉溪市',25,0,2,NULL),(418,'保山市',25,0,2,NULL),(419,'昭通市',25,0,2,NULL),(420,'丽江市',25,0,2,NULL),(421,'思茅市',25,0,2,NULL),(422,'临沧市',25,0,2,NULL),(423,'楚雄彝族自治州',25,0,2,NULL),(424,'红河哈尼族彝族自治州',25,0,2,NULL),(425,'文山壮族苗族自治州',25,0,2,NULL),(426,'西双版纳傣族自治州',25,0,2,NULL),(427,'大理白族自治州',25,0,2,NULL),(428,'德宏傣族景颇族自治州',25,0,2,NULL),(429,'怒江傈僳族自治州',25,0,2,NULL),(430,'迪庆藏族自治州',25,0,2,NULL),(431,'拉萨市',26,0,2,NULL),(432,'昌都地区',26,0,2,NULL),(433,'山南地区',26,0,2,NULL),(434,'日喀则地区',26,0,2,NULL),(435,'那曲地区',26,0,2,NULL),(436,'阿里地区',26,0,2,NULL),(437,'林芝地区',26,0,2,NULL),(438,'西安市',27,0,2,NULL),(439,'铜川市',27,0,2,NULL),(440,'宝鸡市',27,0,2,NULL),(441,'咸阳市',27,0,2,NULL),(442,'渭南市',27,0,2,NULL),(443,'延安市',27,0,2,NULL),(444,'汉中市',27,0,2,NULL),(445,'榆林市',27,0,2,NULL),(446,'安康市',27,0,2,NULL),(447,'商洛市',27,0,2,NULL),(448,'兰州市',28,0,2,NULL),(449,'嘉峪关市',28,0,2,NULL),(450,'金昌市',28,0,2,NULL),(451,'白银市',28,0,2,NULL),(452,'天水市',28,0,2,NULL),(453,'武威市',28,0,2,NULL),(454,'张掖市',28,0,2,NULL),(455,'平凉市',28,0,2,NULL),(456,'酒泉市',28,0,2,NULL),(457,'庆阳市',28,0,2,NULL),(458,'定西市',28,0,2,NULL),(459,'陇南市',28,0,2,NULL),(460,'临夏回族自治州',28,0,2,NULL),(461,'甘南藏族自治州',28,0,2,NULL),(462,'西宁市',29,0,2,NULL),(463,'海东地区',29,0,2,NULL),(464,'海北藏族自治州',29,0,2,NULL),(465,'黄南藏族自治州',29,0,2,NULL),(466,'海南藏族自治州',29,0,2,NULL),(467,'果洛藏族自治州',29,0,2,NULL),(468,'玉树藏族自治州',29,0,2,NULL),(469,'海西蒙古族藏族自治州',29,0,2,NULL),(470,'银川市',30,0,2,NULL),(471,'石嘴山市',30,0,2,NULL),(472,'吴忠市',30,0,2,NULL),(473,'固原市',30,0,2,NULL),(474,'中卫市',30,0,2,NULL),(475,'乌鲁木齐市',31,0,2,NULL),(476,'克拉玛依市',31,0,2,NULL),(477,'吐鲁番地区',31,0,2,NULL),(478,'哈密地区',31,0,2,NULL),(479,'昌吉回族自治州',31,0,2,NULL),(480,'博尔塔拉蒙古自治州',31,0,2,NULL),(481,'巴音郭楞蒙古自治州',31,0,2,NULL),(482,'阿克苏地区',31,0,2,NULL),(483,'克孜勒苏柯尔克孜自治州',31,0,2,NULL),(484,'喀什地区',31,0,2,NULL),(485,'和田地区',31,0,2,NULL),(486,'伊犁哈萨克自治州',31,0,2,NULL),(487,'塔城地区',31,0,2,NULL),(488,'阿勒泰地区',31,0,2,NULL),(489,'石河子市',31,0,2,NULL),(490,'阿拉尔市',31,0,2,NULL),(491,'图木舒克市',31,0,2,NULL),(492,'五家渠市',31,0,2,NULL),(493,'台北市',32,0,2,NULL),(494,'高雄市',32,0,2,NULL),(495,'基隆市',32,0,2,NULL),(496,'台中市',32,0,2,NULL),(497,'台南市',32,0,2,NULL),(498,'新竹市',32,0,2,NULL),(499,'嘉义市',32,0,2,NULL),(500,'台北县',32,0,2,NULL),(501,'宜兰县',32,0,2,NULL),(502,'桃园县',32,0,2,NULL),(503,'新竹县',32,0,2,NULL),(504,'苗栗县',32,0,2,NULL),(505,'台中县',32,0,2,NULL),(506,'彰化县',32,0,2,NULL),(507,'南投县',32,0,2,NULL),(508,'云林县',32,0,2,NULL),(509,'嘉义县',32,0,2,NULL),(510,'台南县',32,0,2,NULL),(511,'高雄县',32,0,2,NULL),(512,'屏东县',32,0,2,NULL),(513,'澎湖县',32,0,2,NULL),(514,'台东县',32,0,2,NULL),(515,'花莲县',32,0,2,NULL),(516,'中西区',33,0,2,NULL),(517,'东区',33,0,2,NULL),(518,'九龙城区',33,0,2,NULL),(519,'观塘区',33,0,2,NULL),(520,'南区',33,0,2,NULL),(521,'深水埗区',33,0,2,NULL),(522,'黄大仙区',33,0,2,NULL),(523,'湾仔区',33,0,2,NULL),(524,'油尖旺区',33,0,2,NULL),(525,'离岛区',33,0,2,NULL),(526,'葵青区',33,0,2,NULL),(527,'北区',33,0,2,NULL),(528,'西贡区',33,0,2,NULL),(529,'沙田区',33,0,2,NULL),(530,'屯门区',33,0,2,NULL),(531,'大埔区',33,0,2,NULL),(532,'荃湾区',33,0,2,NULL),(533,'元朗区',33,0,2,NULL),(534,'澳门特别行政区',34,0,2,NULL),(535,'美国',45055,0,3,NULL),(536,'加拿大',45055,0,3,NULL),(537,'澳大利亚',45055,0,3,NULL),(538,'新西兰',45055,0,3,NULL),(539,'英国',45055,0,3,NULL),(540,'法国',45055,0,3,NULL),(541,'德国',45055,0,3,NULL),(542,'捷克',45055,0,3,NULL),(543,'荷兰',45055,0,3,NULL),(544,'瑞士',45055,0,3,NULL),(545,'希腊',45055,0,3,NULL),(546,'挪威',45055,0,3,NULL),(547,'瑞典',45055,0,3,NULL),(548,'丹麦',45055,0,3,NULL),(549,'芬兰',45055,0,3,NULL),(550,'爱尔兰',45055,0,3,NULL),(551,'奥地利',45055,0,3,NULL),(552,'意大利',45055,0,3,NULL),(553,'乌克兰',45055,0,3,NULL),(554,'俄罗斯',45055,0,3,NULL),(555,'西班牙',45055,0,3,NULL),(556,'韩国',45055,0,3,NULL),(557,'新加坡',45055,0,3,NULL),(558,'马来西亚',45055,0,3,NULL),(559,'印度',45055,0,3,NULL),(560,'泰国',45055,0,3,NULL),(561,'日本',45055,0,3,NULL),(562,'巴西',45055,0,3,NULL),(563,'阿根廷',45055,0,3,NULL),(564,'南非',45055,0,3,NULL),(565,'埃及',45055,0,3,NULL),(566,'其他',36,0,3,NULL),(1126,'井陉县',73,0,3,NULL),(1127,'井陉矿区',73,0,3,NULL),(1128,'元氏县',73,0,3,NULL),(1129,'平山县',73,0,3,NULL),(1130,'新乐市',73,0,3,NULL),(1131,'新华区',73,0,3,NULL),(1132,'无极县',73,0,3,NULL),(1133,'晋州市',73,0,3,NULL),(1134,'栾城县',73,0,3,NULL),(1135,'桥东区',73,0,3,NULL),(1136,'桥西区',73,0,3,NULL),(1137,'正定县',73,0,3,NULL),(1138,'深泽县',73,0,3,NULL),(1139,'灵寿县',73,0,3,NULL),(1140,'藁城市',73,0,3,NULL),(1141,'行唐县',73,0,3,NULL),(1142,'裕华区',73,0,3,NULL),(1143,'赞皇县',73,0,3,NULL),(1144,'赵县',73,0,3,NULL),(1145,'辛集市',73,0,3,NULL),(1146,'长安区',73,0,3,NULL),(1147,'高邑县',73,0,3,NULL),(1148,'鹿泉市',73,0,3,NULL),(1149,'丰南区',74,0,3,NULL),(1150,'丰润区',74,0,3,NULL),(1151,'乐亭县',74,0,3,NULL),(1152,'古冶区',74,0,3,NULL),(1153,'唐海县',74,0,3,NULL),(1154,'开平区',74,0,3,NULL),(1155,'滦南县',74,0,3,NULL),(1156,'滦县',74,0,3,NULL),(1157,'玉田县',74,0,3,NULL),(1158,'路北区',74,0,3,NULL),(1159,'路南区',74,0,3,NULL),(1160,'迁安市',74,0,3,NULL),(1161,'迁西县',74,0,3,NULL),(1162,'遵化市',74,0,3,NULL),(1163,'北戴河区',75,0,3,NULL),(1164,'卢龙县',75,0,3,NULL),(1165,'山海关区',75,0,3,NULL),(1166,'抚宁县',75,0,3,NULL),(1167,'昌黎县',75,0,3,NULL),(1168,'海港区',75,0,3,NULL),(1169,'青龙满族自治县',75,0,3,NULL),(1170,'丛台区',76,0,3,NULL),(1171,'临漳县',76,0,3,NULL),(1172,'复兴区',76,0,3,NULL),(1173,'大名县',76,0,3,NULL),(1174,'峰峰矿区',76,0,3,NULL),(1175,'广平县',76,0,3,NULL),(1176,'成安县',76,0,3,NULL),(1177,'曲周县',76,0,3,NULL),(1178,'武安市',76,0,3,NULL),(1179,'永年县',76,0,3,NULL),(1180,'涉县',76,0,3,NULL),(1181,'磁县',76,0,3,NULL),(1182,'肥乡县',76,0,3,NULL),(1183,'邯山区',76,0,3,NULL),(1184,'邯郸县',76,0,3,NULL),(1185,'邱县',76,0,3,NULL),(1186,'馆陶县',76,0,3,NULL),(1187,'魏县',76,0,3,NULL),(1188,'鸡泽县',76,0,3,NULL),(1189,'临城县',77,0,3,NULL),(1190,'临西县',77,0,3,NULL),(1191,'任县',77,0,3,NULL),(1192,'内丘县',77,0,3,NULL),(1193,'南和县',77,0,3,NULL),(1194,'南宫市',77,0,3,NULL),(1195,'威县',77,0,3,NULL),(1196,'宁晋县',77,0,3,NULL),(1197,'巨鹿县',77,0,3,NULL),(1198,'平乡县',77,0,3,NULL),(1199,'广宗县',77,0,3,NULL),(1200,'新河县',77,0,3,NULL),(1201,'柏乡县',77,0,3,NULL),(1202,'桥东区',77,0,3,NULL),(1203,'桥西区',77,0,3,NULL),(1204,'沙河市',77,0,3,NULL),(1205,'清河县',77,0,3,NULL),(1206,'邢台县',77,0,3,NULL),(1207,'隆尧县',77,0,3,NULL),(1208,'北市区',78,0,3,NULL),(1209,'南市区',78,0,3,NULL),(1210,'博野县',78,0,3,NULL),(1211,'唐县',78,0,3,NULL),(1212,'安国市',78,0,3,NULL),(1213,'安新县',78,0,3,NULL),(1214,'定兴县',78,0,3,NULL),(1215,'定州市',78,0,3,NULL),(1216,'容城县',78,0,3,NULL),(1217,'徐水县',78,0,3,NULL),(1218,'新市区',78,0,3,NULL),(1219,'易县',78,0,3,NULL),(1220,'曲阳县',78,0,3,NULL),(1221,'望都县',78,0,3,NULL),(1222,'涞水县',78,0,3,NULL),(1223,'涞源县',78,0,3,NULL),(1224,'涿州市',78,0,3,NULL),(1225,'清苑县',78,0,3,NULL),(1226,'满城县',78,0,3,NULL),(1227,'蠡县',78,0,3,NULL),(1228,'阜平县',78,0,3,NULL),(1229,'雄县',78,0,3,NULL),(1230,'顺平县',78,0,3,NULL),(1231,'高碑店市',78,0,3,NULL),(1232,'高阳县',78,0,3,NULL),(1233,'万全县',79,0,3,NULL),(1234,'下花园区',79,0,3,NULL),(1235,'宣化区',79,0,3,NULL),(1236,'宣化县',79,0,3,NULL),(1237,'尚义县',79,0,3,NULL),(1238,'崇礼县',79,0,3,NULL),(1239,'康保县',79,0,3,NULL),(1240,'张北县',79,0,3,NULL),(1241,'怀安县',79,0,3,NULL),(1242,'怀来县',79,0,3,NULL),(1243,'桥东区',79,0,3,NULL),(1244,'桥西区',79,0,3,NULL),(1245,'沽源县',79,0,3,NULL),(1246,'涿鹿县',79,0,3,NULL),(1247,'蔚县',79,0,3,NULL),(1248,'赤城县',79,0,3,NULL),(1249,'阳原县',79,0,3,NULL),(1250,'丰宁满族自治县',80,0,3,NULL),(1251,'兴隆县',80,0,3,NULL),(1252,'双桥区',80,0,3,NULL),(1253,'双滦区',80,0,3,NULL),(1254,'围场满族蒙古族自治县',80,0,3,NULL),(1255,'宽城满族自治县',80,0,3,NULL),(1256,'平泉县',80,0,3,NULL),(1257,'承德县',80,0,3,NULL),(1258,'滦平县',80,0,3,NULL),(1259,'隆化县',80,0,3,NULL),(1260,'鹰手营子矿区',80,0,3,NULL),(1261,'冀州市',81,0,3,NULL),(1262,'安平县',81,0,3,NULL),(1263,'故城县',81,0,3,NULL),(1264,'景县',81,0,3,NULL),(1265,'枣强县',81,0,3,NULL),(1266,'桃城区',81,0,3,NULL),(1267,'武强县',81,0,3,NULL),(1268,'武邑县',81,0,3,NULL),(1269,'深州市',81,0,3,NULL),(1270,'阜城县',81,0,3,NULL),(1271,'饶阳县',81,0,3,NULL),(1272,'三河市',82,0,3,NULL),(1273,'固安县',82,0,3,NULL),(1274,'大厂回族自治县',82,0,3,NULL),(1275,'大城县',82,0,3,NULL),(1276,'安次区',82,0,3,NULL),(1277,'广阳区',82,0,3,NULL),(1278,'文安县',82,0,3,NULL),(1279,'永清县',82,0,3,NULL),(1280,'霸州市',82,0,3,NULL),(1281,'香河县',82,0,3,NULL),(1282,'东光县',83,0,3,NULL),(1283,'任丘市',83,0,3,NULL),(1284,'南皮县',83,0,3,NULL),(1285,'吴桥县',83,0,3,NULL),(1286,'孟村回族自治县',83,0,3,NULL),(1287,'新华区',83,0,3,NULL),(1288,'沧县',83,0,3,NULL),(1289,'河间市',83,0,3,NULL),(1290,'泊头市',83,0,3,NULL),(1291,'海兴县',83,0,3,NULL),(1292,'献县',83,0,3,NULL),(1293,'盐山县',83,0,3,NULL),(1294,'肃宁县',83,0,3,NULL),(1295,'运河区',83,0,3,NULL),(1296,'青县',83,0,3,NULL),(1297,'黄骅市',83,0,3,NULL),(1298,'万柏林区',84,0,3,NULL),(1299,'古交市',84,0,3,NULL),(1300,'娄烦县',84,0,3,NULL),(1301,'小店区',84,0,3,NULL),(1302,'尖草坪区',84,0,3,NULL),(1303,'晋源区',84,0,3,NULL),(1304,'杏花岭区',84,0,3,NULL),(1305,'清徐县',84,0,3,NULL),(1306,'迎泽区',84,0,3,NULL),(1307,'阳曲县',84,0,3,NULL),(1308,'南郊区',85,0,3,NULL),(1309,'城区',85,0,3,NULL),(1310,'大同县',85,0,3,NULL),(1311,'天镇县',85,0,3,NULL),(1312,'左云县',85,0,3,NULL),(1313,'广灵县',85,0,3,NULL),(1314,'新荣区',85,0,3,NULL),(1315,'浑源县',85,0,3,NULL),(1316,'灵丘县',85,0,3,NULL),(1317,'矿区',85,0,3,NULL),(1318,'阳高县',85,0,3,NULL),(1319,'城区',86,0,3,NULL),(1320,'平定县',86,0,3,NULL),(1321,'盂县',86,0,3,NULL),(1322,'矿区',86,0,3,NULL),(1323,'郊区',86,0,3,NULL),(1324,'城区',87,0,3,NULL),(1325,'壶关县',87,0,3,NULL),(1326,'屯留县',87,0,3,NULL),(1327,'平顺县',87,0,3,NULL),(1328,'武乡县',87,0,3,NULL),(1329,'沁县',87,0,3,NULL),(1330,'沁源县',87,0,3,NULL),(1331,'潞城市',87,0,3,NULL),(1332,'襄垣县',87,0,3,NULL),(1333,'郊区',87,0,3,NULL),(1334,'长子县',87,0,3,NULL),(1335,'长治县',87,0,3,NULL),(1336,'黎城县',87,0,3,NULL),(1337,'城区',88,0,3,NULL),(1338,'沁水县',88,0,3,NULL),(1339,'泽州县',88,0,3,NULL),(1340,'阳城县',88,0,3,NULL),(1341,'陵川县',88,0,3,NULL),(1342,'高平市',88,0,3,NULL),(1343,'右玉县',89,0,3,NULL),(1344,'山阴县',89,0,3,NULL),(1345,'平鲁区',89,0,3,NULL),(1346,'应县',89,0,3,NULL),(1347,'怀仁县',89,0,3,NULL),(1348,'朔城区',89,0,3,NULL),(1349,'介休市',90,0,3,NULL),(1350,'和顺县',90,0,3,NULL),(1351,'太谷县',90,0,3,NULL),(1352,'寿阳县',90,0,3,NULL),(1353,'左权县',90,0,3,NULL),(1354,'平遥县',90,0,3,NULL),(1355,'昔阳县',90,0,3,NULL),(1356,'榆次区',90,0,3,NULL),(1357,'榆社县',90,0,3,NULL),(1358,'灵石县',90,0,3,NULL),(1359,'祁县',90,0,3,NULL),(1360,'万荣县',91,0,3,NULL),(1361,'临猗县',91,0,3,NULL),(1362,'垣曲县',91,0,3,NULL),(1363,'夏县',91,0,3,NULL),(1364,'平陆县',91,0,3,NULL),(1365,'新绛县',91,0,3,NULL),(1366,'永济市',91,0,3,NULL),(1367,'河津市',91,0,3,NULL),(1368,'盐湖区',91,0,3,NULL),(1369,'稷山县',91,0,3,NULL),(1370,'绛县',91,0,3,NULL),(1371,'芮城县',91,0,3,NULL),(1372,'闻喜县',91,0,3,NULL),(1373,'五台县',92,0,3,NULL),(1374,'五寨县',92,0,3,NULL),(1375,'代县',92,0,3,NULL),(1376,'保德县',92,0,3,NULL),(1377,'偏关县',92,0,3,NULL),(1378,'原平市',92,0,3,NULL),(1379,'宁武县',92,0,3,NULL),(1380,'定襄县',92,0,3,NULL),(1381,'岢岚县',92,0,3,NULL),(1382,'忻府区',92,0,3,NULL),(1383,'河曲县',92,0,3,NULL),(1384,'神池县',92,0,3,NULL),(1385,'繁峙县',92,0,3,NULL),(1386,'静乐县',92,0,3,NULL),(1387,'乡宁县',93,0,3,NULL),(1388,'侯马市',93,0,3,NULL),(1389,'古县',93,0,3,NULL),(1390,'吉县',93,0,3,NULL),(1391,'大宁县',93,0,3,NULL),(1392,'安泽县',93,0,3,NULL),(1393,'尧都区',93,0,3,NULL),(1394,'曲沃县',93,0,3,NULL),(1395,'永和县',93,0,3,NULL),(1396,'汾西县',93,0,3,NULL),(1397,'洪洞县',93,0,3,NULL),(1398,'浮山县',93,0,3,NULL),(1399,'翼城县',93,0,3,NULL),(1400,'蒲县',93,0,3,NULL),(1401,'襄汾县',93,0,3,NULL),(1402,'隰县',93,0,3,NULL),(1403,'霍州市',93,0,3,NULL),(1404,'中阳县',94,0,3,NULL),(1405,'临县',94,0,3,NULL),(1406,'交口县',94,0,3,NULL),(1407,'交城县',94,0,3,NULL),(1408,'兴县',94,0,3,NULL),(1409,'孝义市',94,0,3,NULL),(1410,'岚县',94,0,3,NULL),(1411,'文水县',94,0,3,NULL),(1412,'方山县',94,0,3,NULL),(1413,'柳林县',94,0,3,NULL),(1414,'汾阳市',94,0,3,NULL),(1415,'石楼县',94,0,3,NULL),(1416,'离石区',94,0,3,NULL),(1417,'和林格尔县',95,0,3,NULL),(1418,'回民区',95,0,3,NULL),(1419,'土默特左旗',95,0,3,NULL),(1420,'托克托县',95,0,3,NULL),(1421,'新城区',95,0,3,NULL),(1422,'武川县',95,0,3,NULL),(1423,'清水河县',95,0,3,NULL),(1424,'玉泉区',95,0,3,NULL),(1425,'赛罕区',95,0,3,NULL),(1426,'东河区',96,0,3,NULL),(1427,'九原区',96,0,3,NULL),(1428,'固阳县',96,0,3,NULL),(1429,'土默特右旗',96,0,3,NULL),(1430,'昆都仑区',96,0,3,NULL),(1431,'白云矿区',96,0,3,NULL),(1432,'石拐区',96,0,3,NULL),(1433,'达尔罕茂明安联合旗',96,0,3,NULL),(1434,'青山区',96,0,3,NULL),(1435,'乌达区',97,0,3,NULL),(1436,'海勃湾区',97,0,3,NULL),(1437,'海南区',97,0,3,NULL),(1438,'元宝山区',98,0,3,NULL),(1439,'克什克腾旗',98,0,3,NULL),(1440,'喀喇沁旗',98,0,3,NULL),(1441,'宁城县',98,0,3,NULL),(1442,'巴林右旗',98,0,3,NULL),(1443,'巴林左旗',98,0,3,NULL),(1444,'敖汉旗',98,0,3,NULL),(1445,'松山区',98,0,3,NULL),(1446,'林西县',98,0,3,NULL),(1447,'红山区',98,0,3,NULL),(1448,'翁牛特旗',98,0,3,NULL),(1449,'阿鲁科尔沁旗',98,0,3,NULL),(1450,'奈曼旗',99,0,3,NULL),(1451,'库伦旗',99,0,3,NULL),(1452,'开鲁县',99,0,3,NULL),(1453,'扎鲁特旗',99,0,3,NULL),(1454,'科尔沁区',99,0,3,NULL),(1455,'科尔沁左翼中旗',99,0,3,NULL),(1456,'科尔沁左翼后旗',99,0,3,NULL),(1457,'霍林郭勒市',99,0,3,NULL),(1458,'东胜区',100,0,3,NULL),(1459,'乌审旗',100,0,3,NULL),(1460,'伊金霍洛旗',100,0,3,NULL),(1461,'准格尔旗',100,0,3,NULL),(1462,'杭锦旗',100,0,3,NULL),(1463,'达拉特旗',100,0,3,NULL),(1464,'鄂东胜区',100,0,3,NULL),(1465,'鄂托克前旗',100,0,3,NULL),(1466,'鄂托克旗',100,0,3,NULL),(1467,'扎兰屯市',101,0,3,NULL),(1468,'新巴尔虎右旗',101,0,3,NULL),(1469,'新巴尔虎左旗',101,0,3,NULL),(1470,'根河市',101,0,3,NULL),(1471,'海拉尔区',101,0,3,NULL),(1472,'满洲里市',101,0,3,NULL),(1473,'牙克石市',101,0,3,NULL),(1474,'莫力达瓦达斡尔族自治旗',101,0,3,NULL),(1475,'鄂伦春自治旗',101,0,3,NULL),(1476,'鄂温克族自治旗',101,0,3,NULL),(1477,'阿荣旗',101,0,3,NULL),(1478,'陈巴尔虎旗',101,0,3,NULL),(1479,'额尔古纳市',101,0,3,NULL),(1480,'临河区',102,0,3,NULL),(1481,'乌拉特中旗',102,0,3,NULL),(1482,'乌拉特前旗',102,0,3,NULL),(1483,'乌拉特后旗',102,0,3,NULL),(1484,'五原县',102,0,3,NULL),(1485,'杭锦后旗',102,0,3,NULL),(1486,'磴口县',102,0,3,NULL),(1487,'丰镇市',103,0,3,NULL),(1488,'兴和县',103,0,3,NULL),(1489,'凉城县',103,0,3,NULL),(1490,'化德县',103,0,3,NULL),(1491,'卓资县',103,0,3,NULL),(1492,'商都县',103,0,3,NULL),(1493,'四子王旗',103,0,3,NULL),(1494,'察哈尔右翼中旗',103,0,3,NULL),(1495,'察哈尔右翼前旗',103,0,3,NULL),(1496,'察哈尔右翼后旗',103,0,3,NULL),(1497,'集宁区',103,0,3,NULL),(1498,'乌兰浩特市',104,0,3,NULL),(1499,'扎赉特旗',104,0,3,NULL),(1500,'科尔沁右翼中旗',104,0,3,NULL),(1501,'科尔沁右翼前旗',104,0,3,NULL),(1502,'突泉县',104,0,3,NULL),(1503,'阿尔山市',104,0,3,NULL),(1504,'东乌珠穆沁旗',105,0,3,NULL),(1505,'二连浩特市',105,0,3,NULL),(1506,'多伦县',105,0,3,NULL),(1507,'太仆寺旗',105,0,3,NULL),(1508,'正蓝旗',105,0,3,NULL),(1509,'正镶白旗',105,0,3,NULL),(1510,'苏尼特右旗',105,0,3,NULL),(1511,'苏尼特左旗',105,0,3,NULL),(1512,'西乌珠穆沁旗',105,0,3,NULL),(1513,'锡林浩特市',105,0,3,NULL),(1514,'镶黄旗',105,0,3,NULL),(1515,'阿巴嘎旗',105,0,3,NULL),(1516,'阿拉善右旗',106,0,3,NULL),(1517,'阿拉善左旗',106,0,3,NULL),(1518,'额济纳旗',106,0,3,NULL),(1519,'东陵区',107,0,3,NULL),(1520,'于洪区',107,0,3,NULL),(1521,'和平区',107,0,3,NULL),(1522,'大东区',107,0,3,NULL),(1523,'康平县',107,0,3,NULL),(1524,'新民市',107,0,3,NULL),(1525,'沈北新区',107,0,3,NULL),(1526,'沈河区',107,0,3,NULL),(1527,'法库县',107,0,3,NULL),(1528,'皇姑区',107,0,3,NULL),(1529,'苏家屯区',107,0,3,NULL),(1530,'辽中县',107,0,3,NULL),(1531,'铁西区',107,0,3,NULL),(1532,'中山区',108,0,3,NULL),(1533,'庄河市',108,0,3,NULL),(1534,'旅顺口区',108,0,3,NULL),(1535,'普兰店市',108,0,3,NULL),(1536,'沙河口区',108,0,3,NULL),(1537,'瓦房店市',108,0,3,NULL),(1538,'甘井子区',108,0,3,NULL),(1539,'西岗区',108,0,3,NULL),(1540,'金州区',108,0,3,NULL),(1541,'长海县',108,0,3,NULL),(1542,'千山区',109,0,3,NULL),(1543,'台安县',109,0,3,NULL),(1544,'岫岩满族自治县',109,0,3,NULL),(1545,'海城市',109,0,3,NULL),(1546,'立山区',109,0,3,NULL),(1547,'铁东区',109,0,3,NULL),(1548,'铁西区',109,0,3,NULL),(1549,'东洲区',110,0,3,NULL),(1550,'抚顺县',110,0,3,NULL),(1551,'新宾满族自治县',110,0,3,NULL),(1552,'新抚区',110,0,3,NULL),(1553,'望花区',110,0,3,NULL),(1554,'清原满族自治县',110,0,3,NULL),(1555,'顺城区',110,0,3,NULL),(1556,'南芬区',111,0,3,NULL),(1557,'平山区',111,0,3,NULL),(1558,'明山区',111,0,3,NULL),(1559,'本溪满族自治县',111,0,3,NULL),(1560,'桓仁满族自治县',111,0,3,NULL),(1561,'溪湖区',111,0,3,NULL),(1562,'东港市',112,0,3,NULL),(1563,'元宝区',112,0,3,NULL),(1564,'凤城市',112,0,3,NULL),(1565,'宽甸满族自治县',112,0,3,NULL),(1566,'振兴区',112,0,3,NULL),(1567,'振安区',112,0,3,NULL),(1568,'义县',113,0,3,NULL),(1569,'凌河区',113,0,3,NULL),(1570,'凌海市',113,0,3,NULL),(1571,'北镇市',113,0,3,NULL),(1572,'古塔区',113,0,3,NULL),(1573,'太和区',113,0,3,NULL),(1574,'黑山县',113,0,3,NULL),(1575,'大石桥市',114,0,3,NULL),(1576,'盖州市',114,0,3,NULL),(1577,'站前区',114,0,3,NULL),(1578,'老边区',114,0,3,NULL),(1579,'西市区',114,0,3,NULL),(1580,'鲅鱼圈区',114,0,3,NULL),(1581,'太平区',115,0,3,NULL),(1582,'彰武县',115,0,3,NULL),(1583,'新邱区',115,0,3,NULL),(1584,'海州区',115,0,3,NULL),(1585,'清河门区',115,0,3,NULL),(1586,'细河区',115,0,3,NULL),(1587,'蒙古族自治县',115,0,3,NULL),(1588,'太子河区',116,0,3,NULL),(1589,'宏伟区',116,0,3,NULL),(1590,'弓长岭区',116,0,3,NULL),(1591,'文圣区',116,0,3,NULL),(1592,'灯塔市',116,0,3,NULL),(1593,'白塔区',116,0,3,NULL),(1594,'辽阳县',116,0,3,NULL),(1595,'兴隆台区',117,0,3,NULL),(1596,'双台子区',117,0,3,NULL),(1597,'大洼县',117,0,3,NULL),(1598,'盘山县',117,0,3,NULL),(1599,'开原市',118,0,3,NULL),(1600,'昌图县',118,0,3,NULL),(1601,'清河区',118,0,3,NULL),(1602,'西丰县',118,0,3,NULL),(1603,'调兵山市',118,0,3,NULL),(1604,'铁岭县',118,0,3,NULL),(1605,'银州区',118,0,3,NULL),(1606,'凌源市',119,0,3,NULL),(1607,'北票市',119,0,3,NULL),(1608,'双塔区',119,0,3,NULL),(1609,'喀喇沁左翼蒙古族自治县',119,0,3,NULL),(1610,'建平县',119,0,3,NULL),(1611,'朝阳县',119,0,3,NULL),(1612,'龙城区',119,0,3,NULL),(1613,'兴城市',120,0,3,NULL),(1614,'南票区',120,0,3,NULL),(1615,'建昌县',120,0,3,NULL),(1616,'绥中县',120,0,3,NULL),(1617,'连山区',120,0,3,NULL),(1618,'龙港区',120,0,3,NULL),(1619,'九台市',121,0,3,NULL),(1620,'二道区',121,0,3,NULL),(1621,'农安县',121,0,3,NULL),(1622,'南关区',121,0,3,NULL),(1623,'双阳区',121,0,3,NULL),(1624,'宽城区',121,0,3,NULL),(1625,'德惠市',121,0,3,NULL),(1626,'朝阳区',121,0,3,NULL),(1627,'榆树市',121,0,3,NULL),(1628,'绿园区',121,0,3,NULL),(1629,'丰满区',122,0,3,NULL),(1630,'昌邑区',122,0,3,NULL),(1631,'桦甸市',122,0,3,NULL),(1632,'永吉县',122,0,3,NULL),(1633,'磐石市',122,0,3,NULL),(1634,'舒兰市',122,0,3,NULL),(1635,'船营区',122,0,3,NULL),(1636,'蛟河市',122,0,3,NULL),(1637,'龙潭区',122,0,3,NULL),(1638,'伊通满族自治县',123,0,3,NULL),(1639,'公主岭市',123,0,3,NULL),(1640,'双辽市',123,0,3,NULL),(1641,'梨树县',123,0,3,NULL),(1642,'铁东区',123,0,3,NULL),(1643,'铁西区',123,0,3,NULL),(1644,'东丰县',124,0,3,NULL),(1645,'东辽县',124,0,3,NULL),(1646,'西安区',124,0,3,NULL),(1647,'龙山区',124,0,3,NULL),(1648,'东昌区',125,0,3,NULL),(1649,'二道江区',125,0,3,NULL),(1650,'柳河县',125,0,3,NULL),(1651,'梅河口市',125,0,3,NULL),(1652,'辉南县',125,0,3,NULL),(1653,'通化县',125,0,3,NULL),(1654,'集安市',125,0,3,NULL),(1655,'临江市',126,0,3,NULL),(1656,'八道江区',126,0,3,NULL),(1657,'抚松县',126,0,3,NULL),(1658,'江源区',126,0,3,NULL),(1659,'长白朝鲜族自治县',126,0,3,NULL),(1660,'靖宇县',126,0,3,NULL),(1661,'干安县',127,0,3,NULL),(1662,'前郭尔罗斯蒙古族自治县',127,0,3,NULL),(1663,'宁江区',127,0,3,NULL),(1664,'扶余县',127,0,3,NULL),(1665,'长岭县',127,0,3,NULL),(1666,'大安市',128,0,3,NULL),(1667,'洮北区',128,0,3,NULL),(1668,'洮南市',128,0,3,NULL),(1669,'通榆县',128,0,3,NULL),(1670,'镇赉县',128,0,3,NULL),(1671,'和龙市',129,0,3,NULL),(1672,'图们市',129,0,3,NULL),(1673,'安图县',129,0,3,NULL),(1674,'延吉市',129,0,3,NULL),(1675,'敦化市',129,0,3,NULL),(1676,'汪清县',129,0,3,NULL),(1677,'珲春市',129,0,3,NULL),(1678,'龙井市',129,0,3,NULL),(1679,'五常市',130,0,3,NULL),(1680,'依兰县',130,0,3,NULL),(1681,'南岗区',130,0,3,NULL),(1682,'双城市',130,0,3,NULL),(1683,'呼兰区',130,0,3,NULL),(1684,'哈尔滨市道里区',130,0,3,NULL),(1685,'宾县',130,0,3,NULL),(1686,'尚志市',130,0,3,NULL),(1687,'巴彦县',130,0,3,NULL),(1688,'平房区',130,0,3,NULL),(1689,'延寿县',130,0,3,NULL),(1690,'方正县',130,0,3,NULL),(1691,'木兰县',130,0,3,NULL),(1692,'松北区',130,0,3,NULL),(1693,'通河县',130,0,3,NULL),(1694,'道外区',130,0,3,NULL),(1695,'阿城区',130,0,3,NULL),(1696,'香坊区',130,0,3,NULL),(1697,'依安县',131,0,3,NULL),(1698,'克东县',131,0,3,NULL),(1699,'克山县',131,0,3,NULL),(1700,'富拉尔基区',131,0,3,NULL),(1701,'富裕县',131,0,3,NULL),(1702,'建华区',131,0,3,NULL),(1703,'拜泉县',131,0,3,NULL),(1704,'昂昂溪区',131,0,3,NULL),(1705,'梅里斯达斡尔族区',131,0,3,NULL),(1706,'泰来县',131,0,3,NULL),(1707,'甘南县',131,0,3,NULL),(1708,'碾子山区',131,0,3,NULL),(1709,'讷河市',131,0,3,NULL),(1710,'铁锋区',131,0,3,NULL),(1711,'龙江县',131,0,3,NULL),(1712,'龙沙区',131,0,3,NULL),(1713,'城子河区',132,0,3,NULL),(1714,'密山市',132,0,3,NULL),(1715,'恒山区',132,0,3,NULL),(1716,'梨树区',132,0,3,NULL),(1717,'滴道区',132,0,3,NULL),(1718,'虎林市',132,0,3,NULL),(1719,'鸡东县',132,0,3,NULL),(1720,'鸡冠区',132,0,3,NULL),(1721,'麻山区',132,0,3,NULL),(1722,'东山区',133,0,3,NULL),(1723,'兴安区',133,0,3,NULL),(1724,'兴山区',133,0,3,NULL),(1725,'南山区',133,0,3,NULL),(1726,'向阳区',133,0,3,NULL),(1727,'工农区',133,0,3,NULL),(1728,'绥滨县',133,0,3,NULL),(1729,'萝北县',133,0,3,NULL),(1730,'友谊县',134,0,3,NULL),(1731,'四方台区',134,0,3,NULL),(1732,'宝山区',134,0,3,NULL),(1733,'宝清县',134,0,3,NULL),(1734,'尖山区',134,0,3,NULL),(1735,'岭东区',134,0,3,NULL),(1736,'集贤县',134,0,3,NULL),(1737,'饶河县',134,0,3,NULL),(1738,'大同区',135,0,3,NULL),(1739,'杜尔伯特蒙古族自治县',135,0,3,NULL),(1740,'林甸县',135,0,3,NULL),(1741,'红岗区',135,0,3,NULL),(1742,'肇州县',135,0,3,NULL),(1743,'肇源县',135,0,3,NULL),(1744,'胡路区',135,0,3,NULL),(1745,'萨尔图区',135,0,3,NULL),(1746,'龙凤区',135,0,3,NULL),(1747,'上甘岭区',136,0,3,NULL),(1748,'乌伊岭区',136,0,3,NULL),(1749,'乌马河区',136,0,3,NULL),(1750,'五营区',136,0,3,NULL),(1751,'伊春区',136,0,3,NULL),(1752,'南岔区',136,0,3,NULL),(1753,'友好区',136,0,3,NULL),(1754,'嘉荫县',136,0,3,NULL),(1755,'带岭区',136,0,3,NULL),(1756,'新青区',136,0,3,NULL),(1757,'汤旺河区',136,0,3,NULL),(1758,'红星区',136,0,3,NULL),(1759,'美溪区',136,0,3,NULL),(1760,'翠峦区',136,0,3,NULL),(1761,'西林区',136,0,3,NULL),(1762,'金山屯区',136,0,3,NULL),(1763,'铁力市',136,0,3,NULL),(1764,'东风区',137,0,3,NULL),(1765,'前进区',137,0,3,NULL),(1766,'同江市',137,0,3,NULL),(1767,'向阳区',137,0,3,NULL),(1768,'富锦市',137,0,3,NULL),(1769,'抚远县',137,0,3,NULL),(1770,'桦南县',137,0,3,NULL),(1771,'桦川县',137,0,3,NULL),(1772,'汤原县',137,0,3,NULL),(1773,'郊区',137,0,3,NULL),(1774,'勃利县',138,0,3,NULL),(1775,'新兴区',138,0,3,NULL),(1776,'桃山区',138,0,3,NULL),(1777,'茄子河区',138,0,3,NULL),(1778,'东宁县',139,0,3,NULL),(1779,'东安区',139,0,3,NULL),(1780,'宁安市',139,0,3,NULL),(1781,'林口县',139,0,3,NULL),(1782,'海林市',139,0,3,NULL),(1783,'爱民区',139,0,3,NULL),(1784,'穆棱市',139,0,3,NULL),(1785,'绥芬河市',139,0,3,NULL),(1786,'西安区',139,0,3,NULL),(1787,'阳明区',139,0,3,NULL),(1788,'五大连池市',140,0,3,NULL),(1789,'北安市',140,0,3,NULL),(1790,'嫩江县',140,0,3,NULL),(1791,'孙吴县',140,0,3,NULL),(1792,'爱辉区',140,0,3,NULL),(1793,'车逊克县',140,0,3,NULL),(1794,'逊克县',140,0,3,NULL),(1795,'兰西县',141,0,3,NULL),(1796,'安达市',141,0,3,NULL),(1797,'庆安县',141,0,3,NULL),(1798,'明水县',141,0,3,NULL),(1799,'望奎县',141,0,3,NULL),(1800,'海伦市',141,0,3,NULL),(1801,'绥化市北林区',141,0,3,NULL),(1802,'绥棱县',141,0,3,NULL),(1803,'肇东市',141,0,3,NULL),(1804,'青冈县',141,0,3,NULL),(1805,'呼玛县',142,0,3,NULL),(1806,'塔河县',142,0,3,NULL),(1807,'大兴安岭地区加格达奇区',142,0,3,NULL),(1808,'大兴安岭地区呼中区',142,0,3,NULL),(1809,'大兴安岭地区新林区',142,0,3,NULL),(1810,'大兴安岭地区松岭区',142,0,3,NULL),(1811,'漠河县',142,0,3,NULL),(2027,'下关区',162,0,3,NULL),(2028,'六合区',162,0,3,NULL),(2029,'建邺区',162,0,3,NULL),(2030,'栖霞区',162,0,3,NULL),(2031,'江宁区',162,0,3,NULL),(2032,'浦口区',162,0,3,NULL),(2033,'溧水县',162,0,3,NULL),(2034,'玄武区',162,0,3,NULL),(2035,'白下区',162,0,3,NULL),(2036,'秦淮区',162,0,3,NULL),(2037,'雨花台区',162,0,3,NULL),(2038,'高淳县',162,0,3,NULL),(2039,'鼓楼区',162,0,3,NULL),(2040,'北塘区',163,0,3,NULL),(2041,'南长区',163,0,3,NULL),(2042,'宜兴市',163,0,3,NULL),(2043,'崇安区',163,0,3,NULL),(2044,'惠山区',163,0,3,NULL),(2045,'江阴市',163,0,3,NULL),(2046,'滨湖区',163,0,3,NULL),(2047,'锡山区',163,0,3,NULL),(2048,'丰县',164,0,3,NULL),(2049,'九里区',164,0,3,NULL),(2050,'云龙区',164,0,3,NULL),(2051,'新沂市',164,0,3,NULL),(2052,'沛县',164,0,3,NULL),(2053,'泉山区',164,0,3,NULL),(2054,'睢宁县',164,0,3,NULL),(2055,'贾汪区',164,0,3,NULL),(2056,'邳州市',164,0,3,NULL),(2057,'铜山县',164,0,3,NULL),(2058,'鼓楼区',164,0,3,NULL),(2059,'天宁区',165,0,3,NULL),(2060,'戚墅堰区',165,0,3,NULL),(2061,'新北区',165,0,3,NULL),(2062,'武进区',165,0,3,NULL),(2063,'溧阳市',165,0,3,NULL),(2064,'金坛市',165,0,3,NULL),(2065,'钟楼区',165,0,3,NULL),(2066,'吴中区',166,0,3,NULL),(2067,'吴江市',166,0,3,NULL),(2068,'太仓市',166,0,3,NULL),(2069,'常熟市',166,0,3,NULL),(2070,'平江区',166,0,3,NULL),(2071,'张家港市',166,0,3,NULL),(2072,'昆山市',166,0,3,NULL),(2073,'沧浪区',166,0,3,NULL),(2074,'相城区',166,0,3,NULL),(2075,'苏州工业园区',166,0,3,NULL),(2076,'虎丘区',166,0,3,NULL),(2077,'金阊区',166,0,3,NULL),(2078,'启东市',167,0,3,NULL),(2079,'如东县',167,0,3,NULL),(2080,'如皋市',167,0,3,NULL),(2081,'崇川区',167,0,3,NULL),(2082,'海安县',167,0,3,NULL),(2083,'海门市',167,0,3,NULL),(2084,'港闸区',167,0,3,NULL),(2085,'通州市',167,0,3,NULL),(2086,'东海县',168,0,3,NULL),(2087,'新浦区',168,0,3,NULL),(2088,'海州区',168,0,3,NULL),(2089,'灌云县',168,0,3,NULL),(2090,'灌南县',168,0,3,NULL),(2091,'赣榆县',168,0,3,NULL),(2092,'连云区',168,0,3,NULL),(2093,'楚州区',169,0,3,NULL),(2094,'洪泽县',169,0,3,NULL),(2095,'涟水县',169,0,3,NULL),(2096,'淮阴区',169,0,3,NULL),(2097,'清河区',169,0,3,NULL),(2098,'清浦区',169,0,3,NULL),(2099,'盱眙县',169,0,3,NULL),(2100,'金湖县',169,0,3,NULL),(2101,'东台市',170,0,3,NULL),(2102,'亭湖区',170,0,3,NULL),(2103,'响水县',170,0,3,NULL),(2104,'大丰市',170,0,3,NULL),(2105,'射阳县',170,0,3,NULL),(2106,'建湖县',170,0,3,NULL),(2107,'滨海县',170,0,3,NULL),(2108,'盐都区',170,0,3,NULL),(2109,'阜宁县',170,0,3,NULL),(2110,'仪征市',171,0,3,NULL),(2111,'宝应县',171,0,3,NULL),(2112,'广陵区',171,0,3,NULL),(2113,'江都市',171,0,3,NULL),(2114,'维扬区',171,0,3,NULL),(2115,'邗江区',171,0,3,NULL),(2116,'高邮市',171,0,3,NULL),(2117,'丹徒区',172,0,3,NULL),(2118,'丹阳市',172,0,3,NULL),(2119,'京口区',172,0,3,NULL),(2120,'句容市',172,0,3,NULL),(2121,'扬中市',172,0,3,NULL),(2122,'润州区',172,0,3,NULL),(2123,'兴化市',173,0,3,NULL),(2124,'姜堰市',173,0,3,NULL),(2125,'泰兴市',173,0,3,NULL),(2126,'海陵区',173,0,3,NULL),(2127,'靖江市',173,0,3,NULL),(2128,'高港区',173,0,3,NULL),(2129,'宿城区',174,0,3,NULL),(2130,'宿豫区',174,0,3,NULL),(2131,'沭阳县',174,0,3,NULL),(2132,'泗洪县',174,0,3,NULL),(2133,'泗阳县',174,0,3,NULL),(2134,'上城区',175,0,3,NULL),(2135,'下城区',175,0,3,NULL),(2136,'临安市',175,0,3,NULL),(2137,'余杭区',175,0,3,NULL),(2138,'富阳市',175,0,3,NULL),(2139,'建德市',175,0,3,NULL),(2140,'拱墅区',175,0,3,NULL),(2141,'桐庐县',175,0,3,NULL),(2142,'江干区',175,0,3,NULL),(2143,'淳安县',175,0,3,NULL),(2144,'滨江区',175,0,3,NULL),(2145,'萧山区',175,0,3,NULL),(2146,'西湖区',175,0,3,NULL),(2147,'余姚市',176,0,3,NULL),(2148,'北仑区',176,0,3,NULL),(2149,'奉化市',176,0,3,NULL),(2150,'宁海县',176,0,3,NULL),(2151,'慈溪市',176,0,3,NULL),(2152,'江东区',176,0,3,NULL),(2153,'江北区',176,0,3,NULL),(2154,'海曙区',176,0,3,NULL),(2155,'象山县',176,0,3,NULL),(2156,'鄞州区',176,0,3,NULL),(2157,'镇海区',176,0,3,NULL),(2158,'乐清市',177,0,3,NULL),(2159,'平阳县',177,0,3,NULL),(2160,'文成县',177,0,3,NULL),(2161,'永嘉县',177,0,3,NULL),(2162,'泰顺县',177,0,3,NULL),(2163,'洞头县',177,0,3,NULL),(2164,'瑞安市',177,0,3,NULL),(2165,'瓯海区',177,0,3,NULL),(2166,'苍南县',177,0,3,NULL),(2167,'鹿城区',177,0,3,NULL),(2168,'龙湾区',177,0,3,NULL),(2169,'南湖区',178,0,3,NULL),(2170,'嘉善县',178,0,3,NULL),(2171,'平湖市',178,0,3,NULL),(2172,'桐乡市',178,0,3,NULL),(2173,'海宁市',178,0,3,NULL),(2174,'海盐县',178,0,3,NULL),(2175,'秀洲区',178,0,3,NULL),(2176,'南浔区',179,0,3,NULL),(2177,'吴兴区',179,0,3,NULL),(2178,'安吉县',179,0,3,NULL),(2179,'德清县',179,0,3,NULL),(2180,'长兴县',179,0,3,NULL),(2181,'上虞市',180,0,3,NULL),(2182,'嵊州市',180,0,3,NULL),(2183,'新昌县',180,0,3,NULL),(2184,'绍兴县',180,0,3,NULL),(2185,'诸暨市',180,0,3,NULL),(2186,'越城区',180,0,3,NULL),(2187,'定海区',181,0,3,NULL),(2188,'岱山县',181,0,3,NULL),(2189,'嵊泗县',181,0,3,NULL),(2190,'普陀区',181,0,3,NULL),(2191,'常山县',182,0,3,NULL),(2192,'开化县',182,0,3,NULL),(2193,'柯城区',182,0,3,NULL),(2194,'江山市',182,0,3,NULL),(2195,'衢江区',182,0,3,NULL),(2196,'龙游县',182,0,3,NULL),(2197,'东阳市',183,0,3,NULL),(2198,'义乌市',183,0,3,NULL),(2199,'兰溪市',183,0,3,NULL),(2200,'婺城区',183,0,3,NULL),(2201,'武义县',183,0,3,NULL),(2202,'永康市',183,0,3,NULL),(2203,'浦江县',183,0,3,NULL),(2204,'磐安县',183,0,3,NULL),(2205,'金东区',183,0,3,NULL),(2206,'三门县',184,0,3,NULL),(2207,'临海市',184,0,3,NULL),(2208,'仙居县',184,0,3,NULL),(2209,'天台县',184,0,3,NULL),(2210,'椒江区',184,0,3,NULL),(2211,'温岭市',184,0,3,NULL),(2212,'玉环县',184,0,3,NULL),(2213,'路桥区',184,0,3,NULL),(2214,'黄岩区',184,0,3,NULL),(2215,'云和县',185,0,3,NULL),(2216,'庆元县',185,0,3,NULL),(2217,'景宁畲族自治县',185,0,3,NULL),(2218,'松阳县',185,0,3,NULL),(2219,'缙云县',185,0,3,NULL),(2220,'莲都区',185,0,3,NULL),(2221,'遂昌县',185,0,3,NULL),(2222,'青田县',185,0,3,NULL),(2223,'龙泉市',185,0,3,NULL),(2224,'包河区',186,0,3,NULL),(2225,'庐阳区',186,0,3,NULL),(2226,'瑶海区',186,0,3,NULL),(2227,'肥东县',186,0,3,NULL),(2228,'肥西县',186,0,3,NULL),(2229,'蜀山区',186,0,3,NULL),(2230,'长丰县',186,0,3,NULL),(2231,'三山区',187,0,3,NULL),(2232,'南陵县',187,0,3,NULL),(2233,'弋江区',187,0,3,NULL),(2234,'繁昌县',187,0,3,NULL),(2235,'芜湖县',187,0,3,NULL),(2236,'镜湖区',187,0,3,NULL),(2237,'鸠江区',187,0,3,NULL),(2238,'五河县',188,0,3,NULL),(2239,'固镇县',188,0,3,NULL),(2240,'怀远县',188,0,3,NULL),(2241,'淮上区',188,0,3,NULL),(2242,'禹会区',188,0,3,NULL),(2243,'蚌山区',188,0,3,NULL),(2244,'龙子湖区',188,0,3,NULL),(2245,'八公山区',189,0,3,NULL),(2246,'凤台县',189,0,3,NULL),(2247,'大通区',189,0,3,NULL),(2248,'潘集区',189,0,3,NULL),(2249,'田家庵区',189,0,3,NULL),(2250,'谢家集区',189,0,3,NULL),(2251,'当涂县',190,0,3,NULL),(2252,'花山区',190,0,3,NULL),(2253,'金家庄区',190,0,3,NULL),(2254,'雨山区',190,0,3,NULL),(2255,'杜集区',191,0,3,NULL),(2256,'濉溪县',191,0,3,NULL),(2257,'烈山区',191,0,3,NULL),(2258,'相山区',191,0,3,NULL),(2259,'狮子山区',192,0,3,NULL),(2260,'郊区',192,0,3,NULL),(2261,'铜官山区',192,0,3,NULL),(2262,'铜陵县',192,0,3,NULL),(2263,'大观区',193,0,3,NULL),(2264,'太湖县',193,0,3,NULL),(2265,'宜秀区',193,0,3,NULL),(2266,'宿松县',193,0,3,NULL),(2267,'岳西县',193,0,3,NULL),(2268,'怀宁县',193,0,3,NULL),(2269,'望江县',193,0,3,NULL),(2270,'枞阳县',193,0,3,NULL),(2271,'桐城市',193,0,3,NULL),(2272,'潜山县',193,0,3,NULL),(2273,'迎江区',193,0,3,NULL),(2274,'休宁县',194,0,3,NULL),(2275,'屯溪区',194,0,3,NULL),(2276,'徽州区',194,0,3,NULL),(2277,'歙县',194,0,3,NULL),(2278,'祁门县',194,0,3,NULL),(2279,'黄山区',194,0,3,NULL),(2280,'黟县',194,0,3,NULL),(2281,'全椒县',195,0,3,NULL),(2282,'凤阳县',195,0,3,NULL),(2283,'南谯区',195,0,3,NULL),(2284,'天长市',195,0,3,NULL),(2285,'定远县',195,0,3,NULL),(2286,'明光市',195,0,3,NULL),(2287,'来安县',195,0,3,NULL),(2288,'琅玡区',195,0,3,NULL),(2289,'临泉县',196,0,3,NULL),(2290,'太和县',196,0,3,NULL),(2291,'界首市',196,0,3,NULL),(2292,'阜南县',196,0,3,NULL),(2293,'颍东区',196,0,3,NULL),(2294,'颍州区',196,0,3,NULL),(2295,'颍泉区',196,0,3,NULL),(2296,'颖上县',196,0,3,NULL),(2297,'埇桥区',197,0,3,NULL),(2298,'泗县辖',197,0,3,NULL),(2299,'灵璧县',197,0,3,NULL),(2300,'砀山县',197,0,3,NULL),(2301,'萧县',197,0,3,NULL),(2302,'含山县',198,0,3,NULL),(2303,'和县',198,0,3,NULL),(2304,'居巢区',198,0,3,NULL),(2305,'庐江县',198,0,3,NULL),(2306,'无为县',198,0,3,NULL),(2307,'寿县',199,0,3,NULL),(2308,'舒城县',199,0,3,NULL),(2309,'裕安区',199,0,3,NULL),(2310,'金安区',199,0,3,NULL),(2311,'金寨县',199,0,3,NULL),(2312,'霍山县',199,0,3,NULL),(2313,'霍邱县',199,0,3,NULL),(2314,'利辛县',200,0,3,NULL),(2315,'涡阳县',200,0,3,NULL),(2316,'蒙城县',200,0,3,NULL),(2317,'谯城区',200,0,3,NULL),(2318,'东至县',201,0,3,NULL),(2319,'石台县',201,0,3,NULL),(2320,'贵池区',201,0,3,NULL),(2321,'青阳县',201,0,3,NULL),(2322,'宁国市',202,0,3,NULL),(2323,'宣州区',202,0,3,NULL),(2324,'广德县',202,0,3,NULL),(2325,'旌德县',202,0,3,NULL),(2326,'泾县',202,0,3,NULL),(2327,'绩溪县',202,0,3,NULL),(2328,'郎溪县',202,0,3,NULL),(2329,'仓山区',203,0,3,NULL),(2330,'台江区',203,0,3,NULL),(2331,'平潭县',203,0,3,NULL),(2332,'晋安区',203,0,3,NULL),(2333,'永泰县',203,0,3,NULL),(2334,'福清市',203,0,3,NULL),(2335,'罗源县',203,0,3,NULL),(2336,'连江县',203,0,3,NULL),(2337,'长乐市',203,0,3,NULL),(2338,'闽侯县',203,0,3,NULL),(2339,'闽清县',203,0,3,NULL),(2340,'马尾区',203,0,3,NULL),(2341,'鼓楼区',203,0,3,NULL),(2342,'同安区',204,0,3,NULL),(2343,'思明区',204,0,3,NULL),(2344,'海沧区',204,0,3,NULL),(2345,'湖里区',204,0,3,NULL),(2346,'翔安区',204,0,3,NULL),(2347,'集美区',204,0,3,NULL),(2348,'仙游县',205,0,3,NULL),(2349,'城厢区',205,0,3,NULL),(2350,'涵江区',205,0,3,NULL),(2351,'秀屿区',205,0,3,NULL),(2352,'荔城区',205,0,3,NULL),(2353,'三元区',206,0,3,NULL),(2354,'大田县',206,0,3,NULL),(2355,'宁化县',206,0,3,NULL),(2356,'将乐县',206,0,3,NULL),(2357,'尤溪县',206,0,3,NULL),(2358,'建宁县',206,0,3,NULL),(2359,'明溪县',206,0,3,NULL),(2360,'梅列区',206,0,3,NULL),(2361,'永安市',206,0,3,NULL),(2362,'沙县',206,0,3,NULL),(2363,'泰宁县',206,0,3,NULL),(2364,'清流县',206,0,3,NULL),(2365,'丰泽区',207,0,3,NULL),(2366,'南安市',207,0,3,NULL),(2367,'安溪县',207,0,3,NULL),(2368,'德化县',207,0,3,NULL),(2369,'惠安县',207,0,3,NULL),(2370,'晋江市',207,0,3,NULL),(2371,'永春县',207,0,3,NULL),(2372,'泉港区',207,0,3,NULL),(2373,'洛江区',207,0,3,NULL),(2374,'石狮市',207,0,3,NULL),(2375,'金门县',207,0,3,NULL),(2376,'鲤城区',207,0,3,NULL),(2377,'东山县',208,0,3,NULL),(2378,'云霄县',208,0,3,NULL),(2379,'华安县',208,0,3,NULL),(2380,'南靖县',208,0,3,NULL),(2381,'平和县',208,0,3,NULL),(2382,'漳浦县',208,0,3,NULL),(2383,'芗城区',208,0,3,NULL),(2384,'诏安县',208,0,3,NULL),(2385,'长泰县',208,0,3,NULL),(2386,'龙文区',208,0,3,NULL),(2387,'龙海市',208,0,3,NULL),(2388,'光泽县',209,0,3,NULL),(2389,'延平区',209,0,3,NULL),(2390,'建瓯市',209,0,3,NULL),(2391,'建阳市',209,0,3,NULL),(2392,'政和县',209,0,3,NULL),(2393,'松溪县',209,0,3,NULL),(2394,'武夷山市',209,0,3,NULL),(2395,'浦城县',209,0,3,NULL),(2396,'邵武市',209,0,3,NULL),(2397,'顺昌县',209,0,3,NULL),(2398,'上杭县',210,0,3,NULL),(2399,'新罗区',210,0,3,NULL),(2400,'武平县',210,0,3,NULL),(2401,'永定县',210,0,3,NULL),(2402,'漳平市',210,0,3,NULL),(2403,'连城县',210,0,3,NULL),(2404,'长汀县',210,0,3,NULL),(2405,'古田县',211,0,3,NULL),(2406,'周宁县',211,0,3,NULL),(2407,'寿宁县',211,0,3,NULL),(2408,'屏南县',211,0,3,NULL),(2409,'柘荣县',211,0,3,NULL),(2410,'福安市',211,0,3,NULL),(2411,'福鼎市',211,0,3,NULL),(2412,'蕉城区',211,0,3,NULL),(2413,'霞浦县',211,0,3,NULL),(2414,'东湖区',212,0,3,NULL),(2415,'南昌县',212,0,3,NULL),(2416,'安义县',212,0,3,NULL),(2417,'新建县',212,0,3,NULL),(2418,'湾里区',212,0,3,NULL),(2419,'西湖区',212,0,3,NULL),(2420,'进贤县',212,0,3,NULL),(2421,'青云谱区',212,0,3,NULL),(2422,'青山湖区',212,0,3,NULL),(2423,'乐平市',213,0,3,NULL),(2424,'昌江区',213,0,3,NULL),(2425,'浮梁县',213,0,3,NULL),(2426,'珠山区',213,0,3,NULL),(2427,'上栗县',214,0,3,NULL),(2428,'安源区',214,0,3,NULL),(2429,'湘东区',214,0,3,NULL),(2430,'芦溪县',214,0,3,NULL),(2431,'莲花县',214,0,3,NULL),(2432,'九江县',215,0,3,NULL),(2433,'修水县',215,0,3,NULL),(2434,'庐山区',215,0,3,NULL),(2435,'彭泽县',215,0,3,NULL),(2436,'德安县',215,0,3,NULL),(2437,'星子县',215,0,3,NULL),(2438,'武宁县',215,0,3,NULL),(2439,'永修县',215,0,3,NULL),(2440,'浔阳区',215,0,3,NULL),(2441,'湖口县',215,0,3,NULL),(2442,'瑞昌市',215,0,3,NULL),(2443,'都昌县',215,0,3,NULL),(2444,'分宜县',216,0,3,NULL),(2445,'渝水区',216,0,3,NULL),(2446,'余江县',217,0,3,NULL),(2447,'月湖区',217,0,3,NULL),(2448,'贵溪市',217,0,3,NULL),(2449,'上犹县',218,0,3,NULL),(2450,'于都县',218,0,3,NULL),(2451,'会昌县',218,0,3,NULL),(2452,'信丰县',218,0,3,NULL),(2453,'全南县',218,0,3,NULL),(2454,'兴国县',218,0,3,NULL),(2455,'南康市',218,0,3,NULL),(2456,'大余县',218,0,3,NULL),(2457,'宁都县',218,0,3,NULL),(2458,'安远县',218,0,3,NULL),(2459,'定南县',218,0,3,NULL),(2460,'寻乌县',218,0,3,NULL),(2461,'崇义县',218,0,3,NULL),(2462,'瑞金市',218,0,3,NULL),(2463,'石城县',218,0,3,NULL),(2464,'章贡区',218,0,3,NULL),(2465,'赣县',218,0,3,NULL),(2466,'龙南县',218,0,3,NULL),(2467,'万安县',219,0,3,NULL),(2468,'井冈山市',219,0,3,NULL),(2469,'吉安县',219,0,3,NULL),(2470,'吉州区',219,0,3,NULL),(2471,'吉水县',219,0,3,NULL),(2472,'安福县',219,0,3,NULL),(2473,'峡江县',219,0,3,NULL),(2474,'新干县',219,0,3,NULL),(2475,'永丰县',219,0,3,NULL),(2476,'永新县',219,0,3,NULL),(2477,'泰和县',219,0,3,NULL),(2478,'遂川县',219,0,3,NULL),(2479,'青原区',219,0,3,NULL),(2480,'万载县',220,0,3,NULL),(2481,'上高县',220,0,3,NULL),(2482,'丰城市',220,0,3,NULL),(2483,'奉新县',220,0,3,NULL),(2484,'宜丰县',220,0,3,NULL),(2485,'樟树市',220,0,3,NULL),(2486,'袁州区',220,0,3,NULL),(2487,'铜鼓县',220,0,3,NULL),(2488,'靖安县',220,0,3,NULL),(2489,'高安市',220,0,3,NULL),(2490,'东乡县',221,0,3,NULL),(2491,'临川区',221,0,3,NULL),(2492,'乐安县',221,0,3,NULL),(2493,'南丰县',221,0,3,NULL),(2494,'南城县',221,0,3,NULL),(2495,'宜黄县',221,0,3,NULL),(2496,'崇仁县',221,0,3,NULL),(2497,'广昌县',221,0,3,NULL),(2498,'资溪县',221,0,3,NULL),(2499,'金溪县',221,0,3,NULL),(2500,'黎川县',221,0,3,NULL),(2501,'万年县',222,0,3,NULL),(2502,'上饶县',222,0,3,NULL),(2503,'余干县',222,0,3,NULL),(2504,'信州区',222,0,3,NULL),(2505,'婺源县',222,0,3,NULL),(2506,'广丰县',222,0,3,NULL),(2507,'弋阳县',222,0,3,NULL),(2508,'德兴市',222,0,3,NULL),(2509,'横峰县',222,0,3,NULL),(2510,'玉山县',222,0,3,NULL),(2511,'鄱阳县',222,0,3,NULL),(2512,'铅山县',222,0,3,NULL),(2513,'历下区',223,0,3,NULL),(2514,'历城区',223,0,3,NULL),(2515,'商河县',223,0,3,NULL),(2516,'天桥区',223,0,3,NULL),(2517,'市中区',223,0,3,NULL),(2518,'平阴县',223,0,3,NULL),(2519,'槐荫区',223,0,3,NULL),(2520,'济阳县',223,0,3,NULL),(2521,'章丘市',223,0,3,NULL),(2522,'长清区',223,0,3,NULL),(2523,'即墨市',224,0,3,NULL),(2524,'四方区',224,0,3,NULL),(2525,'城阳区',224,0,3,NULL),(2526,'崂山区',224,0,3,NULL),(2527,'市北区',224,0,3,NULL),(2528,'市南区',224,0,3,NULL),(2529,'平度市',224,0,3,NULL),(2530,'李沧区',224,0,3,NULL),(2531,'胶南市',224,0,3,NULL),(2532,'胶州市',224,0,3,NULL),(2533,'莱西市',224,0,3,NULL),(2534,'黄岛区',224,0,3,NULL),(2535,'临淄区',225,0,3,NULL),(2536,'博山区',225,0,3,NULL),(2537,'周村区',225,0,3,NULL),(2538,'张店区',225,0,3,NULL),(2539,'桓台县',225,0,3,NULL),(2540,'沂源县',225,0,3,NULL),(2541,'淄川区',225,0,3,NULL),(2542,'高青县',225,0,3,NULL),(2543,'台儿庄区',226,0,3,NULL),(2544,'山亭区',226,0,3,NULL),(2545,'峄城区',226,0,3,NULL),(2546,'市中区',226,0,3,NULL),(2547,'滕州市',226,0,3,NULL),(2548,'薛城区',226,0,3,NULL),(2549,'东营区',227,0,3,NULL),(2550,'利津县',227,0,3,NULL),(2551,'垦利县',227,0,3,NULL),(2552,'广饶县',227,0,3,NULL),(2553,'河口区',227,0,3,NULL),(2554,'招远市',228,0,3,NULL),(2555,'栖霞市',228,0,3,NULL),(2556,'海阳市',228,0,3,NULL),(2557,'牟平区',228,0,3,NULL),(2558,'福山区',228,0,3,NULL),(2559,'芝罘区',228,0,3,NULL),(2560,'莱山区',228,0,3,NULL),(2561,'莱州市',228,0,3,NULL),(2562,'莱阳市',228,0,3,NULL),(2563,'蓬莱市',228,0,3,NULL),(2564,'长岛县',228,0,3,NULL),(2565,'龙口市',228,0,3,NULL),(2566,'临朐县',229,0,3,NULL),(2567,'坊子区',229,0,3,NULL),(2568,'奎文区',229,0,3,NULL),(2569,'安丘市',229,0,3,NULL),(2570,'寒亭区',229,0,3,NULL),(2571,'寿光市',229,0,3,NULL),(2572,'昌乐县',229,0,3,NULL),(2573,'昌邑市',229,0,3,NULL),(2574,'潍城区',229,0,3,NULL),(2575,'诸城市',229,0,3,NULL),(2576,'青州市',229,0,3,NULL),(2577,'高密市',229,0,3,NULL),(2578,'任城区',230,0,3,NULL),(2579,'兖州市',230,0,3,NULL),(2580,'嘉祥县',230,0,3,NULL),(2581,'市中区',230,0,3,NULL),(2582,'微山县',230,0,3,NULL),(2583,'曲阜市',230,0,3,NULL),(2584,'梁山县',230,0,3,NULL),(2585,'汶上县',230,0,3,NULL),(2586,'泗水县',230,0,3,NULL),(2587,'邹城市',230,0,3,NULL),(2588,'金乡县',230,0,3,NULL),(2589,'鱼台县',230,0,3,NULL),(2590,'东平县',231,0,3,NULL),(2591,'宁阳县',231,0,3,NULL),(2592,'岱岳区',231,0,3,NULL),(2593,'新泰市',231,0,3,NULL),(2594,'泰山区',231,0,3,NULL),(2595,'肥城市',231,0,3,NULL),(2596,'乳山市',232,0,3,NULL),(2597,'文登市',232,0,3,NULL),(2598,'环翠区',232,0,3,NULL),(2599,'荣成市',232,0,3,NULL),(2600,'东港区',233,0,3,NULL),(2601,'五莲县',233,0,3,NULL),(2602,'岚山区',233,0,3,NULL),(2603,'莒县',233,0,3,NULL),(2604,'莱城区',234,0,3,NULL),(2605,'钢城区',234,0,3,NULL),(2606,'临沭县',235,0,3,NULL),(2607,'兰山区',235,0,3,NULL),(2608,'平邑县',235,0,3,NULL),(2609,'沂南县',235,0,3,NULL),(2610,'沂水县',235,0,3,NULL),(2611,'河东区',235,0,3,NULL),(2612,'罗庄区',235,0,3,NULL),(2613,'苍山县',235,0,3,NULL),(2614,'莒南县',235,0,3,NULL),(2615,'蒙阴县',235,0,3,NULL),(2616,'费县',235,0,3,NULL),(2617,'郯城县',235,0,3,NULL),(2618,'临邑县',236,0,3,NULL),(2619,'乐陵市',236,0,3,NULL),(2620,'夏津县',236,0,3,NULL),(2621,'宁津县',236,0,3,NULL),(2622,'平原县',236,0,3,NULL),(2623,'庆云县',236,0,3,NULL),(2624,'德城区',236,0,3,NULL),(2625,'武城县',236,0,3,NULL),(2626,'禹城市',236,0,3,NULL),(2627,'陵县',236,0,3,NULL),(2628,'齐河县',236,0,3,NULL),(2629,'东昌府区',237,0,3,NULL),(2630,'东阿县',237,0,3,NULL),(2631,'临清市',237,0,3,NULL),(2632,'冠县',237,0,3,NULL),(2633,'茌平县',237,0,3,NULL),(2634,'莘县',237,0,3,NULL),(2635,'阳谷县',237,0,3,NULL),(2636,'高唐县',237,0,3,NULL),(2637,'博兴县',238,0,3,NULL),(2638,'惠民县',238,0,3,NULL),(2639,'无棣县',238,0,3,NULL),(2640,'沾化县',238,0,3,NULL),(2641,'滨城区',238,0,3,NULL),(2642,'邹平县',238,0,3,NULL),(2643,'阳信县',238,0,3,NULL),(2644,'东明县',239,0,3,NULL),(2645,'单县',239,0,3,NULL),(2646,'定陶县',239,0,3,NULL),(2647,'巨野县',239,0,3,NULL),(2648,'成武县',239,0,3,NULL),(2649,'曹县',239,0,3,NULL),(2650,'牡丹区',239,0,3,NULL),(2651,'郓城县',239,0,3,NULL),(2652,'鄄城县',239,0,3,NULL),(2653,'上街区',240,0,3,NULL),(2654,'中原区',240,0,3,NULL),(2655,'中牟县',240,0,3,NULL),(2656,'二七区',240,0,3,NULL),(2657,'巩义市',240,0,3,NULL),(2658,'惠济区',240,0,3,NULL),(2659,'新密市',240,0,3,NULL),(2660,'新郑市',240,0,3,NULL),(2661,'登封市',240,0,3,NULL),(2662,'管城回族区',240,0,3,NULL),(2663,'荥阳市',240,0,3,NULL),(2664,'金水区',240,0,3,NULL),(2665,'兰考县',241,0,3,NULL),(2666,'尉氏县',241,0,3,NULL),(2667,'开封县',241,0,3,NULL),(2668,'杞县',241,0,3,NULL),(2669,'禹王台区',241,0,3,NULL),(2670,'通许县',241,0,3,NULL),(2671,'金明区',241,0,3,NULL),(2672,'顺河回族区',241,0,3,NULL),(2673,'鼓楼区',241,0,3,NULL),(2674,'龙亭区',241,0,3,NULL),(2675,'伊川县',242,0,3,NULL),(2676,'偃师市',242,0,3,NULL),(2677,'吉利区',242,0,3,NULL),(2678,'孟津县',242,0,3,NULL),(2679,'宜阳县',242,0,3,NULL),(2680,'嵩县',242,0,3,NULL),(2681,'新安县',242,0,3,NULL),(2682,'栾川县',242,0,3,NULL),(2683,'汝阳县',242,0,3,NULL),(2684,'洛宁县',242,0,3,NULL),(2685,'洛龙区',242,0,3,NULL),(2686,'涧西区',242,0,3,NULL),(2687,'瀍河回族区',242,0,3,NULL),(2688,'老城区',242,0,3,NULL),(2689,'西工区',242,0,3,NULL),(2690,'卫东区',243,0,3,NULL),(2691,'叶县',243,0,3,NULL),(2692,'宝丰县',243,0,3,NULL),(2693,'新华区',243,0,3,NULL),(2694,'汝州市',243,0,3,NULL),(2695,'湛河区',243,0,3,NULL),(2696,'石龙区',243,0,3,NULL),(2697,'舞钢市',243,0,3,NULL),(2698,'郏县',243,0,3,NULL),(2699,'鲁山县',243,0,3,NULL),(2700,'内黄县',244,0,3,NULL),(2701,'北关区',244,0,3,NULL),(2702,'安阳县',244,0,3,NULL),(2703,'文峰区',244,0,3,NULL),(2704,'林州市',244,0,3,NULL),(2705,'殷都区',244,0,3,NULL),(2706,'汤阴县',244,0,3,NULL),(2707,'滑县',244,0,3,NULL),(2708,'龙安区',244,0,3,NULL),(2709,'山城区',245,0,3,NULL),(2710,'浚县',245,0,3,NULL),(2711,'淇县',245,0,3,NULL),(2712,'淇滨区',245,0,3,NULL),(2713,'鹤山区',245,0,3,NULL),(2714,'凤泉区',246,0,3,NULL),(2715,'卫滨区',246,0,3,NULL),(2716,'卫辉市',246,0,3,NULL),(2717,'原阳县',246,0,3,NULL),(2718,'封丘县',246,0,3,NULL),(2719,'延津县',246,0,3,NULL),(2720,'新乡县',246,0,3,NULL),(2721,'牧野区',246,0,3,NULL),(2722,'红旗区',246,0,3,NULL),(2723,'获嘉县',246,0,3,NULL),(2724,'辉县市',246,0,3,NULL),(2725,'长垣县',246,0,3,NULL),(2726,'中站区',247,0,3,NULL),(2727,'修武县',247,0,3,NULL),(2728,'博爱县',247,0,3,NULL),(2729,'孟州市',247,0,3,NULL),(2730,'山阳区',247,0,3,NULL),(2731,'武陟县',247,0,3,NULL),(2732,'沁阳市',247,0,3,NULL),(2733,'温县',247,0,3,NULL),(2734,'解放区',247,0,3,NULL),(2735,'马村区',247,0,3,NULL),(2736,'华龙区',248,0,3,NULL),(2737,'南乐县',248,0,3,NULL),(2738,'台前县',248,0,3,NULL),(2739,'清丰县',248,0,3,NULL),(2740,'濮阳县',248,0,3,NULL),(2741,'范县',248,0,3,NULL),(2742,'禹州市',249,0,3,NULL),(2743,'襄城县',249,0,3,NULL),(2744,'许昌县',249,0,3,NULL),(2745,'鄢陵县',249,0,3,NULL),(2746,'长葛市',249,0,3,NULL),(2747,'魏都区',249,0,3,NULL),(2748,'临颍县',250,0,3,NULL),(2749,'召陵区',250,0,3,NULL),(2750,'源汇区',250,0,3,NULL),(2751,'舞阳县',250,0,3,NULL),(2752,'郾城区',250,0,3,NULL),(2753,'义马市',251,0,3,NULL),(2754,'卢氏县',251,0,3,NULL),(2755,'渑池县',251,0,3,NULL),(2756,'湖滨区',251,0,3,NULL),(2757,'灵宝市',251,0,3,NULL),(2758,'陕县',251,0,3,NULL),(2759,'内乡县',252,0,3,NULL),(2760,'南召县',252,0,3,NULL),(2761,'卧龙区',252,0,3,NULL),(2762,'唐河县',252,0,3,NULL),(2763,'宛城区',252,0,3,NULL),(2764,'新野县',252,0,3,NULL),(2765,'方城县',252,0,3,NULL),(2766,'桐柏县',252,0,3,NULL),(2767,'淅川县',252,0,3,NULL),(2768,'社旗县',252,0,3,NULL),(2769,'西峡县',252,0,3,NULL),(2770,'邓州市',252,0,3,NULL),(2771,'镇平县',252,0,3,NULL),(2772,'夏邑县',253,0,3,NULL),(2773,'宁陵县',253,0,3,NULL),(2774,'柘城县',253,0,3,NULL),(2775,'民权县',253,0,3,NULL),(2776,'永城市',253,0,3,NULL),(2777,'睢县',253,0,3,NULL),(2778,'睢阳区',253,0,3,NULL),(2779,'粱园区',253,0,3,NULL),(2780,'虞城县',253,0,3,NULL),(2781,'光山县',254,0,3,NULL),(2782,'商城县',254,0,3,NULL),(2783,'固始县',254,0,3,NULL),(2784,'平桥区',254,0,3,NULL),(2785,'息县',254,0,3,NULL),(2786,'新县',254,0,3,NULL),(2787,'浉河区',254,0,3,NULL),(2788,'淮滨县',254,0,3,NULL),(2789,'潢川县',254,0,3,NULL),(2790,'罗山县',254,0,3,NULL),(2791,'商水县',255,0,3,NULL),(2792,'太康县',255,0,3,NULL),(2793,'川汇区',255,0,3,NULL),(2794,'扶沟县',255,0,3,NULL),(2795,'沈丘县',255,0,3,NULL),(2796,'淮阳县',255,0,3,NULL),(2797,'西华县',255,0,3,NULL),(2798,'郸城县',255,0,3,NULL),(2799,'项城市',255,0,3,NULL),(2800,'鹿邑县',255,0,3,NULL),(2801,'上蔡县',256,0,3,NULL),(2802,'平舆县',256,0,3,NULL),(2803,'新蔡县',256,0,3,NULL),(2804,'正阳县',256,0,3,NULL),(2805,'汝南县',256,0,3,NULL),(2806,'泌阳县',256,0,3,NULL),(2807,'确山县',256,0,3,NULL),(2808,'西平县',256,0,3,NULL),(2809,'遂平县',256,0,3,NULL),(2810,'驿城区',256,0,3,NULL),(2811,'济源市',257,0,3,NULL),(2812,'东西湖区',258,0,3,NULL),(2813,'新洲区',258,0,3,NULL),(2814,'武昌区',258,0,3,NULL),(2815,'汉南区',258,0,3,NULL),(2816,'汉阳区',258,0,3,NULL),(2817,'江夏区',258,0,3,NULL),(2818,'江岸区',258,0,3,NULL),(2819,'江汉区',258,0,3,NULL),(2820,'洪山区',258,0,3,NULL),(2821,'硚口区',258,0,3,NULL),(2822,'蔡甸区',258,0,3,NULL),(2823,'青山区',258,0,3,NULL),(2824,'黄陂区',258,0,3,NULL),(2825,'下陆区',259,0,3,NULL),(2826,'大冶市',259,0,3,NULL),(2827,'西塞山区',259,0,3,NULL),(2828,'铁山区',259,0,3,NULL),(2829,'阳新县',259,0,3,NULL),(2830,'黄石港区',259,0,3,NULL),(2831,'丹江口市',260,0,3,NULL),(2832,'张湾区',260,0,3,NULL),(2833,'房县',260,0,3,NULL),(2834,'竹山县',260,0,3,NULL),(2835,'竹溪县',260,0,3,NULL),(2836,'茅箭区',260,0,3,NULL),(2837,'郧县',260,0,3,NULL),(2838,'郧西县',260,0,3,NULL),(2839,'五峰土家族自治县',261,0,3,NULL),(2840,'伍家岗区',261,0,3,NULL),(2841,'兴山县',261,0,3,NULL),(2842,'夷陵区',261,0,3,NULL),(2843,'宜都市',261,0,3,NULL),(2844,'当阳市',261,0,3,NULL),(2845,'枝江市',261,0,3,NULL),(2846,'点军区',261,0,3,NULL),(2847,'秭归县',261,0,3,NULL),(2848,'虢亭区',261,0,3,NULL),(2849,'西陵区',261,0,3,NULL),(2850,'远安县',261,0,3,NULL),(2851,'长阳土家族自治县',261,0,3,NULL),(2852,'保康县',262,0,3,NULL),(2853,'南漳县',262,0,3,NULL),(2854,'宜城市',262,0,3,NULL),(2855,'枣阳市',262,0,3,NULL),(2856,'樊城区',262,0,3,NULL),(2857,'老河口市',262,0,3,NULL),(2858,'襄城区',262,0,3,NULL),(2859,'襄阳区',262,0,3,NULL),(2860,'谷城县',262,0,3,NULL),(2861,'华容区',263,0,3,NULL),(2862,'粱子湖',263,0,3,NULL),(2863,'鄂城区',263,0,3,NULL),(2864,'东宝区',264,0,3,NULL),(2865,'京山县',264,0,3,NULL),(2866,'掇刀区',264,0,3,NULL),(2867,'沙洋县',264,0,3,NULL),(2868,'钟祥市',264,0,3,NULL),(2869,'云梦县',265,0,3,NULL),(2870,'大悟县',265,0,3,NULL),(2871,'孝南区',265,0,3,NULL),(2872,'孝昌县',265,0,3,NULL),(2873,'安陆市',265,0,3,NULL),(2874,'应城市',265,0,3,NULL),(2875,'汉川市',265,0,3,NULL),(2876,'公安县',266,0,3,NULL),(2877,'松滋市',266,0,3,NULL),(2878,'江陵县',266,0,3,NULL),(2879,'沙市区',266,0,3,NULL),(2880,'洪湖市',266,0,3,NULL),(2881,'监利县',266,0,3,NULL),(2882,'石首市',266,0,3,NULL),(2883,'荆州区',266,0,3,NULL),(2884,'团风县',267,0,3,NULL),(2885,'武穴市',267,0,3,NULL),(2886,'浠水县',267,0,3,NULL),(2887,'红安县',267,0,3,NULL),(2888,'罗田县',267,0,3,NULL),(2889,'英山县',267,0,3,NULL),(2890,'蕲春县',267,0,3,NULL),(2891,'麻城市',267,0,3,NULL),(2892,'黄州区',267,0,3,NULL),(2893,'黄梅县',267,0,3,NULL),(2894,'咸安区',268,0,3,NULL),(2895,'嘉鱼县',268,0,3,NULL),(2896,'崇阳县',268,0,3,NULL),(2897,'赤壁市',268,0,3,NULL),(2898,'通城县',268,0,3,NULL),(2899,'通山县',268,0,3,NULL),(2900,'广水市',269,0,3,NULL),(2901,'曾都区',269,0,3,NULL),(2902,'利川市',270,0,3,NULL),(2903,'咸丰县',270,0,3,NULL),(2904,'宣恩县',270,0,3,NULL),(2905,'巴东县',270,0,3,NULL),(2906,'建始县',270,0,3,NULL),(2907,'恩施市',270,0,3,NULL),(2908,'来凤县',270,0,3,NULL),(2909,'鹤峰县',270,0,3,NULL),(2910,'仙桃市',271,0,3,NULL),(2911,'潜江市',272,0,3,NULL),(2912,'天门市',273,0,3,NULL),(2913,'神农架林区',274,0,3,NULL),(2914,'天心区',275,0,3,NULL),(2915,'宁乡县',275,0,3,NULL),(2916,'岳麓区',275,0,3,NULL),(2917,'开福区',275,0,3,NULL),(2918,'望城县',275,0,3,NULL),(2919,'浏阳市',275,0,3,NULL),(2920,'芙蓉区',275,0,3,NULL),(2921,'长沙县',275,0,3,NULL),(2922,'雨花区',275,0,3,NULL),(2923,'天元区',276,0,3,NULL),(2924,'攸县',276,0,3,NULL),(2925,'株洲县',276,0,3,NULL),(2926,'炎陵县',276,0,3,NULL),(2927,'石峰区',276,0,3,NULL),(2928,'芦淞区',276,0,3,NULL),(2929,'茶陵县',276,0,3,NULL),(2930,'荷塘区',276,0,3,NULL),(2931,'醴陵市',276,0,3,NULL),(2932,'岳塘区',277,0,3,NULL),(2933,'湘乡市',277,0,3,NULL),(2934,'湘潭县',277,0,3,NULL),(2935,'雨湖区',277,0,3,NULL),(2936,'韶山市',277,0,3,NULL),(2937,'南岳区',278,0,3,NULL),(2938,'常宁市',278,0,3,NULL),(2939,'珠晖区',278,0,3,NULL),(2940,'石鼓区',278,0,3,NULL),(2941,'祁东县',278,0,3,NULL),(2942,'耒阳市',278,0,3,NULL),(2943,'蒸湘区',278,0,3,NULL),(2944,'衡东县',278,0,3,NULL),(2945,'衡南县',278,0,3,NULL),(2946,'衡山县',278,0,3,NULL),(2947,'衡阳县',278,0,3,NULL),(2948,'雁峰区',278,0,3,NULL),(2949,'北塔区',279,0,3,NULL),(2950,'双清区',279,0,3,NULL),(2951,'城步苗族自治县',279,0,3,NULL),(2952,'大祥区',279,0,3,NULL),(2953,'新宁县',279,0,3,NULL),(2954,'新邵县',279,0,3,NULL),(2955,'武冈市',279,0,3,NULL),(2956,'洞口县',279,0,3,NULL),(2957,'绥宁县',279,0,3,NULL),(2958,'邵东县',279,0,3,NULL),(2959,'邵阳县',279,0,3,NULL),(2960,'隆回县',279,0,3,NULL),(2961,'临湘市',280,0,3,NULL),(2962,'云溪区',280,0,3,NULL),(2963,'华容县',280,0,3,NULL),(2964,'君山区',280,0,3,NULL),(2965,'岳阳县',280,0,3,NULL),(2966,'岳阳楼区',280,0,3,NULL),(2967,'平江县',280,0,3,NULL),(2968,'汨罗市',280,0,3,NULL),(2969,'湘阴县',280,0,3,NULL),(2970,'临澧县',281,0,3,NULL),(2971,'安乡县',281,0,3,NULL),(2972,'桃源县',281,0,3,NULL),(2973,'武陵区',281,0,3,NULL),(2974,'汉寿县',281,0,3,NULL),(2975,'津市市',281,0,3,NULL),(2976,'澧县',281,0,3,NULL),(2977,'石门县',281,0,3,NULL),(2978,'鼎城区',281,0,3,NULL),(2979,'慈利县',282,0,3,NULL),(2980,'桑植县',282,0,3,NULL),(2981,'武陵源区',282,0,3,NULL),(2982,'永定区',282,0,3,NULL),(2983,'南县',283,0,3,NULL),(2984,'安化县',283,0,3,NULL),(2985,'桃江县',283,0,3,NULL),(2986,'沅江市',283,0,3,NULL),(2987,'资阳区',283,0,3,NULL),(2988,'赫山区',283,0,3,NULL),(2989,'临武县',284,0,3,NULL),(2990,'北湖区',284,0,3,NULL),(2991,'嘉禾县',284,0,3,NULL),(2992,'安仁县',284,0,3,NULL),(2993,'宜章县',284,0,3,NULL),(2994,'桂东县',284,0,3,NULL),(2995,'桂阳县',284,0,3,NULL),(2996,'永兴县',284,0,3,NULL),(2997,'汝城县',284,0,3,NULL),(2998,'苏仙区',284,0,3,NULL),(2999,'资兴市',284,0,3,NULL),(3000,'东安县',285,0,3,NULL),(3001,'冷水滩区',285,0,3,NULL),(3002,'双牌县',285,0,3,NULL),(3003,'宁远县',285,0,3,NULL),(3004,'新田县',285,0,3,NULL),(3005,'江华瑶族自治县',285,0,3,NULL),(3006,'江永县',285,0,3,NULL),(3007,'祁阳县',285,0,3,NULL),(3008,'蓝山县',285,0,3,NULL),(3009,'道县',285,0,3,NULL),(3010,'零陵区',285,0,3,NULL),(3011,'中方县',286,0,3,NULL),(3012,'会同县',286,0,3,NULL),(3013,'新晃侗族自治县',286,0,3,NULL),(3014,'沅陵县',286,0,3,NULL),(3015,'洪江市/洪江区',286,0,3,NULL),(3016,'溆浦县',286,0,3,NULL),(3017,'芷江侗族自治县',286,0,3,NULL),(3018,'辰溪县',286,0,3,NULL),(3019,'通道侗族自治县',286,0,3,NULL),(3020,'靖州苗族侗族自治县',286,0,3,NULL),(3021,'鹤城区',286,0,3,NULL),(3022,'麻阳苗族自治县',286,0,3,NULL),(3023,'冷水江市',287,0,3,NULL),(3024,'双峰县',287,0,3,NULL),(3025,'娄星区',287,0,3,NULL),(3026,'新化县',287,0,3,NULL),(3027,'涟源市',287,0,3,NULL),(3028,'保靖县',288,0,3,NULL),(3029,'凤凰县',288,0,3,NULL),(3030,'古丈县',288,0,3,NULL),(3031,'吉首市',288,0,3,NULL),(3032,'永顺县',288,0,3,NULL),(3033,'泸溪县',288,0,3,NULL),(3034,'花垣县',288,0,3,NULL),(3035,'龙山县',288,0,3,NULL),(3036,'萝岗区',289,0,3,NULL),(3037,'南沙区',289,0,3,NULL),(3038,'从化市',289,0,3,NULL),(3039,'增城市',289,0,3,NULL),(3040,'天河区',289,0,3,NULL),(3041,'海珠区',289,0,3,NULL),(3042,'番禺区',289,0,3,NULL),(3043,'白云区',289,0,3,NULL),(3044,'花都区',289,0,3,NULL),(3045,'荔湾区',289,0,3,NULL),(3046,'越秀区',289,0,3,NULL),(3047,'黄埔区',289,0,3,NULL),(3048,'乐昌市',290,0,3,NULL),(3049,'乳源瑶族自治县',290,0,3,NULL),(3050,'仁化县',290,0,3,NULL),(3051,'南雄市',290,0,3,NULL),(3052,'始兴县',290,0,3,NULL),(3053,'新丰县',290,0,3,NULL),(3054,'曲江区',290,0,3,NULL),(3055,'武江区',290,0,3,NULL),(3056,'浈江区',290,0,3,NULL),(3057,'翁源县',290,0,3,NULL),(3058,'南山区',291,0,3,NULL),(3059,'宝安区',291,0,3,NULL),(3060,'盐田区',291,0,3,NULL),(3061,'福田区',291,0,3,NULL),(3062,'罗湖区',291,0,3,NULL),(3063,'龙岗区',291,0,3,NULL),(3064,'斗门区',292,0,3,NULL),(3065,'金湾区',292,0,3,NULL),(3066,'香洲区',292,0,3,NULL),(3067,'南澳县',293,0,3,NULL),(3068,'潮南区',293,0,3,NULL),(3069,'潮阳区',293,0,3,NULL),(3070,'澄海区',293,0,3,NULL),(3071,'濠江区',293,0,3,NULL),(3072,'金平区',293,0,3,NULL),(3073,'龙湖区',293,0,3,NULL),(3074,'三水区',294,0,3,NULL),(3075,'南海区',294,0,3,NULL),(3076,'禅城区',294,0,3,NULL),(3077,'顺德区',294,0,3,NULL),(3078,'高明区',294,0,3,NULL),(3079,'台山市',295,0,3,NULL),(3080,'开平市',295,0,3,NULL),(3081,'恩平市',295,0,3,NULL),(3082,'新会区',295,0,3,NULL),(3083,'江海区',295,0,3,NULL),(3084,'蓬江区',295,0,3,NULL),(3085,'鹤山市',295,0,3,NULL),(3086,'吴川市',296,0,3,NULL),(3087,'坡头区',296,0,3,NULL),(3088,'廉江市',296,0,3,NULL),(3089,'徐闻县',296,0,3,NULL),(3090,'赤坎区',296,0,3,NULL),(3091,'遂溪县',296,0,3,NULL),(3092,'雷州市',296,0,3,NULL),(3093,'霞山区',296,0,3,NULL),(3094,'麻章区',296,0,3,NULL),(3095,'信宜市',297,0,3,NULL),(3096,'化州市',297,0,3,NULL),(3097,'电白县',297,0,3,NULL),(3098,'茂南区',297,0,3,NULL),(3099,'茂港区',297,0,3,NULL),(3100,'高州市',297,0,3,NULL),(3101,'四会市',298,0,3,NULL),(3102,'封开县',298,0,3,NULL),(3103,'广宁县',298,0,3,NULL),(3104,'德庆县',298,0,3,NULL),(3105,'怀集县',298,0,3,NULL),(3106,'端州区',298,0,3,NULL),(3107,'高要市',298,0,3,NULL),(3108,'鼎湖区',298,0,3,NULL),(3109,'博罗县',299,0,3,NULL),(3110,'惠东县',299,0,3,NULL),(3111,'惠城区',299,0,3,NULL),(3112,'惠阳区',299,0,3,NULL),(3113,'龙门县',299,0,3,NULL),(3114,'丰顺县',300,0,3,NULL),(3115,'五华县',300,0,3,NULL),(3116,'兴宁市',300,0,3,NULL),(3117,'大埔县',300,0,3,NULL),(3118,'平远县',300,0,3,NULL),(3119,'梅县',300,0,3,NULL),(3120,'梅江区',300,0,3,NULL),(3121,'蕉岭县',300,0,3,NULL),(3122,'城区',301,0,3,NULL),(3123,'海丰县',301,0,3,NULL),(3124,'陆丰市',301,0,3,NULL),(3125,'陆河县',301,0,3,NULL),(3126,'东源县',302,0,3,NULL),(3127,'和平县',302,0,3,NULL),(3128,'源城区',302,0,3,NULL),(3129,'紫金县',302,0,3,NULL),(3130,'连平县',302,0,3,NULL),(3131,'龙川县',302,0,3,NULL),(3132,'江城区',303,0,3,NULL),(3133,'阳东县',303,0,3,NULL),(3134,'阳春市',303,0,3,NULL),(3135,'阳西县',303,0,3,NULL),(3136,'佛冈县',304,0,3,NULL),(3137,'清城区',304,0,3,NULL),(3138,'清新县',304,0,3,NULL),(3139,'英德市',304,0,3,NULL),(3140,'连南瑶族自治县',304,0,3,NULL),(3141,'连山壮族瑶族自治县',304,0,3,NULL),(3142,'连州市',304,0,3,NULL),(3143,'阳山县',304,0,3,NULL),(3144,'东莞市',305,0,3,NULL),(3145,'中山市',306,0,3,NULL),(3146,'湘桥区',307,0,3,NULL),(3147,'潮安县',307,0,3,NULL),(3148,'饶平县',307,0,3,NULL),(3149,'惠来县',308,0,3,NULL),(3150,'揭东县',308,0,3,NULL),(3151,'揭西县',308,0,3,NULL),(3152,'普宁市',308,0,3,NULL),(3153,'榕城区',308,0,3,NULL),(3154,'云城区',309,0,3,NULL),(3155,'云安县',309,0,3,NULL),(3156,'新兴县',309,0,3,NULL),(3157,'罗定市',309,0,3,NULL),(3158,'郁南县',309,0,3,NULL),(3159,'上林县',310,0,3,NULL),(3160,'兴宁区',310,0,3,NULL),(3161,'宾阳县',310,0,3,NULL),(3162,'横县',310,0,3,NULL),(3163,'武鸣县',310,0,3,NULL),(3164,'江南区',310,0,3,NULL),(3165,'良庆区',310,0,3,NULL),(3166,'西乡塘区',310,0,3,NULL),(3167,'邕宁区',310,0,3,NULL),(3168,'隆安县',310,0,3,NULL),(3169,'青秀区',310,0,3,NULL),(3170,'马山县',310,0,3,NULL),(3171,'三江侗族自治县',311,0,3,NULL),(3172,'城中区',311,0,3,NULL),(3173,'柳北区',311,0,3,NULL),(3174,'柳南区',311,0,3,NULL),(3175,'柳城县',311,0,3,NULL),(3176,'柳江县',311,0,3,NULL),(3177,'融安县',311,0,3,NULL),(3178,'融水苗族自治县',311,0,3,NULL),(3179,'鱼峰区',311,0,3,NULL),(3180,'鹿寨县',311,0,3,NULL),(3181,'七星区',312,0,3,NULL),(3182,'临桂县',312,0,3,NULL),(3183,'全州县',312,0,3,NULL),(3184,'兴安县',312,0,3,NULL),(3185,'叠彩区',312,0,3,NULL),(3186,'平乐县',312,0,3,NULL),(3187,'恭城瑶族自治县',312,0,3,NULL),(3188,'永福县',312,0,3,NULL),(3189,'灌阳县',312,0,3,NULL),(3190,'灵川县',312,0,3,NULL),(3191,'秀峰区',312,0,3,NULL),(3192,'荔浦县',312,0,3,NULL),(3193,'象山区',312,0,3,NULL),(3194,'资源县',312,0,3,NULL),(3195,'阳朔县',312,0,3,NULL),(3196,'雁山区',312,0,3,NULL),(3197,'龙胜各族自治县',312,0,3,NULL),(3198,'万秀区',313,0,3,NULL),(3199,'岑溪市',313,0,3,NULL),(3200,'苍梧县',313,0,3,NULL),(3201,'蒙山县',313,0,3,NULL),(3202,'藤县',313,0,3,NULL),(3203,'蝶山区',313,0,3,NULL),(3204,'长洲区',313,0,3,NULL),(3205,'合浦县',314,0,3,NULL),(3206,'海城区',314,0,3,NULL),(3207,'铁山港区',314,0,3,NULL),(3208,'银海区',314,0,3,NULL),(3209,'上思县',315,0,3,NULL),(3210,'东兴市',315,0,3,NULL),(3211,'港口区',315,0,3,NULL),(3212,'防城区',315,0,3,NULL),(3213,'浦北县',316,0,3,NULL),(3214,'灵山县',316,0,3,NULL),(3215,'钦北区',316,0,3,NULL),(3216,'钦南区',316,0,3,NULL),(3217,'平南县',317,0,3,NULL),(3218,'桂平市',317,0,3,NULL),(3219,'港北区',317,0,3,NULL),(3220,'港南区',317,0,3,NULL),(3221,'覃塘区',317,0,3,NULL),(3222,'兴业县',318,0,3,NULL),(3223,'北流市',318,0,3,NULL),(3224,'博白县',318,0,3,NULL),(3225,'容县',318,0,3,NULL),(3226,'玉州区',318,0,3,NULL),(3227,'陆川县',318,0,3,NULL),(3228,'乐业县',319,0,3,NULL),(3229,'凌云县',319,0,3,NULL),(3230,'右江区',319,0,3,NULL),(3231,'平果县',319,0,3,NULL),(3232,'德保县',319,0,3,NULL),(3233,'田东县',319,0,3,NULL),(3234,'田林县',319,0,3,NULL),(3235,'田阳县',319,0,3,NULL),(3236,'西林县',319,0,3,NULL),(3237,'那坡县',319,0,3,NULL),(3238,'隆林各族自治县',319,0,3,NULL),(3239,'靖西县',319,0,3,NULL),(3240,'八步区',320,0,3,NULL),(3241,'富川瑶族自治县',320,0,3,NULL),(3242,'昭平县',320,0,3,NULL),(3243,'钟山县',320,0,3,NULL),(3244,'东兰县',321,0,3,NULL),(3245,'凤山县',321,0,3,NULL),(3246,'南丹县',321,0,3,NULL),(3247,'大化瑶族自治县',321,0,3,NULL),(3248,'天峨县',321,0,3,NULL),(3249,'宜州市',321,0,3,NULL),(3250,'巴马瑶族自治县',321,0,3,NULL),(3251,'环江毛南族自治县',321,0,3,NULL),(3252,'罗城仫佬族自治县',321,0,3,NULL),(3253,'都安瑶族自治县',321,0,3,NULL),(3254,'金城江区',321,0,3,NULL),(3255,'兴宾区',322,0,3,NULL),(3256,'合山市',322,0,3,NULL),(3257,'忻城县',322,0,3,NULL),(3258,'武宣县',322,0,3,NULL),(3259,'象州县',322,0,3,NULL),(3260,'金秀瑶族自治县',322,0,3,NULL),(3261,'凭祥市',323,0,3,NULL),(3262,'大新县',323,0,3,NULL),(3263,'天等县',323,0,3,NULL),(3264,'宁明县',323,0,3,NULL),(3265,'扶绥县',323,0,3,NULL),(3266,'江州区',323,0,3,NULL),(3267,'龙州县',323,0,3,NULL),(3268,'琼山区',324,0,3,NULL),(3269,'秀英区',324,0,3,NULL),(3270,'美兰区',324,0,3,NULL),(3271,'龙华区',324,0,3,NULL),(3272,'三亚市',325,0,3,NULL),(3273,'五指山市',326,0,3,NULL),(3274,'琼海市',327,0,3,NULL),(3275,'儋州市',328,0,3,NULL),(3276,'文昌市',329,0,3,NULL),(3277,'万宁市',330,0,3,NULL),(3278,'东方市',331,0,3,NULL),(3279,'定安县',332,0,3,NULL),(3280,'屯昌县',333,0,3,NULL),(3281,'澄迈县',334,0,3,NULL),(3282,'临高县',335,0,3,NULL),(3283,'白沙黎族自治县',336,0,3,NULL),(3284,'昌江黎族自治县',337,0,3,NULL),(3285,'乐东黎族自治县',338,0,3,NULL),(3286,'陵水黎族自治县',339,0,3,NULL),(3287,'保亭黎族苗族自治县',340,0,3,NULL),(3288,'琼中黎族苗族自治县',341,0,3,NULL),(4209,'双流县',385,0,3,NULL),(4210,'大邑县',385,0,3,NULL),(4211,'崇州市',385,0,3,NULL),(4212,'彭州市',385,0,3,NULL),(4213,'成华区',385,0,3,NULL),(4214,'新津县',385,0,3,NULL),(4215,'新都区',385,0,3,NULL),(4216,'武侯区',385,0,3,NULL),(4217,'温江区',385,0,3,NULL),(4218,'蒲江县',385,0,3,NULL),(4219,'邛崃市',385,0,3,NULL),(4220,'郫县',385,0,3,NULL),(4221,'都江堰市',385,0,3,NULL),(4222,'金堂县',385,0,3,NULL),(4223,'金牛区',385,0,3,NULL),(4224,'锦江区',385,0,3,NULL),(4225,'青白江区',385,0,3,NULL),(4226,'青羊区',385,0,3,NULL),(4227,'龙泉驿区',385,0,3,NULL),(4228,'大安区',386,0,3,NULL),(4229,'富顺县',386,0,3,NULL),(4230,'沿滩区',386,0,3,NULL),(4231,'自流井区',386,0,3,NULL),(4232,'荣县',386,0,3,NULL),(4233,'贡井区',386,0,3,NULL),(4234,'东区',387,0,3,NULL),(4235,'仁和区',387,0,3,NULL),(4236,'盐边县',387,0,3,NULL),(4237,'米易县',387,0,3,NULL),(4238,'西区',387,0,3,NULL),(4239,'叙永县',388,0,3,NULL),(4240,'古蔺县',388,0,3,NULL),(4241,'合江县',388,0,3,NULL),(4242,'江阳区',388,0,3,NULL),(4243,'泸县',388,0,3,NULL),(4244,'纳溪区',388,0,3,NULL),(4245,'龙马潭区',388,0,3,NULL),(4246,'中江县',389,0,3,NULL),(4247,'什邡市',389,0,3,NULL),(4248,'广汉市',389,0,3,NULL),(4249,'旌阳区',389,0,3,NULL),(4250,'绵竹市',389,0,3,NULL),(4251,'罗江县',389,0,3,NULL),(4252,'三台县',390,0,3,NULL),(4253,'北川羌族自治县',390,0,3,NULL),(4254,'安县',390,0,3,NULL),(4255,'平武县',390,0,3,NULL),(4256,'梓潼县',390,0,3,NULL),(4257,'江油市',390,0,3,NULL),(4258,'涪城区',390,0,3,NULL),(4259,'游仙区',390,0,3,NULL),(4260,'盐亭县',390,0,3,NULL),(4261,'元坝区',391,0,3,NULL),(4262,'利州区',391,0,3,NULL),(4263,'剑阁县',391,0,3,NULL),(4264,'旺苍县',391,0,3,NULL),(4265,'朝天区',391,0,3,NULL),(4266,'苍溪县',391,0,3,NULL),(4267,'青川县',391,0,3,NULL),(4268,'大英县',392,0,3,NULL),(4269,'安居区',392,0,3,NULL),(4270,'射洪县',392,0,3,NULL),(4271,'船山区',392,0,3,NULL),(4272,'蓬溪县',392,0,3,NULL),(4273,'东兴区',393,0,3,NULL),(4274,'威远县',393,0,3,NULL),(4275,'市中区',393,0,3,NULL),(4276,'资中县',393,0,3,NULL),(4277,'隆昌县',393,0,3,NULL),(4278,'五通桥区',394,0,3,NULL),(4279,'井研县',394,0,3,NULL),(4280,'夹江县',394,0,3,NULL),(4281,'峨眉山市',394,0,3,NULL),(4282,'峨边彝族自治县',394,0,3,NULL),(4283,'市中区',394,0,3,NULL),(4284,'沐川县',394,0,3,NULL),(4285,'沙湾区',394,0,3,NULL),(4286,'犍为县',394,0,3,NULL),(4287,'金口河区',394,0,3,NULL),(4288,'马边彝族自治县',394,0,3,NULL),(4289,'仪陇县',395,0,3,NULL),(4290,'南充市嘉陵区',395,0,3,NULL),(4291,'南部县',395,0,3,NULL),(4292,'嘉陵区',395,0,3,NULL),(4293,'营山县',395,0,3,NULL),(4294,'蓬安县',395,0,3,NULL),(4295,'西充县',395,0,3,NULL),(4296,'阆中市',395,0,3,NULL),(4297,'顺庆区',395,0,3,NULL),(4298,'高坪区',395,0,3,NULL),(4299,'东坡区',396,0,3,NULL),(4300,'丹棱县',396,0,3,NULL),(4301,'仁寿县',396,0,3,NULL),(4302,'彭山县',396,0,3,NULL),(4303,'洪雅县',396,0,3,NULL),(4304,'青神县',396,0,3,NULL),(4305,'兴文县',397,0,3,NULL),(4306,'南溪县',397,0,3,NULL),(4307,'宜宾县',397,0,3,NULL),(4308,'屏山县',397,0,3,NULL),(4309,'江安县',397,0,3,NULL),(4310,'珙县',397,0,3,NULL),(4311,'筠连县',397,0,3,NULL),(4312,'翠屏区',397,0,3,NULL),(4313,'长宁县',397,0,3,NULL),(4314,'高县',397,0,3,NULL),(4315,'华蓥市',398,0,3,NULL),(4316,'岳池县',398,0,3,NULL),(4317,'广安区',398,0,3,NULL),(4318,'武胜县',398,0,3,NULL),(4319,'邻水县',398,0,3,NULL),(4320,'万源市',399,0,3,NULL),(4321,'大竹县',399,0,3,NULL),(4322,'宣汉县',399,0,3,NULL),(4323,'开江县',399,0,3,NULL),(4324,'渠县',399,0,3,NULL),(4325,'达县',399,0,3,NULL),(4326,'通川区',399,0,3,NULL),(4327,'名山县',400,0,3,NULL),(4328,'天全县',400,0,3,NULL),(4329,'宝兴县',400,0,3,NULL),(4330,'汉源县',400,0,3,NULL),(4331,'石棉县',400,0,3,NULL),(4332,'芦山县',400,0,3,NULL),(4333,'荥经县',400,0,3,NULL),(4334,'雨城区',400,0,3,NULL),(4335,'南江县',401,0,3,NULL),(4336,'巴州区',401,0,3,NULL),(4337,'平昌县',401,0,3,NULL),(4338,'通江县',401,0,3,NULL),(4339,'乐至县',402,0,3,NULL),(4340,'安岳县',402,0,3,NULL),(4341,'简阳市',402,0,3,NULL),(4342,'雁江区',402,0,3,NULL),(4343,'九寨沟县',403,0,3,NULL),(4344,'壤塘县',403,0,3,NULL),(4345,'小金县',403,0,3,NULL),(4346,'松潘县',403,0,3,NULL),(4347,'汶川县',403,0,3,NULL),(4348,'理县',403,0,3,NULL),(4349,'红原县',403,0,3,NULL),(4350,'若尔盖县',403,0,3,NULL),(4351,'茂县',403,0,3,NULL),(4352,'金川县',403,0,3,NULL),(4353,'阿坝县',403,0,3,NULL),(4354,'马尔康县',403,0,3,NULL),(4355,'黑水县',403,0,3,NULL),(4356,'丹巴县',404,0,3,NULL),(4357,'乡城县',404,0,3,NULL),(4358,'巴塘县',404,0,3,NULL),(4359,'康定县',404,0,3,NULL),(4360,'得荣县',404,0,3,NULL),(4361,'德格县',404,0,3,NULL),(4362,'新龙县',404,0,3,NULL),(4363,'泸定县',404,0,3,NULL),(4364,'炉霍县',404,0,3,NULL),(4365,'理塘县',404,0,3,NULL),(4366,'甘孜县',404,0,3,NULL),(4367,'白玉县',404,0,3,NULL),(4368,'石渠县',404,0,3,NULL),(4369,'稻城县',404,0,3,NULL),(4370,'色达县',404,0,3,NULL),(4371,'道孚县',404,0,3,NULL),(4372,'雅江县',404,0,3,NULL),(4373,'会东县',405,0,3,NULL),(4374,'会理县',405,0,3,NULL),(4375,'冕宁县',405,0,3,NULL),(4376,'喜德县',405,0,3,NULL),(4377,'宁南县',405,0,3,NULL),(4378,'布拖县',405,0,3,NULL),(4379,'德昌县',405,0,3,NULL),(4380,'昭觉县',405,0,3,NULL),(4381,'普格县',405,0,3,NULL),(4382,'木里藏族自治县',405,0,3,NULL),(4383,'甘洛县',405,0,3,NULL),(4384,'盐源县',405,0,3,NULL),(4385,'美姑县',405,0,3,NULL),(4386,'西昌',405,0,3,NULL),(4387,'越西县',405,0,3,NULL),(4388,'金阳县',405,0,3,NULL),(4389,'雷波县',405,0,3,NULL),(4390,'乌当区',406,0,3,NULL),(4391,'云岩区',406,0,3,NULL),(4392,'修文县',406,0,3,NULL),(4393,'南明区',406,0,3,NULL),(4394,'小河区',406,0,3,NULL),(4395,'开阳县',406,0,3,NULL),(4396,'息烽县',406,0,3,NULL),(4397,'清镇市',406,0,3,NULL),(4398,'白云区',406,0,3,NULL),(4399,'花溪区',406,0,3,NULL),(4400,'六枝特区',407,0,3,NULL),(4401,'水城县',407,0,3,NULL),(4402,'盘县',407,0,3,NULL),(4403,'钟山区',407,0,3,NULL),(4404,'习水县',408,0,3,NULL),(4405,'仁怀市',408,0,3,NULL),(4406,'余庆县',408,0,3,NULL),(4407,'凤冈县',408,0,3,NULL),(4408,'务川仡佬族苗族自治县',408,0,3,NULL),(4409,'桐梓县',408,0,3,NULL),(4410,'正安县',408,0,3,NULL),(4411,'汇川区',408,0,3,NULL),(4412,'湄潭县',408,0,3,NULL),(4413,'红花岗区',408,0,3,NULL),(4414,'绥阳县',408,0,3,NULL),(4415,'赤水市',408,0,3,NULL),(4416,'道真仡佬族苗族自治县',408,0,3,NULL),(4417,'遵义县',408,0,3,NULL),(4418,'关岭布依族苗族自治县',409,0,3,NULL),(4419,'平坝县',409,0,3,NULL),(4420,'普定县',409,0,3,NULL),(4421,'紫云苗族布依族自治县',409,0,3,NULL),(4422,'西秀区',409,0,3,NULL),(4423,'镇宁布依族苗族自治县',409,0,3,NULL),(4424,'万山特区',410,0,3,NULL),(4425,'印江土家族苗族自治县',410,0,3,NULL),(4426,'德江县',410,0,3,NULL),(4427,'思南县',410,0,3,NULL),(4428,'松桃苗族自治县',410,0,3,NULL),(4429,'江口县',410,0,3,NULL),(4430,'沿河土家族自治县',410,0,3,NULL),(4431,'玉屏侗族自治县',410,0,3,NULL),(4432,'石阡县',410,0,3,NULL),(4433,'铜仁市',410,0,3,NULL),(4434,'兴义市',411,0,3,NULL),(4435,'兴仁县',411,0,3,NULL),(4436,'册亨县',411,0,3,NULL),(4437,'安龙县',411,0,3,NULL),(4438,'普安县',411,0,3,NULL),(4439,'晴隆县',411,0,3,NULL),(4440,'望谟县',411,0,3,NULL),(4441,'贞丰县',411,0,3,NULL),(4442,'大方县',412,0,3,NULL),(4443,'威宁彝族回族苗族自治县',412,0,3,NULL),(4444,'毕节市',412,0,3,NULL),(4445,'纳雍县',412,0,3,NULL),(4446,'织金县',412,0,3,NULL),(4447,'赫章县',412,0,3,NULL),(4448,'金沙县',412,0,3,NULL),(4449,'黔西县',412,0,3,NULL),(4450,'三穗县',413,0,3,NULL),(4451,'丹寨县',413,0,3,NULL),(4452,'从江县',413,0,3,NULL),(4453,'凯里市',413,0,3,NULL),(4454,'剑河县',413,0,3,NULL),(4455,'台江县',413,0,3,NULL),(4456,'天柱县',413,0,3,NULL),(4457,'岑巩县',413,0,3,NULL),(4458,'施秉县',413,0,3,NULL),(4459,'榕江县',413,0,3,NULL),(4460,'锦屏县',413,0,3,NULL),(4461,'镇远县',413,0,3,NULL),(4462,'雷山县',413,0,3,NULL),(4463,'麻江县',413,0,3,NULL),(4464,'黄平县',413,0,3,NULL),(4465,'黎平县',413,0,3,NULL),(4466,'三都水族自治县',414,0,3,NULL),(4467,'平塘县',414,0,3,NULL),(4468,'惠水县',414,0,3,NULL),(4469,'独山县',414,0,3,NULL),(4470,'瓮安县',414,0,3,NULL),(4471,'福泉市',414,0,3,NULL),(4472,'罗甸县',414,0,3,NULL),(4473,'荔波县',414,0,3,NULL),(4474,'贵定县',414,0,3,NULL),(4475,'都匀市',414,0,3,NULL),(4476,'长顺县',414,0,3,NULL),(4477,'龙里县',414,0,3,NULL),(4478,'东川区',415,0,3,NULL),(4479,'五华区',415,0,3,NULL),(4480,'呈贡县',415,0,3,NULL),(4481,'安宁市',415,0,3,NULL),(4482,'官渡区',415,0,3,NULL),(4483,'宜良县',415,0,3,NULL),(4484,'富民县',415,0,3,NULL),(4485,'寻甸回族彝族自治县',415,0,3,NULL),(4486,'嵩明县',415,0,3,NULL),(4487,'晋宁县',415,0,3,NULL),(4488,'盘龙区',415,0,3,NULL),(4489,'石林彝族自治县',415,0,3,NULL),(4490,'禄劝彝族苗族自治县',415,0,3,NULL),(4491,'西山区',415,0,3,NULL),(4492,'会泽县',416,0,3,NULL),(4493,'宣威市',416,0,3,NULL),(4494,'富源县',416,0,3,NULL),(4495,'师宗县',416,0,3,NULL),(4496,'沾益县',416,0,3,NULL),(4497,'罗平县',416,0,3,NULL),(4498,'陆良县',416,0,3,NULL),(4499,'马龙县',416,0,3,NULL),(4500,'麒麟区',416,0,3,NULL),(4501,'元江哈尼族彝族傣族自治县',417,0,3,NULL),(4502,'华宁县',417,0,3,NULL),(4503,'峨山彝族自治县',417,0,3,NULL),(4504,'新平彝族傣族自治县',417,0,3,NULL),(4505,'易门县',417,0,3,NULL),(4506,'江川县',417,0,3,NULL),(4507,'澄江县',417,0,3,NULL),(4508,'红塔区',417,0,3,NULL),(4509,'通海县',417,0,3,NULL),(4510,'施甸县',418,0,3,NULL),(4511,'昌宁县',418,0,3,NULL),(4512,'腾冲县',418,0,3,NULL),(4513,'隆阳区',418,0,3,NULL),(4514,'龙陵县',418,0,3,NULL),(4515,'大关县',419,0,3,NULL),(4516,'威信县',419,0,3,NULL),(4517,'巧家县',419,0,3,NULL),(4518,'彝良县',419,0,3,NULL),(4519,'昭阳区',419,0,3,NULL),(4520,'水富县',419,0,3,NULL),(4521,'永善县',419,0,3,NULL),(4522,'盐津县',419,0,3,NULL),(4523,'绥江县',419,0,3,NULL),(4524,'镇雄县',419,0,3,NULL),(4525,'鲁甸县',419,0,3,NULL),(4526,'华坪县',420,0,3,NULL),(4527,'古城区',420,0,3,NULL),(4528,'宁蒗彝族自治县',420,0,3,NULL),(4529,'永胜县',420,0,3,NULL),(4530,'玉龙纳西族自治县',420,0,3,NULL),(4531,'临翔区',422,0,3,NULL),(4532,'云县',422,0,3,NULL),(4533,'凤庆县',422,0,3,NULL),(4534,'双江拉祜族佤族布朗族傣族自治县',422,0,3,NULL),(4535,'永德县',422,0,3,NULL),(4536,'沧源佤族自治县',422,0,3,NULL),(4537,'耿马傣族佤族自治县',422,0,3,NULL),(4538,'镇康县',422,0,3,NULL),(4539,'元谋县',423,0,3,NULL),(4540,'南华县',423,0,3,NULL),(4541,'双柏县',423,0,3,NULL),(4542,'大姚县',423,0,3,NULL),(4543,'姚安县',423,0,3,NULL),(4544,'楚雄市',423,0,3,NULL),(4545,'武定县',423,0,3,NULL),(4546,'永仁县',423,0,3,NULL),(4547,'牟定县',423,0,3,NULL),(4548,'禄丰县',423,0,3,NULL),(4549,'个旧市',424,0,3,NULL),(4550,'元阳县',424,0,3,NULL),(4551,'屏边苗族自治县',424,0,3,NULL),(4552,'建水县',424,0,3,NULL),(4553,'开远市',424,0,3,NULL),(4554,'弥勒县',424,0,3,NULL),(4555,'河口瑶族自治县',424,0,3,NULL),(4556,'泸西县',424,0,3,NULL),(4557,'石屏县',424,0,3,NULL),(4558,'红河县',424,0,3,NULL),(4559,'绿春县',424,0,3,NULL),(4560,'蒙自县',424,0,3,NULL),(4561,'金平苗族瑶族傣族自治县',424,0,3,NULL),(4562,'丘北县',425,0,3,NULL),(4563,'富宁县',425,0,3,NULL),(4564,'广南县',425,0,3,NULL),(4565,'文山县',425,0,3,NULL),(4566,'砚山县',425,0,3,NULL),(4567,'西畴县',425,0,3,NULL),(4568,'马关县',425,0,3,NULL),(4569,'麻栗坡县',425,0,3,NULL),(4570,'勐海县',426,0,3,NULL),(4571,'勐腊县',426,0,3,NULL),(4572,'景洪市',426,0,3,NULL),(4573,'云龙县',427,0,3,NULL),(4574,'剑川县',427,0,3,NULL),(4575,'南涧彝族自治县',427,0,3,NULL),(4576,'大理市',427,0,3,NULL),(4577,'宾川县',427,0,3,NULL),(4578,'巍山彝族回族自治县',427,0,3,NULL),(4579,'弥渡县',427,0,3,NULL),(4580,'永平县',427,0,3,NULL),(4581,'洱源县',427,0,3,NULL),(4582,'漾濞彝族自治县',427,0,3,NULL),(4583,'祥云县',427,0,3,NULL),(4584,'鹤庆县',427,0,3,NULL),(4585,'梁河县',428,0,3,NULL),(4586,'潞西市',428,0,3,NULL),(4587,'瑞丽市',428,0,3,NULL),(4588,'盈江县',428,0,3,NULL),(4589,'陇川县',428,0,3,NULL),(4590,'德钦县',430,0,3,NULL),(4591,'维西傈僳族自治县',430,0,3,NULL),(4592,'香格里拉县',430,0,3,NULL),(4593,'城关区',431,0,3,NULL),(4594,'堆龙德庆县',431,0,3,NULL),(4595,'墨竹工卡县',431,0,3,NULL),(4596,'尼木县',431,0,3,NULL),(4597,'当雄县',431,0,3,NULL),(4598,'曲水县',431,0,3,NULL),(4599,'林周县',431,0,3,NULL),(4600,'达孜县',431,0,3,NULL),(4601,'丁青县',432,0,3,NULL),(4602,'八宿县',432,0,3,NULL),(4603,'察雅县',432,0,3,NULL),(4604,'左贡县',432,0,3,NULL),(4605,'昌都县',432,0,3,NULL),(4606,'江达县',432,0,3,NULL),(4607,'洛隆县',432,0,3,NULL),(4608,'类乌齐县',432,0,3,NULL),(4609,'芒康县',432,0,3,NULL),(4610,'贡觉县',432,0,3,NULL),(4611,'边坝县',432,0,3,NULL),(4612,'乃东县',433,0,3,NULL),(4613,'加查县',433,0,3,NULL),(4614,'扎囊县',433,0,3,NULL),(4615,'措美县',433,0,3,NULL),(4616,'曲松县',433,0,3,NULL),(4617,'桑日县',433,0,3,NULL),(4618,'洛扎县',433,0,3,NULL),(4619,'浪卡子县',433,0,3,NULL),(4620,'琼结县',433,0,3,NULL),(4621,'贡嘎县',433,0,3,NULL),(4622,'错那县',433,0,3,NULL),(4623,'隆子县',433,0,3,NULL),(4624,'亚东县',434,0,3,NULL),(4625,'仁布县',434,0,3,NULL),(4626,'仲巴县',434,0,3,NULL),(4627,'南木林县',434,0,3,NULL),(4628,'吉隆县',434,0,3,NULL),(4629,'定日县',434,0,3,NULL),(4630,'定结县',434,0,3,NULL),(4631,'岗巴县',434,0,3,NULL),(4632,'康马县',434,0,3,NULL),(4633,'拉孜县',434,0,3,NULL),(4634,'日喀则市',434,0,3,NULL),(4635,'昂仁县',434,0,3,NULL),(4636,'江孜县',434,0,3,NULL),(4637,'白朗县',434,0,3,NULL),(4638,'聂拉木县',434,0,3,NULL),(4639,'萨嘎县',434,0,3,NULL),(4640,'萨迦县',434,0,3,NULL),(4641,'谢通门县',434,0,3,NULL),(4642,'嘉黎县',435,0,3,NULL),(4643,'安多县',435,0,3,NULL),(4644,'尼玛县',435,0,3,NULL),(4645,'巴青县',435,0,3,NULL),(4646,'比如县',435,0,3,NULL),(4647,'班戈县',435,0,3,NULL),(4648,'申扎县',435,0,3,NULL),(4649,'索县',435,0,3,NULL),(4650,'聂荣县',435,0,3,NULL),(4651,'那曲县',435,0,3,NULL),(4652,'噶尔县',436,0,3,NULL),(4653,'措勤县',436,0,3,NULL),(4654,'改则县',436,0,3,NULL),(4655,'日土县',436,0,3,NULL),(4656,'普兰县',436,0,3,NULL),(4657,'札达县',436,0,3,NULL),(4658,'革吉县',436,0,3,NULL),(4659,'墨脱县',437,0,3,NULL),(4660,'察隅县',437,0,3,NULL),(4661,'工布江达县',437,0,3,NULL),(4662,'朗县',437,0,3,NULL),(4663,'林芝县',437,0,3,NULL),(4664,'波密县',437,0,3,NULL),(4665,'米林县',437,0,3,NULL),(4666,'临潼区',438,0,3,NULL),(4667,'周至县',438,0,3,NULL),(4668,'户县',438,0,3,NULL),(4669,'新城区',438,0,3,NULL),(4670,'未央区',438,0,3,NULL),(4671,'灞桥区',438,0,3,NULL),(4672,'碑林区',438,0,3,NULL),(4673,'莲湖区',438,0,3,NULL),(4674,'蓝田县',438,0,3,NULL),(4675,'长安区',438,0,3,NULL),(4676,'阎良区',438,0,3,NULL),(4677,'雁塔区',438,0,3,NULL),(4678,'高陵县',438,0,3,NULL),(4679,'印台区',439,0,3,NULL),(4680,'宜君县',439,0,3,NULL),(4681,'王益区',439,0,3,NULL),(4682,'耀州区',439,0,3,NULL),(4683,'凤县',440,0,3,NULL),(4684,'凤翔县',440,0,3,NULL),(4685,'千阳县',440,0,3,NULL),(4686,'太白县',440,0,3,NULL),(4687,'岐山县',440,0,3,NULL),(4688,'扶风县',440,0,3,NULL),(4689,'渭滨区',440,0,3,NULL),(4690,'眉县',440,0,3,NULL),(4691,'金台区',440,0,3,NULL),(4692,'陇县',440,0,3,NULL),(4693,'陈仓区',440,0,3,NULL),(4694,'麟游县',440,0,3,NULL),(4695,'三原县',441,0,3,NULL),(4696,'干县',441,0,3,NULL),(4697,'兴平市',441,0,3,NULL),(4698,'彬县',441,0,3,NULL),(4699,'旬邑县',441,0,3,NULL),(4700,'杨陵区',441,0,3,NULL),(4701,'武功县',441,0,3,NULL),(4702,'永寿县',441,0,3,NULL),(4703,'泾阳县',441,0,3,NULL),(4704,'淳化县',441,0,3,NULL),(4705,'渭城区',441,0,3,NULL),(4706,'礼泉县',441,0,3,NULL),(4707,'秦都区',441,0,3,NULL),(4708,'长武县',441,0,3,NULL),(4709,'临渭区',442,0,3,NULL),(4710,'华县',442,0,3,NULL),(4711,'华阴市',442,0,3,NULL),(4712,'合阳县',442,0,3,NULL),(4713,'大荔县',442,0,3,NULL),(4714,'富平县',442,0,3,NULL),(4715,'潼关县',442,0,3,NULL),(4716,'澄城县',442,0,3,NULL),(4717,'白水县',442,0,3,NULL),(4718,'蒲城县',442,0,3,NULL),(4719,'韩城市',442,0,3,NULL),(4720,'吴起县',443,0,3,NULL),(4721,'子长县',443,0,3,NULL),(4722,'安塞县',443,0,3,NULL),(4723,'宜川县',443,0,3,NULL),(4724,'宝塔区',443,0,3,NULL),(4725,'富县',443,0,3,NULL),(4726,'延川县',443,0,3,NULL),(4727,'延长县',443,0,3,NULL),(4728,'志丹县',443,0,3,NULL),(4729,'洛川县',443,0,3,NULL),(4730,'甘泉县',443,0,3,NULL),(4731,'黄陵县',443,0,3,NULL),(4732,'黄龙县',443,0,3,NULL),(4733,'佛坪县',444,0,3,NULL),(4734,'勉县',444,0,3,NULL),(4735,'南郑县',444,0,3,NULL),(4736,'城固县',444,0,3,NULL),(4737,'宁强县',444,0,3,NULL),(4738,'汉台区',444,0,3,NULL),(4739,'洋县',444,0,3,NULL),(4740,'留坝县',444,0,3,NULL),(4741,'略阳县',444,0,3,NULL),(4742,'西乡县',444,0,3,NULL),(4743,'镇巴县',444,0,3,NULL),(4744,'佳县',445,0,3,NULL),(4745,'吴堡县',445,0,3,NULL),(4746,'子洲县',445,0,3,NULL),(4747,'定边县',445,0,3,NULL),(4748,'府谷县',445,0,3,NULL),(4749,'榆林市榆阳区',445,0,3,NULL),(4750,'横山县',445,0,3,NULL),(4751,'清涧县',445,0,3,NULL),(4752,'神木县',445,0,3,NULL),(4753,'米脂县',445,0,3,NULL),(4754,'绥德县',445,0,3,NULL),(4755,'靖边县',445,0,3,NULL),(4756,'宁陕县',446,0,3,NULL),(4757,'岚皋县',446,0,3,NULL),(4758,'平利县',446,0,3,NULL),(4759,'旬阳县',446,0,3,NULL),(4760,'汉滨区',446,0,3,NULL),(4761,'汉阴县',446,0,3,NULL),(4762,'白河县',446,0,3,NULL),(4763,'石泉县',446,0,3,NULL),(4764,'紫阳县',446,0,3,NULL),(4765,'镇坪县',446,0,3,NULL),(4766,'丹凤县',447,0,3,NULL),(4767,'商南县',447,0,3,NULL),(4768,'商州区',447,0,3,NULL),(4769,'山阳县',447,0,3,NULL),(4770,'柞水县',447,0,3,NULL),(4771,'洛南县',447,0,3,NULL),(4772,'镇安县',447,0,3,NULL),(4773,'七里河区',448,0,3,NULL),(4774,'城关区',448,0,3,NULL),(4775,'安宁区',448,0,3,NULL),(4776,'榆中县',448,0,3,NULL),(4777,'永登县',448,0,3,NULL),(4778,'皋兰县',448,0,3,NULL),(4779,'红古区',448,0,3,NULL),(4780,'西固区',448,0,3,NULL),(4781,'嘉峪关市',449,0,3,NULL),(4782,'永昌县',450,0,3,NULL),(4783,'金川区',450,0,3,NULL),(4784,'会宁县',451,0,3,NULL),(4785,'平川区',451,0,3,NULL),(4786,'景泰县',451,0,3,NULL),(4787,'白银区',451,0,3,NULL),(4788,'靖远县',451,0,3,NULL),(4789,'张家川回族自治县',452,0,3,NULL),(4790,'武山县',452,0,3,NULL),(4791,'清水县',452,0,3,NULL),(4792,'甘谷县',452,0,3,NULL),(4793,'秦安县',452,0,3,NULL),(4794,'秦州区',452,0,3,NULL),(4795,'麦积区',452,0,3,NULL),(4796,'凉州区',453,0,3,NULL),(4797,'古浪县',453,0,3,NULL),(4798,'天祝藏族自治县',453,0,3,NULL),(4799,'民勤县',453,0,3,NULL),(4800,'临泽县',454,0,3,NULL),(4801,'山丹县',454,0,3,NULL),(4802,'民乐县',454,0,3,NULL),(4803,'甘州区',454,0,3,NULL),(4804,'肃南裕固族自治县',454,0,3,NULL),(4805,'高台县',454,0,3,NULL),(4806,'华亭县',455,0,3,NULL),(4807,'崆峒区',455,0,3,NULL),(4808,'崇信县',455,0,3,NULL),(4809,'庄浪县',455,0,3,NULL),(4810,'泾川县',455,0,3,NULL),(4811,'灵台县',455,0,3,NULL),(4812,'静宁县',455,0,3,NULL),(4813,'敦煌市',456,0,3,NULL),(4814,'玉门市',456,0,3,NULL),(4815,'瓜州县（原安西县）',456,0,3,NULL),(4816,'肃北蒙古族自治县',456,0,3,NULL),(4817,'肃州区',456,0,3,NULL),(4818,'金塔县',456,0,3,NULL),(4819,'阿克塞哈萨克族自治县',456,0,3,NULL),(4820,'华池县',457,0,3,NULL),(4821,'合水县',457,0,3,NULL),(4822,'宁县',457,0,3,NULL),(4823,'庆城县',457,0,3,NULL),(4824,'正宁县',457,0,3,NULL),(4825,'环县',457,0,3,NULL),(4826,'西峰区',457,0,3,NULL),(4827,'镇原县',457,0,3,NULL),(4828,'临洮县',458,0,3,NULL),(4829,'安定区',458,0,3,NULL),(4830,'岷县',458,0,3,NULL),(4831,'渭源县',458,0,3,NULL),(4832,'漳县',458,0,3,NULL),(4833,'通渭县',458,0,3,NULL),(4834,'陇西县',458,0,3,NULL),(4835,'两当县',459,0,3,NULL),(4836,'宕昌县',459,0,3,NULL),(4837,'康县',459,0,3,NULL),(4838,'徽县',459,0,3,NULL),(4839,'成县',459,0,3,NULL),(4840,'文县',459,0,3,NULL),(4841,'武都区',459,0,3,NULL),(4842,'礼县',459,0,3,NULL),(4843,'西和县',459,0,3,NULL),(4844,'东乡族自治县',460,0,3,NULL),(4845,'临夏县',460,0,3,NULL),(4846,'临夏市',460,0,3,NULL),(4847,'和政县',460,0,3,NULL),(4848,'广河县',460,0,3,NULL),(4849,'康乐县',460,0,3,NULL),(4850,'永靖县',460,0,3,NULL),(4851,'积石山保安族东乡族撒拉族自治县',460,0,3,NULL),(4852,'临潭县',461,0,3,NULL),(4853,'卓尼县',461,0,3,NULL),(4854,'合作市',461,0,3,NULL),(4855,'夏河县',461,0,3,NULL),(4856,'玛曲县',461,0,3,NULL),(4857,'碌曲县',461,0,3,NULL),(4858,'舟曲县',461,0,3,NULL),(4859,'迭部县',461,0,3,NULL),(4860,'城东区',462,0,3,NULL),(4861,'城中区',462,0,3,NULL),(4862,'城北区',462,0,3,NULL),(4863,'城西区',462,0,3,NULL),(4864,'大通回族土族自治县',462,0,3,NULL),(4865,'湟中县',462,0,3,NULL),(4866,'湟源县',462,0,3,NULL),(4867,'乐都县',463,0,3,NULL),(4868,'互助土族自治县',463,0,3,NULL),(4869,'化隆回族自治县',463,0,3,NULL),(4870,'平安县',463,0,3,NULL),(4871,'循化撒拉族自治县',463,0,3,NULL),(4872,'民和回族土族自治县',463,0,3,NULL),(4873,'刚察县',464,0,3,NULL),(4874,'海晏县',464,0,3,NULL),(4875,'祁连县',464,0,3,NULL),(4876,'门源回族自治县',464,0,3,NULL),(4877,'同仁县',465,0,3,NULL),(4878,'尖扎县',465,0,3,NULL),(4879,'河南蒙古族自治县',465,0,3,NULL),(4880,'泽库县',465,0,3,NULL),(4881,'共和县',466,0,3,NULL),(4882,'兴海县',466,0,3,NULL),(4883,'同德县',466,0,3,NULL),(4884,'贵南县',466,0,3,NULL),(4885,'贵德县',466,0,3,NULL),(4886,'久治县',467,0,3,NULL),(4887,'玛多县',467,0,3,NULL),(4888,'玛沁县',467,0,3,NULL),(4889,'班玛县',467,0,3,NULL),(4890,'甘德县',467,0,3,NULL),(4891,'达日县',467,0,3,NULL),(4892,'囊谦县',468,0,3,NULL),(4893,'曲麻莱县',468,0,3,NULL),(4894,'杂多县',468,0,3,NULL),(4895,'治多县',468,0,3,NULL),(4896,'玉树县',468,0,3,NULL),(4897,'称多县',468,0,3,NULL),(4898,'乌兰县',469,0,3,NULL),(4899,'冷湖行委',469,0,3,NULL),(4900,'大柴旦行委',469,0,3,NULL),(4901,'天峻县',469,0,3,NULL),(4902,'德令哈市',469,0,3,NULL),(4903,'格尔木市',469,0,3,NULL),(4904,'茫崖行委',469,0,3,NULL),(4905,'都兰县',469,0,3,NULL),(4906,'兴庆区',470,0,3,NULL),(4907,'永宁县',470,0,3,NULL),(4908,'灵武市',470,0,3,NULL),(4909,'西夏区',470,0,3,NULL),(4910,'贺兰县',470,0,3,NULL),(4911,'金凤区',470,0,3,NULL),(4912,'大武口区',471,0,3,NULL),(4913,'平罗县',471,0,3,NULL),(4914,'惠农区',471,0,3,NULL),(4915,'利通区',472,0,3,NULL),(4916,'同心县',472,0,3,NULL),(4917,'盐池县',472,0,3,NULL),(4918,'青铜峡市',472,0,3,NULL),(4919,'原州区',473,0,3,NULL),(4920,'彭阳县',473,0,3,NULL),(4921,'泾源县',473,0,3,NULL),(4922,'西吉县',473,0,3,NULL),(4923,'隆德县',473,0,3,NULL),(4924,'中宁县',474,0,3,NULL),(4925,'沙坡头区',474,0,3,NULL),(4926,'海原县',474,0,3,NULL),(4927,'东山区',475,0,3,NULL),(4928,'乌鲁木齐县',475,0,3,NULL),(4929,'天山区',475,0,3,NULL),(4930,'头屯河区',475,0,3,NULL),(4931,'新市区',475,0,3,NULL),(4932,'水磨沟区',475,0,3,NULL),(4933,'沙依巴克区',475,0,3,NULL),(4934,'达坂城区',475,0,3,NULL),(4935,'乌尔禾区',476,0,3,NULL),(4936,'克拉玛依区',476,0,3,NULL),(4937,'独山子区',476,0,3,NULL),(4938,'白碱滩区',476,0,3,NULL),(4939,'吐鲁番市',477,0,3,NULL),(4940,'托克逊县',477,0,3,NULL),(4941,'鄯善县',477,0,3,NULL),(4942,'伊吾县',478,0,3,NULL),(4943,'哈密市',478,0,3,NULL),(4944,'巴里坤哈萨克自治县',478,0,3,NULL),(4945,'吉木萨尔县',479,0,3,NULL),(4946,'呼图壁县',479,0,3,NULL),(4947,'奇台县',479,0,3,NULL),(4948,'昌吉市',479,0,3,NULL),(4949,'木垒哈萨克自治县',479,0,3,NULL),(4950,'玛纳斯县',479,0,3,NULL),(4951,'米泉市',479,0,3,NULL),(4952,'阜康市',479,0,3,NULL),(4953,'博乐市',480,0,3,NULL),(4954,'温泉县',480,0,3,NULL),(4955,'精河县',480,0,3,NULL),(4956,'博湖县',481,0,3,NULL),(4957,'和硕县',481,0,3,NULL),(4958,'和静县',481,0,3,NULL),(4959,'尉犁县',481,0,3,NULL),(4960,'库尔勒市',481,0,3,NULL),(4961,'焉耆回族自治县',481,0,3,NULL),(4962,'若羌县',481,0,3,NULL),(4963,'轮台县',481,0,3,NULL),(4964,'乌什县',482,0,3,NULL),(4965,'库车县',482,0,3,NULL),(4966,'拜城县',482,0,3,NULL),(4967,'新和县',482,0,3,NULL),(4968,'柯坪县',482,0,3,NULL),(4969,'沙雅县',482,0,3,NULL),(4970,'温宿县',482,0,3,NULL),(4971,'阿克苏市',482,0,3,NULL),(4972,'阿瓦提县',482,0,3,NULL),(4973,'乌恰县',483,0,3,NULL),(4974,'阿克陶县',483,0,3,NULL),(4975,'阿合奇县',483,0,3,NULL),(4976,'阿图什市',483,0,3,NULL),(4977,'伽师县',484,0,3,NULL),(4978,'叶城县',484,0,3,NULL),(4979,'喀什市',484,0,3,NULL),(4980,'塔什库尔干塔吉克自治县',484,0,3,NULL),(4981,'岳普湖县',484,0,3,NULL),(4982,'巴楚县',484,0,3,NULL),(4983,'泽普县',484,0,3,NULL),(4984,'疏勒县',484,0,3,NULL),(4985,'疏附县',484,0,3,NULL),(4986,'英吉沙县',484,0,3,NULL),(4987,'莎车县',484,0,3,NULL),(4988,'麦盖提县',484,0,3,NULL),(4989,'于田县',485,0,3,NULL),(4990,'和田县',485,0,3,NULL),(4991,'和田市',485,0,3,NULL),(4992,'墨玉县',485,0,3,NULL),(4993,'民丰县',485,0,3,NULL),(4994,'洛浦县',485,0,3,NULL),(4995,'皮山县',485,0,3,NULL),(4996,'策勒县',485,0,3,NULL),(4997,'伊宁县',486,0,3,NULL),(4998,'伊宁市',486,0,3,NULL),(4999,'奎屯市',486,0,3,NULL),(5000,'察布查尔锡伯自治县',486,0,3,NULL),(5001,'尼勒克县',486,0,3,NULL),(5002,'巩留县',486,0,3,NULL),(5003,'新源县',486,0,3,NULL),(5004,'昭苏县',486,0,3,NULL),(5005,'特克斯县',486,0,3,NULL),(5006,'霍城县',486,0,3,NULL),(5007,'乌苏市',487,0,3,NULL),(5008,'和布克赛尔蒙古自治县',487,0,3,NULL),(5009,'塔城市',487,0,3,NULL),(5010,'托里县',487,0,3,NULL),(5011,'沙湾县',487,0,3,NULL),(5012,'裕民县',487,0,3,NULL),(5013,'额敏县',487,0,3,NULL),(5014,'吉木乃县',488,0,3,NULL),(5015,'哈巴河县',488,0,3,NULL),(5016,'富蕴县',488,0,3,NULL),(5017,'布尔津县',488,0,3,NULL),(5018,'福海县',488,0,3,NULL),(5019,'阿勒泰市',488,0,3,NULL),(5020,'青河县',488,0,3,NULL),(5021,'石河子市',489,0,3,NULL),(5022,'阿拉尔市',490,0,3,NULL),(5023,'图木舒克市',491,0,3,NULL),(5024,'五家渠市',492,0,3,NULL),(45055,'海外',35,0,2,NULL),(45077,'美国',0,0,0,NULL),(45078,'测试地址',1298,0,0,NULL),(45079,'111',1151,0,4,NULL),(45083,'1111',55,0,4,NULL),(45084,'555555',45083,0,5,NULL),(45085,'2222',55,0,4,NULL);

/*Table structure for table `pre_article` */

DROP TABLE IF EXISTS `pre_article`;

CREATE TABLE `pre_article` (
  `article_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '索引id',
  `class_id` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT '分类id',
  `article_url` varchar(100) DEFAULT '' COMMENT '跳转链接',
  `article_show` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '是否显示，0为否，1为是，默认为1',
  `article_sort` tinyint(3) unsigned NOT NULL DEFAULT '255' COMMENT '排序',
  `article_title` varchar(100) DEFAULT NULL DEFAULT '' COMMENT '标题',
  `article_content` text COMMENT '内容',
  `article_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布时间',
  PRIMARY KEY (`article_id`),
  KEY `class_id` (`class_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_article` */

/*Table structure for table `pre_bank` */

DROP TABLE IF EXISTS `pre_bank`;

CREATE TABLE `pre_bank` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `name` char(25) NOT NULL DEFAULT '' COMMENT '银行名字',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态',
  `add_time` int(10) NOT NULL DEFAULT '0' COMMENT '注册时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_bank` */

/*Table structure for table `pre_banner_template` */

DROP TABLE IF EXISTS `pre_banner_template`;

CREATE TABLE `pre_banner_template` (
  `tpl_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `tpl_name` varchar(50) NOT NULL DEFAULT '' COMMENT '模板名称',
  `html` text COMMENT '模板html',
  `intro_text` varchar(500) DEFAULT '' COMMENT '说明文字',
  `intro_pic` varchar(255) NOT NULL DEFAULT '' COMMENT '效果图片路径',
  PRIMARY KEY (`tpl_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8;

/*Data for the table `pre_banner_template` */

insert  into `pre_banner_template`(`tpl_id`,`tpl_name`,`html`,`intro_text`,`intro_pic`) values (1,'文字居中1','<p style=\"width: 50%;margin:1.5rem auto;font-size: 2rem;height: 3rem;background: url(/static/web/img/bg1.png) repeat;background-size: 100% 100%;text-align: center;line-height:1.8;\">专题</p>','','img-tit/tit1.png'),(2,'文字居中2','<div style=\"display: inline-block;width:100%;background#fff;height: 3rem;font-size: 2rem;text-align: center;line-height: 1.6;\">家居&nbsp;|<span style=\"font-size: 1.2rem;letter-spacing:1px;color: #aaa;padding-left: 5px;\">回家，放松身心</span></div>','','img-tit/tit2.png'),(3,'文字居左','<div style=\"width: 100%;padding: 0 3%;text-align:left;color: #f00;font-size: 1.6rem;height: 2.8rem;line-height: 2;border-bottom: 1px solid #f0f0f0;box-sizing: border-box;-webkit-box-sizing: border-box;-moz-box-sizing: border-box;\">特色市场</div>','','img-tit/tit4.png'),(4,'文字+更多','<div class=\"Tit5\" style=\"height: 2.8rem;border-bottom: 1px solid #f0f0f0;\">\r\n      <span style=\"background: url(/static/img/Tit5-bg.png) no-repeat left center;background-size: 16px auto;display: inline-block;vertical-align: middle;padding:5px 25px;float: left;margin-left: 3%;font-size: 1.4rem;color: #f00;\">掌上秒杀</span>\r\n      <a href=\"#\" style=\"float: right;padding-right: 3%;color: #999;background: url(/static/img/tit5-more-bg.png) no-repeat right center;background-size: 8px auto;padding-right: 16px;margin-right: 3%;line-height: 2;\">更多秒杀</a>\r\n   </div>','','img-tit/tit8.png'),(5,'图文居中1','<div style=\"height: 2.8rem;text-align: center;background: #fff;line-height: 2.5;position: relative;\">\r\n      <span style=\"padding: 0 10px;color: #999;font-size: 1.5rem;position: relative;background: #fff;z-index:1;\">\r\n       <span style=\"background: url(/static/img/gray-text-img.png) no-repeat center center;background-size: 13px 13px;width: 13px;height: 13px;margin-right: 10px;display: inline-block;\"></span>今日福利\r\n      </span>\r\n     <p style=\"height: 1px;position: absolute;top: 50%;left: 0;background-color: #cbcbcb;width: 100%;\"></p>\r\n    </div>','','img-tit/tit5.png'),(6,'图文居中2','<div class=\"titlebg component type39\" style=\"background: #fff;display:block;color:#051B28;font-size:14px;line-height:28px;height:28px;text-align:center\">\r\n      <span class=\"vline\" style=\"display:inline-block;border-bottom:1px solid #B4E1DC;width:34px;margin-bottom:5px;\"></span>\r\n      <img src=\"/static/img/tit6.png\" height=\"15px\" width=\"15px\" style=\"position: relative;top: 3px;\">\r\n      <span class=\"title\" style=\"color:#009F8A\">品牌资讯</span>\r\n     <span class=\"vline\" style=\"display:inline-block;border-bottom:1px solid #B4E1DC;width:34px;margin-bottom:5px;\"></span>\r\n    </div>','','img-tit/tit9.png'),(7,'图文居中3','<div style=\"height: 2.8rem;text-align: center;\">\r\n     <span style=\"background: url(/static/img/tit3-bg.png) no-repeat center;background-size: 30px 30px;width: 30px;height:30px;display: inline-block;vertical-align: middle;\"></span>\r\n      <span style=\"color: #999;font-size: 1.5rem;padding-left: 10px;vertical-align: middle;\">进口好材料，温柔托住你的疲惫</span>\r\n    </div>','','img-tit/tit6.png'),(8,'图文居左','<div style=\"height: 2.8rem;text-align:left;background: url(/static/img/red-bg.png) no-repeat 3% center;width: 100%;padding:0 3% 0 5%;box-sizing: border-box;-webkit-box-sizing: border-box;-moz-box-sizing: border-box;line-height: 2;font-size: 1.4rem;border-bottom: 1px solid #f0f0f0;color: #999;\">\r\n     家居日用\r\n    </div>','','img-tit/tit7.png'),(9,'查看更多','<div style=\"margin:1.5rem 0;text-align: center;\"><a href=\"#\" style=\"margin: 0 auto;font-size: 1.8rem;text-align: center;line-height:1.8;background: url(/static/web/img/more.png) no-repeat right center;padding-right: 30px;background-size: 18px 18px;color: #666;\">查看更多</a></div>','','img-tit/tit3.png'),(10,'空白通栏','<div style=\"background: #ccc;width: 100%;height: 2rem;\"></div>','','img-tit/tit10.png');

/*Table structure for table `pre_basket` */

DROP TABLE IF EXISTS `pre_basket`;

CREATE TABLE `pre_basket` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT 'id',
  `member_uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT 'id',
  `goods_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT 'id',
  `goods_name` varchar(100) NOT NULL  DEFAULT '',
  `goods_num` smallint(5) unsigned NOT NULL DEFAULT '1',
  `goods_image` varchar(100) NOT NULL  DEFAULT '',
  `goods_price` float(10,2) NOT NULL DEFAULT '0.00',
  `spec_name` varchar(100) NOT NULL DEFAULT '' COMMENT '商品 规格逗号隔开的名称',
  `goods_common_id` int(11) NOT NULL DEFAULT 0 COMMENT 'spu id',
  `add_time` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '物品添加时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `sid_gid` (`member_uid`,`goods_id`) USING BTREE,
  KEY `member_uid` (`member_uid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_basket` */

/*Table structure for table `pre_basket_nologin` */

DROP TABLE IF EXISTS `pre_basket_nologin`;

CREATE TABLE `pre_basket_nologin` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `sid` char(8) NOT NULL COMMENT 'id',
  `member_uid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT 'id',
  `goods_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT 'id',
  `goods_name` varchar(100) NOT NULL ,
  `goods_num` smallint(5) unsigned NOT NULL DEFAULT '1',
  `goods_image` varchar(100) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT '0',
  `goods_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `spec_name` varchar(100) NOT NULL DEFAULT '' COMMENT '商品 规格逗号隔开的名称',
  `goods_common_id` int(11) NOT NULL COMMENT 'spu id',
  `add_time` int(10) unsigned NOT NULL COMMENT '物品添加时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `sid_gid` (`sid`,`goods_id`) USING BTREE,
  KEY `member_uid` (`member_uid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_basket_nologin` */

/*Table structure for table `pre_causes` */

DROP TABLE IF EXISTS `pre_causes`;

CREATE TABLE `pre_causes` (
  `causes_id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `causes_name` char(20) NOT NULL COMMENT '',
  `clicknum` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '',
  `status` enum('1','2') DEFAULT '1' COMMENT '',
  PRIMARY KEY (`causes_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
 INSERT INTO pre_causes (`causes_name`) VALUE('不能按时发货'),('认为是假货'),('质保期不符'),('商品破损、有污渍'),('效果不好不喜欢');
/*Data for the table `pre_causes` */

/*Table structure for table `pre_cms_article` */

DROP TABLE IF EXISTS `pre_cms_article`;

CREATE TABLE `pre_cms_article` (
  `article_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '文章编号',
  `article_title` char(150) NOT NULL COMMENT '文章标题',
  `article_class_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章分类编号',
  `article_origin` char(50) NOT NULL DEFAULT '' COMMENT '文章来源',
  `article_origin_address` char(255) NOT NULL  DEFAULT '' COMMENT '文章来源链接',
  `article_author` char(50) NOT NULL  DEFAULT '' COMMENT '文章作者',
  `article_abstract` char(255) NOT NULL  DEFAULT ''  COMMENT '文章摘要',
  `article_content` text COMMENT '文章正文',
  `article_image` char(255) NOT NULL  DEFAULT ''  COMMENT '文章图片',
  `article_keyword` char(255) NOT NULL  DEFAULT '' COMMENT '文章关键字',
  `article_link` char(255) NOT NULL  DEFAULT ''  COMMENT '相关文章',
  `article_goods` text NOT NULL  DEFAULT ''  COMMENT '相关商品',
  `article_start_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章有效期开始时间',
  `article_end_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章有效期结束时间',
  `article_publish_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章发布时间',
  `article_click` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章点击量',
  `article_sort` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '文章排序0-255',
  `article_commend_flag` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '文章推荐标志0-未推荐，1-已推荐',
  `article_comment_flag` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '文章是否允许评论1-允许，0-不允许',
  `article_verify_admin` char(50) DEFAULT NULL COMMENT '文章审核管理员',
  `article_verify_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章审核时间',
  `article_state` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '1-草稿、2-待审核、3-已发布、4-回收站',
  `article_publisher_name` char(50) NOT NULL  DEFAULT ''  COMMENT '发布者用户名 ',
  `article_publisher_id` int(10) unsigned NOT NULL NOT NULL  DEFAULT '0'  COMMENT '发布者编号',
  `article_type` tinyint(1) unsigned NOT NULL  DEFAULT '1'  COMMENT '文章类型1-管理员发布，2-用户投稿',
  `article_attachment_path` char(225) NOT NULL  DEFAULT ''  COMMENT '文章附件路径',
  `article_image_all` text NOT NULL  DEFAULT ''  COMMENT '文章全部图片',
  `article_modify_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章修改时间',
  `article_tag` char(255) NOT NULL  DEFAULT ''  COMMENT '文章标签',
  `article_comment_count` int(10) unsigned DEFAULT '0' COMMENT '文章评论数',
  `article_attitude_1` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章心情1',
  `article_attitude_2` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章心情2',
  `article_attitude_3` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章心情3',
  `article_attitude_4` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章心情4',
  `article_attitude_5` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章心情5',
  `article_attitude_6` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章心情6',
  `article_title_short` varchar(50) NOT NULL DEFAULT '' COMMENT '文章短标题',
  `article_attitude_flag` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '文章态度开关1-允许，0-不允许',
  `article_commend_image_flag` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '文章推荐标志(图文)',
  `article_share_count` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '文章分享数',
  `article_verify_reason` varchar(255) DEFAULT NULL COMMENT '审核失败原因',
  PRIMARY KEY (`article_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_cms_article` */

/*Table structure for table `pre_cms_article_class` */

DROP TABLE IF EXISTS `pre_cms_article_class`;

CREATE TABLE `pre_cms_article_class` (
  `class_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '分类编号 ',
  `class_name` char(50) NOT NULL COMMENT '分类名称',
  `class_sort` tinyint(1) unsigned NOT NULL DEFAULT '255' COMMENT '排序',
  `class_code` char(20) NOT NULL DEFAULT '0' COMMENT '分类标识码',
  PRIMARY KEY (`class_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `pre_cms_article_class` */

insert  into `pre_cms_article_class`(`class_id`,`class_name`,`class_sort`,`class_code`) values (1,'帮助中心',0,'1');

/*Table structure for table `pre_companylist` */

DROP TABLE IF EXISTS `pre_companylist`;

CREATE TABLE `pre_companylist` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `code` char(56) NOT NULL DEFAULT '',
  `name` char(120) NOT NULL DEFAULT '',
  `url` char(225) NOT NULL DEFAULT '',
  `status` tinyint(4) unsigned NOT NULL DEFAULT '0',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`code`)
) ENGINE=InnoDB AUTO_INCREMENT=102 DEFAULT CHARSET=utf8;

/*Data for the table `pre_companylist` */

insert  into `pre_companylist`(`id`,`code`,`name`,`url`,`status`,`dateline`) values (1,'AJ','安捷快递','',1,0),(2,'ANE','安能物流','',1,0),(3,'AXD','安信达快递','',0,0),(4,'BQXHM','北青小红帽','',0,0),(5,'BFDF','百福东方','',0,0),(6,'BTWL','百世快运','',0,0),(7,'CCES','CCES快递','',0,0),(8,'CITY100','城市100','',0,0),(9,'COE','COE东方快递','',0,0),(10,'CSCY','长沙创一','',1,0),(11,'DBL','德邦','',1,0),(12,'DSWL','D速物流','',0,0),(13,'DTWL','大田物流','',0,0),(14,'EMS','EMS','',1,0),(15,'FAST','快捷速递','',0,0),(16,'FEDEX','FEDEX联邦(国内件）','',0,0),(17,'FEDEX_GJ','FEDEX联邦(国际件）','',0,0),(18,'FKD','飞康达','',0,0),(19,'GDEMS','广东邮政','',0,0),(20,'GSD','共速达','',0,0),(21,'GTO','国通快递','',0,0),(22,'GTSD','高铁速递','',0,0),(23,'HFWL','汇丰物流','',0,0),(24,'HHTT','天天快递','',1,0),(25,'HLWL','恒路物流','',0,0),(26,'HOAU','天地华宇','',0,0),(27,'hq568','华强物流','',0,0),(28,'HTKY','百世快递','',1,0),(29,'HXLWL','华夏龙物流','',0,0),(30,'HYLSD','好来运快递','',0,0),(31,'JGSD','京广速递','',0,0),(32,'JIUYE','九曳供应链','',0,0),(33,'JJKY','佳吉快运','',0,0),(34,'JLDT','嘉里物流','',0,0),(35,'JTKD','捷特快递','',0,0),(36,'JXD','急先达','',0,0),(37,'JYKD','晋越快递','',0,0),(38,'JYM','加运美','',0,0),(39,'JYWL','佳怡物流','',0,0),(40,'KYWL','跨越物流','',0,0),(41,'LB','龙邦快递','',0,0),(42,'LHT','联昊通速递','',0,0),(43,'MHKD','民航快递','',0,0),(44,'MLWL','明亮物流','',0,0),(45,'NEDA','能达速递','',0,0),(46,'PADTF','平安达腾飞快递','',0,0),(47,'QCKD','全晨快递','',0,0),(48,'QFKD','全峰快递','',0,0),(49,'QRT','全日通快递','',0,0),(50,'RFD','如风达','',0,0),(51,'SAD','赛澳递','',0,0),(52,'SAWL','圣安物流','',0,0),(53,'SBWL','盛邦物流','',0,0),(54,'SDWL','上大物流','',0,0),(55,'SF','顺丰快递','',1,0),(56,'SFWL','盛丰物流','',0,0),(57,'SHWL','盛辉物流','',0,0),(58,'ST','速通物流','',0,0),(59,'STO','申通快递','',1,0),(60,'STWL','速腾快递','',0,0),(61,'SURE','速尔快递','',0,0),(62,'TSSTO','唐山申通','',0,0),(63,'UAPEX','全一快递','',0,0),(64,'UC','优速快递','',0,0),(65,'WJWL','万家物流','',0,0),(66,'WXWL','万象物流','',0,0),(67,'XBWL','新邦物流','',0,0),(68,'XFEX','信丰快递','',0,0),(69,'XYT','希优特','',0,0),(70,'XJ','新杰物流','',0,0),(71,'YADEX','源安达快递','',0,0),(72,'YCWL','远成物流','',0,0),(73,'YD','韵达快递','',1,0),(74,'YDH','义达国际物流','',0,0),(75,'YFEX','越丰物流','',0,0),(76,'YFHEX','原飞航物流','',0,0),(77,'YFSD','亚风快递','',0,0),(78,'YTKD','运通快递','',0,0),(79,'YTO','圆通速递','',1,0),(80,'YXKD','亿翔快递','',0,0),(81,'YZPY','邮政平邮/小包','',0,0),(82,'ZENY','增益快递','',0,0),(83,'ZHQKD','汇强快递','',0,0),(84,'ZJS','宅急送','',0,0),(85,'ZTE','众通快递','',0,0),(86,'ZTKY','中铁快运','',0,0),(87,'ZTO','中通速递','',1,0),(88,'ZTWL','中铁物流','',0,0),(89,'ZYWL','中邮物流','',0,0),(90,'AMAZON','亚马逊物流','',0,0),(91,'SUBIDA','速必达物流','',0,0),(92,'RFEX','瑞丰速递','',0,0),(93,'QUICK','快客快递','',0,0),(94,'CJKD','城际快递','',0,0),(95,'CNPEX','CNPEX中邮快递','',0,0),(96,'HOTSCM','鸿桥供应链','',0,0),(97,'HPTEX','海派通物流公司','',0,0),(98,'AYCA','澳邮专线','',0,0),(99,'PANEX','泛捷快递','',0,0),(100,'PCA','PCA Express','',0,0),(101,'UEQ','UEQ Express','',0,0);

/*Table structure for table `pre_day_count` */

DROP TABLE IF EXISTS `pre_day_count`;

CREATE TABLE `pre_day_count` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键id',
  `count_date` int(8) NOT NULL DEFAULT '0' COMMENT '统计日期',
  `stime` int(10) NOT NULL DEFAULT '0' COMMENT '统计开始时间',
  `etime` int(10) NOT NULL DEFAULT '0' COMMENT '统计结束时间',
  `new_member_num` int(11) NOT NULL DEFAULT '0' COMMENT '新会员数',
  `order_num` int(11) NOT NULL DEFAULT '0' COMMENT '订单数',
  `order_amount` float(10,2) NOT NULL DEFAULT '0.00' COMMENT '订单金额',
  `sell_goods_num` int(11) NOT NULL DEFAULT '0' COMMENT '商品销量',
  `order_pay_num` mediumint(5) NOT NULL DEFAULT '0' COMMENT '订单支付笔数',
  `order_pay_amount` float(10,2) NOT NULL DEFAULT '0.00' COMMENT '订单支付总额',
  `pay_member_num` int(11) NOT NULL DEFAULT '0' COMMENT '订单支付人数',
  `per_member_pay` float(10,2) NOT NULL DEFAULT '0.00' COMMENT '客单价',
  `count_year` mediumint(4) NOT NULL DEFAULT '0' COMMENT '年',
  `count_month` smallint(2) NOT NULL DEFAULT '0' COMMENT '月',
  PRIMARY KEY (`id`),
  UNIQUE KEY `count_date` (`count_date`) USING BTREE,
  KEY `etime` (`etime`) USING BTREE,
  KEY `stime` (`stime`) USING BTREE,
  KEY `count_date_2` (`count_date`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_day_count` */

/*Table structure for table `pre_evaluate_goods` */

DROP TABLE IF EXISTS `pre_evaluate_goods`;

CREATE TABLE `pre_evaluate_goods` (
  `geval_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '',
  `geval_orderid` int(11) NOT NULL COMMENT '订单表自增ID',
  `geval_orderno` bigint(20) unsigned NOT NULL DEFAULT '0'  COMMENT '订单编号',
  `geval_ordergoodsid` int(11) NOT NULL COMMENT '订单商品表编号',
  `geval_goodsid` int(11) NOT NULL COMMENT '商品表编号',
  `geval_goodsname` char(100) NOT NULL COMMENT '商品名称',
  `geval_goodsprice` float(10,2) NOT NULL DEFAULT '0'  COMMENT '商品价格',
  `geval_goodsimage` char(255) NOT NULL DEFAULT ''  COMMENT '商品图片',
  `geval_scores` tinyint(1) NOT NULL DEFAULT '1' COMMENT '1-5分',
  `geval_content` char(255) NOT NULL DEFAULT '' COMMENT '信誉评价内容',
  `geval_isanonymous` tinyint(1) NOT NULL DEFAULT '0' COMMENT '00表示不是 1表示是匿名评价',
  `geval_addtime` int(11) NOT NULL DEFAULT 0  COMMENT '评价时间',
  `geval_storeid` int(11) NOT NULL DEFAULT 0  COMMENT '店铺编号',
  `geval_storename` char(100) NOT NULL DEFAULT ''  COMMENT '店铺名称',
  `geval_frommemberid` int(11) NOT NULL COMMENT '评价人编号',
  `geval_frommembername` char(100) NOT NULL DEFAULT ''  COMMENT '评价人名称',
  `geval_explain` char(255) NOT NULL DEFAULT ''  COMMENT '解释内容',
  `geval_image` char(255) NOT NULL DEFAULT ''  COMMENT '晒单图片',
  `geval_content_again` char(255) NOT NULL DEFAULT ''  COMMENT '追加评价内容',
  `geval_addtime_again` int(10) unsigned NOT NULL DEFAULT '0'  COMMENT '追加评价时间',
  `geval_image_again` char(255) NOT NULL DEFAULT '' COMMENT '追加评价图片',
  `geval_explain_again` char(255) NOT NULL DEFAULT ''  COMMENT '追加解释内容',
  `goods_common_id` int(11) NOT NULL COMMENT 'spu id',
  `goods_spec` char(255) NOT NULL DEFAULT '' COMMENT '商品规格',
  PRIMARY KEY (`geval_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_evaluate_goods` */

/*Table structure for table `pre_express` */

DROP TABLE IF EXISTS `pre_express`;

CREATE TABLE `pre_express` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code` char(10) NOT NULL DEFAULT '' COMMENT '快递公司编码',
  `no` char(20) NOT NULL DEFAULT '' COMMENT '快递单号',
  `data` text NOT NULL DEFAULT ''  COMMENT '物流信息',
  `dateline` int(10) NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `code` (`code`,`no`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_express` */

/*Table structure for table `pre_favorites` */

DROP TABLE IF EXISTS `pre_favorites`;

CREATE TABLE `pre_favorites` (
  `log_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `member_id` int(10) unsigned NOT NULL COMMENT '会员ID',
  `member_name` char(150) NOT NULL DEFAULT ''  COMMENT '会员名',
  `fav_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '商品或店铺ID',
  `fav_type` char(5) NOT NULL DEFAULT 'goods' COMMENT '类型:goods为商品,store为店铺,默认为商品',
  `fav_time` int(10) unsigned NOT NULL COMMENT '收藏时间',
  `store_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '店铺ID',
  `store_name` char(255) NOT NULL DEFAULT '' COMMENT '店铺名称',
  `sc_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '店铺分类ID',
  `goods_name` char(150) NOT NULL DEFAULT '' COMMENT '商品名称',
  `goods_image` char(255) NOT NULL DEFAULT '' COMMENT '商品图片',
  `gc_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '商品分类ID',
  `log_price` float(10,2) NOT NULL DEFAULT '0.00' COMMENT '商品收藏时价格',
  `log_msg` char(255) DEFAULT NULL COMMENT '收藏备注',
  PRIMARY KEY (`log_id`),
  KEY `member_id` (`member_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_favorites` */

/*Table structure for table `pre_feedback` */

DROP TABLE IF EXISTS `pre_feedback`;

CREATE TABLE `pre_feedback` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` int(10) unsigned NOT NULL COMMENT '',
  `member_name` varchar(50) NOT NULL DEFAULT '0' COMMENT '',
  `member_phone` varchar(50) NOT NULL DEFAULT '0' COMMENT '',
  `ftime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '',
  `content` char(255) NOT NULL DEFAULT '0'  COMMENT '',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '',
  `username` char(150) NOT NULL DEFAULT ''  COMMENT '',
  `ctime` int(10) unsigned NOT NULL DEFAULT '0'  COMMENT '',
  `instruction` char(255) NOT NULL DEFAULT '' COMMENT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_feedback` */

/*Table structure for table `pre_generate` */

DROP TABLE IF EXISTS `pre_generate`;

CREATE TABLE `pre_generate` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT 'id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_generate` */

/*Table structure for table `pre_goods` */

DROP TABLE IF EXISTS `pre_goods`;

CREATE TABLE `pre_goods` (
  `goods_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id skuid',
  `goods_common_id` int(11) NOT NULL COMMENT 'spu id',
  `goods_name` varchar(255) NOT NULL,
  `spec_name` varchar(100) NOT NULL DEFAULT '' COMMENT '商品 规格逗号隔开的名称',
  `goods_state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '商品状态  0 下架 1 上架   3 草稿   4 回收站',
  `gc_id` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `gc_id_1` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `gc_id_2` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `gc_id_3` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `goods_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `goods_storage` mediumint(5) unsigned NOT NULL DEFAULT '0',
  `goods_image` char(255) NOT NULL DEFAULT '' COMMENT 'sku',
  `goods_barcode` char(255) NOT NULL DEFAULT '',
  `add_time` int(10) NOT NULL DEFAULT '0',
  `update_time` int(10) NOT NULL DEFAULT '0',
  `spec_value_id_key` char(255) NOT NULL DEFAULT '' COMMENT 'id',
  `goods_spec` char(255) NOT NULL DEFAULT '' COMMENT '  id',
  `freight_type` enum('fixed','num','weight','volume') NOT NULL DEFAULT 'fixed' COMMENT '运费类型 固定运费 按件数 按重量 按体积',
  `freight` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '商品运费 起步运费',
  `freight_step_num` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '运费 步长  ',
  `freight_step_fee` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '运费每步长增加额度',
  `goods_weight` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '商品重量单位kg',
  `goods_volume` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '商品体积单位立方米',
  `sum_type` tinyint(1) NOT NULL DEFAULT '1' COMMENT '订单运费计算方式 1 累加 2 只计最大',
  PRIMARY KEY (`goods_id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `pre_goods` */

insert  into `pre_goods`(`goods_id`,`goods_common_id`,`goods_name`,`spec_name`,`goods_state`,`gc_id`,`gc_id_1`,`gc_id_2`,`gc_id_3`,`goods_price`,`goods_storage`,`goods_image`,`goods_barcode`,`add_time`,`update_time`,`spec_value_id_key`,`goods_spec`,`freight_type`,`freight`,`freight_step_num`,`freight_step_fee`,`goods_weight`,`goods_volume`,`sum_type`) values (1,1,'典雅美式全棉刺绣靠枕','太阳',1,2,1,2,0,'59.00',99,'Common/2016-09-07/57cfaa9434c32.png','',1473227451,1473227554,'4','a:1:{i:3;s:1:\"4\";}','fixed','5.00','0.00','0.00','0.00','0.00',1),(2,1,'典雅美式全棉刺绣靠枕','紫荆',1,2,1,2,0,'59.00',99,'Common/2016-09-07/57cfaaa676aec.png','',1473227451,1473227554,'5','a:1:{i:3;s:1:\"5\";}','fixed','5.00','0.00','0.00','0.00','0.00',1),(3,1,'典雅美式全棉刺绣靠枕','铃兰',1,2,1,2,0,'59.00',99,'Common/2016-09-07/57cfaab2e6540.png','',1473227451,1473227554,'6','a:1:{i:3;s:1:\"6\";}','fixed','5.00','0.00','0.00','0.00','0.00',1),(4,1,'典雅美式全棉刺绣靠枕','马蹄',1,2,1,2,0,'59.00',99,'Common/2016-09-07/57cfaab6c1f84.png','',1473227451,1473227554,'7','a:1:{i:3;s:1:\"7\";}','fixed','5.00','0.00','0.00','0.00','0.00',1),(5,2,'全棉进口埃及长绒棉浴巾','棕色',1,3,1,3,0,'99.00',99,'Common/2016-09-07/57cfabe655079.png','',1473227760,1473227818,'8','a:1:{i:1;s:1:\"8\";}','fixed','2.00','0.00','0.00','0.00','0.00',1),(6,2,'全棉进口埃及长绒棉浴巾','米色',1,3,1,3,0,'99.00',99,'Common/2016-09-07/57cfabeb14a9a.png','',1473227760,1473227818,'9','a:1:{i:1;s:1:\"9\";}','fixed','2.00','0.00','0.00','0.00','0.00',1),(7,2,'全棉进口埃及长绒棉浴巾','粉色',1,3,1,3,0,'99.00',99,'Common/2016-09-07/57cfabee71ba9.png','',1473227760,1473227818,'10','a:1:{i:1;s:2:\"10\";}','fixed','2.00','0.00','0.00','0.00','0.00',1),(8,3,'居家棉麻涤内衣收纳盒','十五格',1,4,1,4,0,'45.00',99,'Common/2016-09-07/57cfac800417c.png','',1473227970,1473228011,'11','a:1:{i:3;s:2:\"11\";}','fixed','0.00','0.00','0.00','0.00','0.00',1),(9,4,'日式天然蔺草地垫','180*180',1,5,1,5,0,'459.00',999,'Common/2016-09-07/57cfc22bb3eee.png','',1473233529,1473233620,'12','a:1:{i:2;s:2:\"12\";}','fixed','10.00','0.00','0.00','0.00','0.00',1);

/*Table structure for table `pre_goods_category` */

DROP TABLE IF EXISTS `pre_goods_category`;

CREATE TABLE `pre_goods_category` (
  `gc_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品分类id',
  `gc_name` varchar(80) NOT NULL COMMENT '商品分类名称',
  `gc_parent_id` int(11) NOT NULL DEFAULT '0' COMMENT '父级分类id',
  `gc_level` tinyint(1) NOT NULL DEFAULT '1' COMMENT '分类层级 最小为1最大为3',
  `is_leaf` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否是叶子节点 1为是 0为否',
  `is_show` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否显示1为显示 0为不显示',
  `listorder` int(11) NOT NULL DEFAULT '0' COMMENT '排序值  倒叙',
  `gc_image` char(255) DEFAULT NULL COMMENT '分类logo',
  `add_admin_id` int(11) NOT NULL DEFAULT '0' COMMENT '添加者id',
  `add_time` int(11) NOT NULL DEFAULT '0' COMMENT '添加时间',
  `update_admin_id` int(11) NOT NULL DEFAULT '0' COMMENT '最近一次修改人的时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '最近一次修改时间',
  `desc` char(255) NOT NULL DEFAULT '' COMMENT '分类描述',
  `update_mark` varchar(255) DEFAULT NULL COMMENT '被更新备注',
  PRIMARY KEY (`gc_id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

/*Data for the table `pre_goods_category` */

insert  into `pre_goods_category`(`gc_id`,`gc_name`,`gc_parent_id`,`gc_level`,`is_leaf`,`is_show`,`listorder`,`gc_image`,`add_admin_id`,`add_time`,`update_admin_id`,`update_time`,`desc`,`update_mark`) values (1,'居家',0,1,0,1,99,'',1,1473219864,1,1473219933,'回家，放松身心','下面增加子分类被更改'),(2,'家居',1,2,1,1,98,'Common/2016-09-07/57cf8d5ba214b.png',1,1473219933,0,0,'进口好材料，温柔托住你的疲惫',NULL),(3,'毛巾',1,2,1,1,97,'Common/2016-09-07/57cf8d922f2bc.png',1,1473219988,0,0,'出口日本品质标准，早晨的第一个清爽体验',NULL),(4,'收纳',1,2,1,1,96,'Common/2016-09-07/57cf8dbb948ea.png',1,1473220029,0,0,'抗菌防霉，便利拆卸，小空间的大智慧',NULL),(5,'地毯',1,2,1,1,95,'Common/2016-09-07/57cf8e0e5f9ab.png',1,1473220111,0,0,'让自然界中的灵感，走进居室生活',NULL);

/*Table structure for table `pre_goods_common` */

DROP TABLE IF EXISTS `pre_goods_common`;

CREATE TABLE `pre_goods_common` (
  `goods_common_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'spu  id',
  `goods_name` char(255) NOT NULL,
  `goods_price` float(10,2) NOT NULL DEFAULT '0.00' COMMENT '商品价格',
  `goods_jingle` char(255) NOT NULL DEFAULT '',
  `gc_id` int(11) NOT NULL COMMENT 'id',
  `gc_id_1` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `gc_id_2` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `gc_id_3` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `goods_detail` text NOT NULL,
  `add_time` int(11) NOT NULL DEFAULT '0',
  `update_time` int(11) NOT NULL DEFAULT '0',
  `goods_state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '  0  1    3    4 ',
  `goods_image` char(255) DEFAULT NULL COMMENT ' spu',
  `goods_list` varchar(1000) NOT NULL DEFAULT '',
  `spec` varchar(1000) DEFAULT NULL,
  `freight_type` enum('fixed','num','weight','volume') NOT NULL DEFAULT 'fixed' COMMENT '运费类型 固定运费 按件数 按重量 按体积',
  `freight` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '商品运费 起步运费',
  `freight_step_num` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '运费 步长  ',
  `freight_step_fee` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '运费每步长增加额度',
  `goods_weight` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '商品重量单位kg',
  `goods_volume` float(5,2) NOT NULL DEFAULT '0.00' COMMENT '商品体积单位立方米',
  `sum_type` tinyint(1) NOT NULL DEFAULT '1' COMMENT '订单运费计算方式 1 累加 2 只计最大',
  `view_number` int(11) NOT NULL DEFAULT '0' COMMENT '浏览量',
  PRIMARY KEY (`goods_common_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `pre_goods_common` */

insert  into `pre_goods_common`(`goods_common_id`,`goods_name`,`goods_price`,`goods_jingle`,`gc_id`,`gc_id_1`,`gc_id_2`,`gc_id_3`,`goods_detail`,`add_time`,`update_time`,`goods_state`,`goods_image`,`goods_list`,`spec`,`freight_type`,`freight`,`freight_step_num`,`freight_step_fee`,`goods_weight`,`goods_volume`,`sum_type`,`view_number`) values (1,'典雅美式全棉刺绣靠枕','59.00','典雅毛线绣，精致工艺',2,1,2,0,'&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cf90cd36299.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cf90cd43c7e.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cf90cd65cda.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cf90cd67e16.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cf90cd743dc.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;br/&gt;&lt;/p&gt;',1473220825,1473227554,1,'Common/2016-09-07/57cf9099a2a39.png','','a:1:{i:3;a:4:{i:0;s:1:\"4\";i:1;s:1:\"5\";i:2;s:1:\"6\";i:3;s:1:\"7\";}}','fixed','5.00','0.00','0.00','0.00','0.00',1,6),(2,'全棉进口埃及长绒棉浴巾','99.00','加大加厚埃及棉',3,1,3,0,'&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfaba76bc1c.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfaba772463.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfaba774c3f.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfaba78a31b.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfaba79c7fb.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfaba7aa4ba.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfaba7d01d6.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;br/&gt;&lt;/p&gt;',1473227692,1473227818,1,'Common/2016-09-07/57cfab7d15902.png','','a:1:{i:1;a:3:{i:0;s:1:\"8\";i:1;s:1:\"9\";i:2;s:2:\"10\";}}','fixed','2.00','0.00','0.00','0.00','0.00',1,0),(3,'居家棉麻涤内衣收纳盒','45.00','生活，从规整身边的小物开始',4,1,4,0,'&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfacac315b2.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfacaca4dff.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfacacace4d.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfacace979f.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfacad5cb8b.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;br/&gt;&lt;/p&gt;',1473227955,1473228011,1,'Common/2016-09-07/57cfac800417c.png','','a:1:{i:3;a:1:{i:0;s:2:\"11\";}}','fixed','0.00','0.00','0.00','0.00','0.00',1,0),(4,'羊毛圈绒枪刺地毯','1269.00','印度进口，手工枪刺，简约百搭',5,1,5,0,'&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfc25a1de3b.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfc25a35c10.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfc25a69aef.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfc25a86f47.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfc25acfcbe.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;http://shopdz.shopdz.cn/data/Attach/Common/2016-09-07/57cfc25ae7090.jpg\\&quot; style=\\&quot;\\&quot;/&gt;&lt;/p&gt;&lt;p&gt;&lt;br/&gt;&lt;/p&gt;',1473233514,1473233672,1,'Common/2016-09-07/57cfc22bb3eee.png','','a:1:{i:2;a:1:{i:0;s:2:\"12\";}}','fixed','10.00','0.00','0.00','0.00','0.00',1,0);

/*Table structure for table `pre_goods_images` */

DROP TABLE IF EXISTS `pre_goods_images`;

CREATE TABLE `pre_goods_images` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `goods_common_id` int(11) NOT NULL DEFAULT '0' COMMENT 'spu id',
  `image_url` varchar(255) NOT NULL DEFAULT '',
  `is_default` tinyint(1) NOT NULL DEFAULT '0',
  `listorder` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8;

/*Data for the table `pre_goods_images` */

insert  into `pre_goods_images`(`id`,`goods_common_id`,`image_url`,`is_default`,`listorder`) values (25,1,'Common/2016-09-07/57cf90a8b1ecb.jpg',0,0),(24,1,'Common/2016-09-07/57cf90ad60b47.jpg',0,0),(23,1,'Common/2016-09-07/57cf909f0eea0.jpg',0,0),(22,1,'Common/2016-09-07/57cf90a2a2ba2.jpg',0,0),(21,1,'Common/2016-09-07/57cf9099a2a39.png',1,0),(26,2,'Common/2016-09-07/57cfab7d15902.png',1,0),(27,2,'Common/2016-09-07/57cfab834bc8c.jpg',0,0),(28,2,'Common/2016-09-07/57cfab876a3e3.jpg',0,0),(29,2,'Common/2016-09-07/57cfab8aaa9ae.jpg',0,0),(30,2,'Common/2016-09-07/57cfab8f50feb.jpg',0,0),(31,3,'Common/2016-09-07/57cfac800417c.png',1,0),(32,3,'Common/2016-09-07/57cfac86dc0d0.jpg',0,0),(33,3,'Common/2016-09-07/57cfac89441ba.jpg',0,0),(34,3,'Common/2016-09-07/57cfac8c67f3b.jpg',0,0),(35,3,'Common/2016-09-07/57cfac9452039.jpg',0,0),(44,4,'Common/2016-09-07/57cfc23a8f388.jpg',0,0),(43,4,'Common/2016-09-07/57cfc23749af0.jpg',0,0),(42,4,'Common/2016-09-07/57cfc2335235c.jpg',0,0),(41,4,'Common/2016-09-07/57cfc22bb3eee.png',1,0),(45,4,'Common/2016-09-07/57cfc23ec6f45.jpg',0,0);

/*Table structure for table `pre_goods_param` */

DROP TABLE IF EXISTS `pre_goods_param`;

CREATE TABLE `pre_goods_param` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键自增id',
  `goods_common_id` int(111) NOT NULL DEFAULT '0' COMMENT '商品spuid',
  `param_name` varchar(50) NOT NULL DEFAULT '' COMMENT '参数名',
  `param_value` varchar(150) NOT NULL DEFAULT '' COMMENT '参数值',
  `listorder` int(11) NOT NULL DEFAULT '0' COMMENT '排序值',
  PRIMARY KEY (`id`),
  UNIQUE KEY `goods_common_id` (`goods_common_id`,`param_name`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

/*Data for the table `pre_goods_param` */

insert  into `pre_goods_param`(`id`,`goods_common_id`,`param_name`,`param_value`,`listorder`) values (1,1,'尺寸','45cm*45cm',99),(2,1,'面料成份','100%全棉',98),(3,1,'内芯面料','100%全棉',97),(4,1,'填充物','100%聚酯纤维',96),(5,1,'重量','470g（内芯）',95),(6,2,'尺寸','78*150cm',99),(7,2,'重量','700g',98),(8,2,'材质','100%棉',97),(9,3,'面料','棉26%麻16%涤纶58%',99),(10,3,'产地','中国福建',98),(11,4,'顶面材料','蔺草',99),(12,4,'内芯填充','海绵',98),(13,4,'底面材料','无纺布',97),(14,4,'边带材料','100%棉',96);

/*Table structure for table `pre_goods_spec` */

DROP TABLE IF EXISTS `pre_goods_spec`;

CREATE TABLE `pre_goods_spec` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '记录id',
  `goods_common_id` int(11) NOT NULL DEFAULT '0' COMMENT 'spu  id',
  `spec_id` int(11) NOT NULL DEFAULT '0' COMMENT '规格id',
  `spec_value_id` int(11) NOT NULL DEFAULT '0' COMMENT '规格值id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `pre_goods_spec` */

insert  into `pre_goods_spec`(`id`,`goods_common_id`,`spec_id`,`spec_value_id`) values (1,1,3,4),(2,1,3,5),(3,1,3,6),(4,1,3,7),(5,2,1,8),(6,2,1,9),(7,2,1,10),(8,3,3,11),(9,4,2,12);

/*Table structure for table `pre_member` */

DROP TABLE IF EXISTS `pre_member`;
CREATE TABLE `pre_member` (
  `member_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '会员id',
  `member_username` char(150) NOT NULL DEFAULT '' COMMENT '登录账号',
  `member_mobile` BIGINT(20) UNSIGNED NOT NULL DEFAULT '0' COMMENT '手机号',
  `member_truename` char(150) NOT NULL DEFAULT '' COMMENT '真实姓名',
  `member_avatar` char(255) NOT NULL DEFAULT '' COMMENT '会员头像',
  `member_sex` tinyint(1) NOT NULL DEFAULT 0 COMMENT '会员性别',
  `member_birthday` date NOT NULL DEFAULT '0000-00-00' COMMENT '生日',
  `member_passwd` varchar(32) DEFAULT '' COMMENT '会员密码',
  `salt` char(32) NOT NULL DEFAULT '' COMMENT '密码加密串',
  `member_paypwd` char(32) NOT NULL DEFAULT '' COMMENT '支付密码',
  `member_email` char(255) NOT NULL DEFAULT '' COMMENT '会员邮箱',
  `member_email_bind` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0未绑定1已绑定',
  `member_mobile_bind` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0未绑定1已绑定',
  `member_login_num` int(11) NOT NULL DEFAULT 1 COMMENT '登录次数',
  `member_time` char(10) NOT NULL DEFAULT ''  COMMENT '会员注册时间',
  `member_login_time` char(10) NOT NULL DEFAULT ''  COMMENT '当前登录时间',
  `member_old_login_time` char(10) NOT NULL DEFAULT '' COMMENT '上次登录时间',
  `member_login_ip` char(20) NOT NULL DEFAULT '' COMMENT '当前登录ip',
  `member_old_login_ip` char(20) NOT NULL DEFAULT '' COMMENT '上次登录ip',
  `weixin_openid` char(255) NOT NULL DEFAULT '' COMMENT '微信用户统一标识',
  `weixin_info` char(255) NOT NULL DEFAULT '' COMMENT '微信用户相关信息',
  `member_points` int(11) NOT NULL DEFAULT '0' COMMENT '会员积分',
  `member_state` tinyint(1) NOT NULL DEFAULT '1' COMMENT '会员的开启状态 1为开启 0为关闭',
  `fromid` int(11) NOT NULL DEFAULT 0 COMMENT '分享来源',
  PRIMARY KEY (`member_id`),
  UNIQUE KEY `member_id` (`member_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='会员表';
/*Data for the table `pre_member` */

/*Table structure for table `pre_member_msg_tpl` */

DROP TABLE IF EXISTS `pre_member_msg_tpl`;

CREATE TABLE `pre_member_msg_tpl` (
  `mmt_code` char(150) NOT NULL COMMENT '用户消息模板编号',
  `mmt_name` char(150) NOT NULL COMMENT '模板名称',
  `mmt_message_switch` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '站内信接收开关',
  `mmt_message_content` char(255) NOT NULL  DEFAULT '' COMMENT '站内信消息内容',
  `mmt_short_switch` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '短信接收开关',
  `mmt_short_content` char(255) NOT NULL  DEFAULT ''  COMMENT '短信接收内容',
  `mmt_wx_switch` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '微信接收开关',
  `mmt_wx_content` text NOT NULL COMMENT '微信内容',
  PRIMARY KEY (`mmt_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_member_msg_tpl` */

/*Table structure for table `pre_order_common` */

DROP TABLE IF EXISTS `pre_order_common`;

CREATE TABLE `pre_order_common` (
  `order_id` int(11) NOT NULL COMMENT '订单索引id',
  `shipping_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '配送时间',
  `shipping_express_id` tinyint(1) NOT NULL DEFAULT '0' COMMENT '配送公司ID',
  `is_subscribe` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否订阅物流信息',
  `evaluation_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '评价时间',
  `order_message` char(255) DEFAULT NULL COMMENT '订单留言',
  `order_pointscount` int(11) NOT NULL DEFAULT '0' COMMENT '订单赠送积分',
  `voucher_price` int(11) DEFAULT NULL COMMENT '代金券面额',
  `voucher_code` char(50) DEFAULT NULL COMMENT '代金券编码',
  `deliver_explain` text COMMENT '发货备注',
  `daddress_id` mediumint(9) NOT NULL DEFAULT '0' COMMENT '发货地址ID',
  `reciver_name` char(150) NOT NULL COMMENT '收货人姓名',
  `reciver_info` varchar(500) NOT NULL COMMENT '收货人其它信息',
  `reciver_province_id` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT '?”?è′§?oo????o§ID',
  `reciver_city_id` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT '收货人省级ID',
  `invoice_info` char(10) DEFAULT '' COMMENT '收货人市级ID',
  `promotion_info` char(10) DEFAULT '' COMMENT '发票信息',
  `dlyo_pickup_code` char(255) DEFAULT NULL COMMENT '提货码',
  `promotion_total` float(10,2) DEFAULT '0.00' COMMENT '订单总优惠金额（代金券，满减，平台红包）',
  `discount` tinyint(4) DEFAULT '0' COMMENT '会员折扣x%',
  PRIMARY KEY (`order_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_order_common` */

/*Table structure for table `pre_order_goods` */

DROP TABLE IF EXISTS `pre_order_goods`;

CREATE TABLE `pre_order_goods` (
  `rec_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `order_id` int(11) NOT NULL COMMENT 'id',
  `goods_id` int(11) NOT NULL COMMENT 'id',
  `goods_name` char(50) NOT NULL,
  `goods_price` float(10,2) NOT NULL,
  `goods_num` smallint(5) unsigned NOT NULL DEFAULT '1',
  `goods_image` char(255) NOT NULL DEFAULT '',
  `goods_pay_price` float(10,2) unsigned NOT NULL DEFAULT '0',
  `store_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'ID',
  `buyer_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'ID',
  `goods_type` char(1) NOT NULL DEFAULT '1' COMMENT '1234589',
  `promotions_id` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT 'IDID/ID/IDgoods_type',
  `commis_rate` smallint(5) unsigned NOT NULL DEFAULT '0',
  `gc_id` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT 'ID',
  `goods_spec` varchar(255) DEFAULT NULL,
  `goods_contractid` varchar(100) DEFAULT NULL COMMENT 'id',
  `evaluate_state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0 1 2 ',
  `goods_returnnum` int(10) unsigned DEFAULT '0' COMMENT '退货数量',
  `goods_common_id` int(11) NOT NULL COMMENT 'spu id',
  `rg_id` int(11) unsigned DEFAULT '0' COMMENT '退货时的退货id号',
  `add_time` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`rec_id`),
  KEY `order_id` (`order_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_order_goods` */

/*Table structure for table `pre_order_log` */

DROP TABLE IF EXISTS `pre_order_log`;

CREATE TABLE `pre_order_log` (
  `log_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `id` char(255) NOT NULL DEFAULT '' COMMENT '订单id或者其他id',
  `idtype` varchar(50) NOT NULL COMMENT 'id类型',
  `operator_type` enum('buyer','seller','system','') NOT NULL DEFAULT '' COMMENT '操作人类型',
  `operator_id` int(11) NOT NULL DEFAULT '0' COMMENT '操作人id',
  `operator_name` varchar(50) NOT NULL DEFAULT '' COMMENT '操作人姓名',
  `log_content` varchar(1000) NOT NULL DEFAULT '' COMMENT '日志类容',
  `dateline` int(11) NOT NULL DEFAULT '0' COMMENT '添加时间',
  PRIMARY KEY (`log_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_order_log` */

/*Table structure for table `pre_orders` */

DROP TABLE IF EXISTS `pre_orders`;

CREATE TABLE `pre_orders` (
  `order_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `order_sn` bigint(20) unsigned NOT NULL,
  `pay_sn` bigint(20) unsigned NOT NULL,
  `buyer_id` int(11) unsigned NOT NULL COMMENT 'id',
  `buyer_name` char(150) NOT NULL DEFAULT '',
  `buyer_email` char(255) NOT NULL DEFAULT '',
  `buyer_phone` bigint(20) unsigned NOT NULL DEFAULT '0',
  `add_time` int(10) unsigned NOT NULL DEFAULT '0',
  `payment_code` char(10) NOT NULL DEFAULT '',
  `payment_time` int(10) unsigned DEFAULT '0' COMMENT '()',
  `finnshed_time` int(10) unsigned NOT NULL DEFAULT '0',
  `goods_amount` decimal(10,2) unsigned NOT NULL DEFAULT '0.00',
  `order_amount` decimal(10,2) unsigned NOT NULL DEFAULT '0.00',
  `rcb_amount` decimal(10,2) unsigned NOT NULL DEFAULT '0.00',
  `pd_amount` decimal(10,2) unsigned NOT NULL DEFAULT '0.00',
  `shipping_fee` decimal(10,2) unsigned DEFAULT '0.00',
  `evaluation_state` tinyint(4) DEFAULT '0' COMMENT ' 012',
  `evaluation_again_state` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT ' 012',
  `order_state` tinyint(4) NOT NULL DEFAULT '10' COMMENT '0()10():;20:;30:;40:;',
  `refund_state` tinyint(4) unsigned DEFAULT '0' COMMENT ':0,1,2',
  `lock_state` tinyint(4) unsigned DEFAULT '0' COMMENT ':0,0,0',
  `delete_state` tinyint(4) NOT NULL DEFAULT '0' COMMENT '012',
  `refund_amount` decimal(10,2) DEFAULT '0.00',
  `delay_time` int(10) unsigned DEFAULT '0' COMMENT ',0',
  `order_from` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1WEB2mobile',
  `shipping_code` varchar(50) DEFAULT '',
  `order_type` tinyint(4) DEFAULT '1' COMMENT '1(),2,3',
  `chain_id` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'ID',
  `chain_code` mediumint(6) unsigned NOT NULL DEFAULT '0',
  `rpt_amount` decimal(10,2) unsigned DEFAULT '0.00',
  `trade_no` varchar(50) DEFAULT NULL,
  `return_state` tinyint(1) unsigned DEFAULT '0' COMMENT '退货状态:0是无退货,1是有退货',
  `payment_starttime` int(10) unsigned DEFAULT '0' COMMENT '支付发起时间',
  `refund_sn` BIGINT(20) UNSIGNED NOT NULL DEFAULT 0 COMMENT '最后一个退款单号',
  PRIMARY KEY (`order_id`),
  UNIQUE KEY `order_sn` (`order_sn`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_orders` */

/*Table structure for table `pre_payment` */

DROP TABLE IF EXISTS `pre_payment`;

CREATE TABLE `pre_payment` (
  `payment_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '支付id',
  `payment_code` char(16) NOT NULL DEFAULT '' COMMENT '支付code',
  `payment_name` char(16) NOT NULL DEFAULT '' COMMENT '支付名称',
  `payment_config` text NOT NULL DEFAULT '',
  `payment_state` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '状态',
  PRIMARY KEY (`payment_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_payment` */

/*Table structure for table `pre_points_log` */

DROP TABLE IF EXISTS `pre_points_log`;

CREATE TABLE `pre_points_log` (
  `pl_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '日志ID',
  `pl_memberid` int(11) NOT NULL COMMENT '会员ID',
  `pl_membername` char(150) NOT NULL DEFAULT '' COMMENT '会员名称',
  `pl_adminid` int(11) DEFAULT NULL COMMENT '管理员ID',
  `pl_adminname` char(150) NOT NULL DEFAULT '' COMMENT '管理员名称',
  `pl_points` int(11) NOT NULL DEFAULT '0' COMMENT '积分数负数表示扣除',
  `pl_addtime` int(11) NOT NULL DEFAULT '0' COMMENT '添加时间',
  `pl_desc` char(255) NOT NULL DEFAULT '' COMMENT '操作描述',
  `pl_stage` char(255) NOT NULL DEFAULT '' COMMENT '操作行为阶段',
  PRIMARY KEY (`pl_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_points_log` */

/*Table structure for table `pre_rbac_access` */

DROP TABLE IF EXISTS `pre_rbac_access`;

CREATE TABLE `pre_rbac_access` (
  `role_id` int(11) unsigned NOT NULL,
  `node_id` int(11) unsigned NOT NULL,
  KEY `role_id` (`role_id`) USING BTREE,
  KEY `node_id` (`node_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_rbac_access` */

/*Table structure for table `pre_rbac_admin_role` */

DROP TABLE IF EXISTS `pre_rbac_admin_role`;

CREATE TABLE `pre_rbac_admin_role` (
  `admin_id` int(11) unsigned NOT NULL,
  `role_id` int(11) unsigned NOT NULL,
  KEY `admin_id` (`admin_id`) USING BTREE,
  KEY `role_id` (`role_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_rbac_admin_role` */

/*Table structure for table `pre_rbac_node` */

DROP TABLE IF EXISTS `pre_rbac_node`;

CREATE TABLE `pre_rbac_node` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(32) NOT NULL DEFAULT '',
  `name_cn` varchar(16) NOT NULL DEFAULT '',
  `level` tinyint(2) NOT NULL DEFAULT '0',
  `pid` int(11) NOT NULL DEFAULT '0',
  `controller` char(100) NOT NULL DEFAULT '',
  `asmenu` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否是导航',
  `sort` tinyint(1) NOT NULL DEFAULT '127' COMMENT '排序',
  `classname` char(255) NOT NULL DEFAULT '' COMMENT '该导航导航对应的图标分类',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=464 DEFAULT CHARSET=utf8;

/*Data for the table `pre_rbac_node` */

insert  into `pre_rbac_node`(`id`,`name`,`name_cn`,`level`,`pid`,`controller`,`asmenu`,`sort`,`classname`) values (244,'category_del','删除分类 ',3,0,'Commodity',0,127,''),(245,'goods_list','商品管理',3,0,'Commodity',1,127,''),(246,'sku_list','sku列表 ',3,0,'Commodity',0,127,''),(247,'spec','商品规格',3,0,'Commodity',1,127,''),(248,'spec_add','添加规格 ',3,0,'Commodity',0,127,''),(249,'spec_edit','编辑规格 ',3,0,'Commodity',0,127,''),(250,'spec_delete','删除规格',3,0,'Commodity',0,127,''),(251,'spec_value','规格值列表',3,0,'Commodity',0,127,''),(252,'spec_value_add_form','添加规格值',3,0,'Commodity',0,127,''),(253,'spec_value_edit','编辑规格值',3,0,'Commodity',0,127,''),(254,'spec_value_delete','删除规格值',3,0,'Commodity',0,127,''),(255,'goods_add_step1','发布商品',3,0,'Commodity',1,127,''),(256,'goods_add_step2','商品添加第二步',3,0,'Commodity',0,127,''),(257,'goods_edit_step2','商品编辑第二步',3,0,'Commodity',0,127,''),(258,'goods_add_step3','商品添加第三步',3,0,'Commodity',0,127,''),(259,'goods_add_step4','商品添加第四步',3,0,'Commodity',0,127,''),(260,'goods_add_step5','商品添加第五步',3,0,'Commodity',0,127,''),(261,'goods_operation','商品操作',3,0,'Commodity',0,127,''),(262,'goods_recycle','加入回收站',3,0,'Commodity',0,127,''),(263,'goods_remove_recycle','移除回收站 ',3,0,'Commodity',0,127,''),(264,'goods_delete','彻底删除商品 ',3,0,'Commodity',0,127,''),(265,'goods_sell','商品上架 ',3,0,'Commodity',0,127,''),(266,'goods_un_sell','商品下架',3,0,'Commodity',0,127,''),(267,'goods_move_class','移动商品分类',3,0,'Commodity',0,127,''),(268,'spec_value_add','ajax商品规格',3,0,'Commodity',0,127,''),(269,'get_spec','获取规格',3,0,'Commodity',0,127,''),(270,'Commodity','商品',1,0,'Commodity',1,3,'sidebar-icon-goods'),(271,'Coupon','促销',1,0,'Coupon',1,7,'sidebar-icon-Promotion'),(272,'lists','优惠券',3,0,'Coupon',1,1,''),(273,'save_rpacket','添加优惠券-保存',3,0,'Coupon',0,127,''),(274,'delete','删除优惠券',3,0,'Coupon',0,127,''),(275,'edit','编辑优惠券',3,0,'Coupon',0,127,''),(276,'save_edit','保存编辑优惠券',3,0,'Coupon',0,127,''),(277,'rep_list','优惠券发放详情',3,0,'Coupon',0,127,''),(279,'Member','会员',1,0,'Member',1,2,'sidebar-icon-user'),(280,'lists','会员管理',3,0,'Member',1,1,''),(281,'add','添加会员',3,0,'Member',0,127,''),(282,'points','会员积分',3,0,'Member',1,2,''),(283,'points_add','添加积分',3,0,'Member',0,127,''),(284,'points_setting','规则设置',3,0,'Member',0,127,''),(285,'addressshow','添加收货地址',3,0,'Member',0,127,''),(286,'member_address','地址列表 ',3,0,'Member',0,127,''),(287,'set_default','设置默认地址',3,0,'Member',0,127,''),(288,'address_del','删除地址',3,0,'Member',0,127,''),(295,'Setting','店铺',1,0,'Setting',1,1,'sidebar-icon-shop'),(296,'base','基本设置',3,0,'Setting',1,127,''),(297,'uplogofile','上传文件',3,0,'Setting',0,127,''),(298,'email','邮件设置',3,0,'Setting',0,127,''),(299,'email_testing','邮箱测试',3,0,'Setting',0,127,''),(300,'message','短信设置',3,0,'Setting',1,127,''),(301,'notes','消息模板',3,0,'Setting',0,127,''),(302,'notes_edit','编辑消息模板',3,0,'Setting',0,127,''),(303,'district','地区设置',3,0,'Setting',1,127,''),(304,'thirdlogin','微信登录',3,0,'Setting',0,127,''),(305,'payment','支付方式',3,0,'Setting',1,127,''),(306,'personnel','首页管理',3,0,'Setting',1,127,''),(308,'advert','广告管理',3,0,'Setting',0,127,''),(309,'System','权限',1,0,'System',1,11,'sidebar-icon-Jurisdiction'),(310,'lists','管理员',3,0,'System',1,127,''),(311,'add','添加管理员',3,0,'System',0,127,''),(312,'del','删除管理员',3,0,'System',0,127,''),(313,'addpermission','添加权限组',3,0,'System',0,127,''),(314,'rolelist','权限组',3,0,'System',1,127,''),(315,'editpermission','编辑权限组',3,0,'System',0,127,''),(316,'delrole','删除权限组',3,0,'System',0,127,''),(317,'log','操作日志',3,0,'System',1,127,''),(318,'Presales','售后',1,0,'Presales',1,5,'sidebar-icon-Customerservice'),(319,'refunds','退款管理',3,0,'Presales',1,127,''),(320,'returns','退货管理',3,0,'Presales',1,127,''),(321,'causes','原因设置',3,0,'Presales',1,127,''),(322,'feedbacks','意见反馈',3,0,'Presales',1,127,''),(323,'add','添加优惠券',3,0,'Coupon',0,127,''),(324,'show','优惠券详情',3,0,'Coupon',0,127,''),(325,'grant','发放优惠券',3,0,'Coupon',0,127,''),(326,'rep_delete','删除用户优惠券',3,0,'Coupon',0,127,''),(327,'member_packet','优惠券明细',3,0,'Coupon',0,127,''),(328,'member_packet_info','用户优惠券详情',3,0,'Coupon',0,127,''),(329,'Order','订单',1,0,'Order',1,4,'sidebar-icon-order'),(330,'lists','订单列表',3,0,'Order',1,127,''),(331,'detail','订单详情',3,0,'Order',0,127,''),(332,'delorder','删除订单',3,0,'Order',0,127,''),(333,'productlist','发货管理',3,0,'Order',1,127,''),(334,'evaluate','评价管理',3,0,'Presales',1,127,''),(336,'clean_cache','清理缓存',3,0,'Setting',1,127,''),(338,'json_area','json_area',3,0,'District',0,127,''),(341,'add','add',3,0,'Adv',0,127,''),(342,'deladv','deladv',3,0,'Adv',0,127,''),(343,'edit','edit',3,0,'Adv',0,127,''),(344,'itemadd','itemadd',3,0,'Special',0,127,''),(345,'itemedit','itemedit',3,0,'Special',0,127,''),(346,'imgedit','imgedit',3,0,'Special',0,127,''),(347,'itemlist','itemlist',3,0,'Special',0,127,''),(348,'itemsort','itemsort',3,0,'Special',0,127,''),(349,'itemstatus','itemstatus',3,0,'Special',0,127,''),(350,'itemdel','itemdel',3,0,'Special',0,127,''),(351,'itemsave','itemsave',3,0,'Special',0,127,''),(352,'itemtypeadd','itemtypeadd',3,0,'Special',0,127,''),(353,'saveadvlist','saveadvlist',3,0,'Special',0,127,''),(354,'saveadvhtml','saveadvhtml',3,0,'Special',0,127,''),(355,'saveadvnav','saveadvnav',3,0,'Special',0,127,''),(356,'savegoodslist','savegoodslist',3,0,'Special',0,127,''),(357,'isitemexist','isitemexist',3,0,'Special',0,127,''),(358,'html','html',3,0,'Special',0,127,''),(359,'showindex','showindex',3,0,'Special',0,127,''),(360,'delarea','delarea',3,0,'District',0,127,''),(361,'add','add',3,0,'District',0,127,''),(362,'edit','edit',3,0,'District',0,127,''),(363,'save','save',3,0,'District',0,127,''),(364,'json_area_show','json_area_show',3,0,'District',0,127,''),(366,'smsedit','smsedit',3,0,'Setting',0,127,''),(367,'delevaluate','delevaluate',3,0,'Presales',0,127,''),(368,'editrefund','editrefund',3,0,'Presales',0,127,''),(369,'refunddetail','refunddetail',3,0,'Presales',0,127,''),(370,'editreturn','editreturn',3,0,'Presales',0,127,''),(371,'returndetail','returndetail',3,0,'Presales',0,127,''),(372,'addcauses','addcauses',3,0,'Presales',0,127,''),(373,'delcauses','delcauses',3,0,'Presales',0,127,''),(374,'editfeedback','editfeedback',3,0,'Presales',0,127,''),(375,'feedbackdetail','feedbackdetail',3,0,'Presales',0,127,''),(376,'return_pay','return_pay',3,0,'Presales',0,127,''),(377,'refund_pay','refund_pay',3,0,'Presales',0,127,''),(378,'changeorder','changeorder',3,0,'Order',0,127,''),(379,'setstorage','setstorage',3,0,'Order',0,127,''),(380,'settrade','settrade',3,0,'Order',0,127,''),(390,'Cms','运营',1,0,'Cms',1,8,'sidebar-icon-Operate'),(399,'Wx','微信',1,0,'Wx',1,10,'sidebar-icon-WeChat'),(400,'menutest','菜单测试',3,0,'Wx',0,0,''),(401,'sendmoban','发送模板',3,0,'Wx',0,0,''),(403,'wxloginop','微信登录',3,0,'Wx',1,1,''),(404,'menuop','菜单管理',3,0,'Wx',1,5,''),(405,'keywordsop','关键词',3,0,'Wx',1,6,''),(407,'Statistics','统计',1,0,'Statistics',1,9,'sidebar-icon-Statistics'),(408,'order','订单统计',3,0,'Statistics',1,126,'sidebar-icon-order'),(409,'article_class_list','资讯分类',3,0,'Cms',1,1,''),(410,'article_list','资讯管理',3,0,'Cms',1,2,''),(411,'article_class_add','article_class_ad',3,0,'Cms',0,127,''),(412,'article_class_del','article_class_de',3,0,'Cms',0,127,''),(413,'article_add','article_add',3,0,'Cms',0,127,''),(414,'article_del','article_del',3,0,'Cms',0,127,''),(415,'wxshare','微信分享',3,0,'Wx',1,2,''),(416,'members','会员统计',3,0,'Statistics',1,126,''),(417,'customer','售后统计',3,0,'Statistics',1,126,''),(418,'hotgoods','热卖商品',3,0,'Statistics',1,126,''),(422,'main','店铺概况',3,0,'Setting',1,127,''),(423,'wxrespons','微信回复',3,0,'Wx',1,3,''),(424,'wxtextimg','素材库',3,0,'Wx',0,0,''),(435,'category','商品分类',3,0,'Commodity',1,1,''),(436,'category_add','添加分类',3,0,'Commodity',0,127,''),(437,'category_edit','编辑分类',3,0,'Commodity',0,127,''),(438,'info','密码修改',3,0,'System',1,127,''),(439,'menusend','menusend',3,0,'Wx',0,127,''),(440,'menuedit','menuedit',3,0,'Wx',0,127,''),(441,'delmenu','delmenu',3,0,'Wx',0,127,''),(442,'uplogofile','uplogofile',3,0,'Wx',0,127,''),(443,'bank','银行',3,0,'Cms',0,127,''),(444,'banklist','银行列表',3,0,'Cms',0,127,''),(445,'delbank','删除银行',3,0,'Cms',0,127,''),(446,'spread','提现设置',3,0,'Cms',1,3,''),(447,'reward','推广设置',3,0,'Cms',1,5,''),(448,'presales','奖励明细',3,0,'Cms',0,127,'sidebar-icon-Customerservice'),(449,'withdraw','提现记录',3,0,'Cms',1,4,''),(450,'edit','提现审核',3,0,'Cms',0,127,''),(451,'show','查看审核结果',3,0,'Cms',0,127,''),(452,'key_convert','key_convert',3,0,'Commodity',0,0,''),(453,'getdatadictionary','getdatadictionar',3,0,'Member',0,0,''),(454,'address_list','address_list',3,0,'Member',0,0,''),(455,'companylist','companylist',3,0,'Order',0,0,''),(456,'query_setting','快递设置',3,0,'Order',1,127,''),(457,'expense','运费设置',3,0,'Order',1,127,''),(458,'message','微信通知',3,0,'Wx',1,4,''),(460,'keywordsedit','keywordsedit',3,0,'Wx',0,0,''),(461,'delkeywords','delkeywords',3,0,'Wx',0,0,''),(462,'messageedit','messageedit',3,0,'Wx',0,0,''),(463,'sendmss','sendmss',3,0,'Wx',0,0,''),(464,'reward','推广统计',3,0,'Statistics',1,127,''),(466,'searchgoods','searchgoods',3,0,'Search',0,0,''),(467,'goods_quick_add','快速发布',3,0,'Commodity',1,127,''),(471,'notice','消息通知',3,0,'Member',1,3,''),(472,'template','消息模板',3,0,'Notice',0,0,''),(473,'noticeedit','noticeedit',3,0,'Notice',0,0,''),(474,'send_notice','发送消息',3,0,'Notice',0,0,''),(475,'sendwxcard','发送微信优惠卡券',3,0,'Coupon',0,0,''),(476,'getuploadimg','getuploadimg',3,0,'Coupon',0,0,''),(477,'group','拼团',3,0,'Coupon',0,0,''),(478,'grouplist','拼团列表',3,0,'Coupon',0,0,''),(479,'activelist','活动列表',3,0,'Coupon',0,0,''),(480,'activelist','拼团',3,0,'Coupon',0,2,''),(481,'group','group',3,0,'Group',0,0,''),(482,'activelist','activelist',3,0,'Group',0,0,''),(483,'groplist','groplist',3,0,'Group',0,0,''),(484,'joinlists','joinlists',3,0,'Group',0,0,''),(485,'delgroup','delgroup',3,0,'Group',0,0,''),(486,'otherpay','扫码支付',3,0,'Cms',0,0,''),(487,'otherpay','扫码支付',3,0,'Cms',1,6,''),(488,'gift_list','礼品管理',3,0,'Coupon',0,0,''),(489,'gift_add','礼品添加',3,0,'Coupon',0,0,''),(490,'gift_edit','礼品编辑',3,0,'Coupon',0,0,''),(491,'gift_delete','礼品删除',3,0,'Coupon',0,0,''),(492,'usergetdatelist','数据调用',3,0,'Cms',1,127,''),(498,'imgtext','素材库',3,0,'Wx',1,126,''),(499,'usergetdate','usergetdate',3,0,'Cms',0,0,''),(500,'usergetdateedit','usergetdateedit',3,0,'Cms',0,0,''),(501,'deldata','deldata',3,0,'Cms',0,0,''),(502,'updatecash','updatecash',3,0,'Cms',0,0,''),(503,'uplogofile','uplogofile',3,0,'Cms',0,0,''),(504,'plugins','应用中心',3,0,'Cms',1,0,''),(505,'index','index',3,0,'Plugin',0,0,''),(506,'group_same_key','group_same_key',3,0,'Plugin',0,0,''),(507,'admin','admin',3,0,'Plugin',0,0,''),(508,'install','install',3,0,'Plugin',0,0,''),(509,'order_print','order_print',3,0,'Order',0,0,''),(510,'orderlists','orderlists',3,0,'Export',0,0,''),(511,'withdraw','withdraw',3,0,'Export',0,0,''),(512,'presales','presales',3,0,'Export',0,0,'sidebar-icon-Customerservice'),(513,'goods_edit_step1','商品编辑第一步',3,0,'Commodity',0,127,'');
/*Table structure for table `pre_rbac_role` */

DROP TABLE IF EXISTS `pre_rbac_role`;

CREATE TABLE `pre_rbac_role` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(16) NOT NULL DEFAULT '',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_rbac_role` */

/*Table structure for table `pre_rbac_siblings` */

DROP TABLE IF EXISTS `pre_rbac_siblings`;

CREATE TABLE `pre_rbac_siblings` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `lastid` int(11) unsigned NOT NULL DEFAULT '0',
  `nextids` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`),
  UNIQUE KEY `lastid` (`lastid`)
) ENGINE=InnoDB AUTO_INCREMENT=43 DEFAULT CHARSET=utf8;

insert  into `pre_rbac_siblings`(`id`,`lastid`,`nextids`) values (1,255,'256,257,258,259,260,269'),(2,241,'242,243,244'),(3,245,'246,261,262,263,264,265,266,267,513'),(4,247,'248,249,250,251,252,253,254'),(6,272,'324,326,328,275,274,325,323'),(7,282,'284,283'),(8,280,'281,285,286,287,288,327,338,454'),(9,291,'292,294,338'),(15,296,'341,342,343'),(16,306,'344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,466'),(17,303,'338,360,361,362,363,364'),(18,301,'302'),(19,300,'366'),(20,314,'313,315,316'),(21,310,'311,312,313'),(22,334,'367'),(23,322,'374,375'),(24,372,'372,373'),(25,321,'372,373'),(26,320,'370,371,376,377'),(27,319,'377,368,369'),(28,333,'379,380,509'),(29,330,'331,378,332,509,510'),(30,317,'391'),(32,409,'411,412'),(33,410,'413,414'),(34,423,'1'),(35,424,'2'),(36,449,'451,450,511'),(37,447,'448'),(38,435,'244,436,437'),(39,456,'455'),(40,404,'440,441,439'),(41,458,'462'),(42,405,'460,461'),(43,471,'472,473,474'),(44,480,'481,482,483,484,485'),(45,504,'505,506,507,508'),(46,492,'499,500,501,502,503'),(47,448,'512');

/*Table structure for table `pre_redpacket` */

DROP TABLE IF EXISTS `pre_redpacket`;
CREATE TABLE `pre_redpacket` (
  `rpacket_id` int(11) NOT NULL AUTO_INCREMENT,
  `rpacket_code` char(255) NOT NULL DEFAULT '',
  `rpacket_t_id` int(11) NOT NULL DEFAULT '0',
  `rpacket_title` char(255) NOT NULL DEFAULT '',
  `rpacket_desc` char(255) NOT NULL DEFAULT '',
  `rpacket_start_date` int(11) NOT NULL DEFAULT '0',
  `rpacket_end_date` int(11) NOT NULL DEFAULT '0',
  `rpacket_price` int(11) NOT NULL DEFAULT '0',
  `rpacket_limit` int(11) NOT NULL DEFAULT '0',
  `rpacket_state` tinyint(4) NOT NULL COMMENT '(1-,2-,3-)',
  `rpacket_active_date` int(11) NOT NULL DEFAULT '0',
  `rpacket_owner_id` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `rpacket_owner_name` char(150) NOT NULL DEFAULT '',
  `rpacket_order_id` bigint(20) NOT NULL DEFAULT '0',
  `rpacket_pwd` char(100) NOT NULL DEFAULT '',
  `rpacket_pwd2` char(255) NOT NULL DEFAULT '' COMMENT '2',
  `rpacket_customimg` char(255) NOT NULL DEFAULT '',
  `rpacket_used_date` int(11) NOT NULL DEFAULT '0',
  `rpacket_sms_type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否发送优惠券过期提醒短信 0：未发送  1： 已发送',
  `rpacket_color` char(50) NOT NULL DEFAULT '' COMMENT '优惠券颜色',
  `rpacket_t_wx_card_id` char(255) NOT NULL DEFAULT '' COMMENT '微信卡券id',
  `rpacket_openid` char(255) NOT NULL DEFAULT '' COMMENT '微信openid',
  PRIMARY KEY (`rpacket_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8;

/*Data for the table `pre_redpacket` */

/*Table structure for table `pre_redpacket_template` */

DROP TABLE IF EXISTS `pre_redpacket_template`;

CREATE TABLE `pre_redpacket_template` (
  `rpacket_t_id` int(11) NOT NULL AUTO_INCREMENT,
  `rpacket_t_title` char(150) NOT NULL   DEFAULT '',
  `rpacket_t_desc` char(255) NOT NULL DEFAULT '',
  `rpacket_t_start_date` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_end_date` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_price` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_limit` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_adminid` int(11) NOT NULL DEFAULT '0' COMMENT 'ID',
  `rpacket_t_state` tinyint(4) NOT NULL DEFAULT '0' COMMENT '(1-,2-)',
  `rpacket_t_total` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_giveout` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_used` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_updatetime` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_points` int(11) NOT NULL DEFAULT '0',
  `rpacket_t_eachlimit` int(11) NOT NULL DEFAULT '1',
  `rpacket_t_customimg` char(255) NOT NULL DEFAULT '',
  `rpacket_t_recommend` tinyint(1) NOT NULL DEFAULT '0' COMMENT ' 0 1',
  `rpacket_t_gettype` tinyint(1) NOT NULL DEFAULT '1' COMMENT ' 1 2 3',
  `rpacket_t_isbuild` tinyint(1) NOT NULL DEFAULT '0' COMMENT ' 0 1',
  `rpacket_t_mgradelimit` tinyint(2) NOT NULL DEFAULT '0',
  `rpacket_t_save_time` int(10) NOT NULL  DEFAULT '0',
  `rpacket_t_share` tinyint(1) NOT NULL DEFAULT '0' COMMENT '推广开关   0：关闭   1：开启',
  `rpacket_t_wx` tinyint(1) NOT NULL DEFAULT '0' COMMENT '微信卡券开关 0：关闭  1：开启',
  `rpacket_t_color` char(50) NOT NULL DEFAULT 'Color010' COMMENT '优惠券颜色',
  `rpacket_t_wx_card_id` char(255)  NULL COMMENT '微信卡卷id',
  PRIMARY KEY (`rpacket_t_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8;

/*Data for the table `pre_redpacket_template` */

/*Table structure for table `pre_refund` */

DROP TABLE IF EXISTS `pre_refund`;

CREATE TABLE `pre_refund` (
  `refund_id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `order_id` int(11) unsigned NOT NULL COMMENT '订单号',
  `order_sn` bigint(20) unsigned NOT NULL,
  `member_uid` int(11) unsigned NOT NULL COMMENT '用户ID',
  `member_name` char(150) NOT NULL   DEFAULT '' COMMENT '用户名',
  `user_id` int(11) unsigned NOT NULL   DEFAULT '0' COMMENT '管理员ID',
  `user_name` char(255) NOT NULL   DEFAULT '0' COMMENT '管理员名',
  `causes_id` int(11) unsigned NOT NULL   DEFAULT '0' COMMENT '退货原因ID',
  `causes` varchar(500) NOT NULL   DEFAULT '' COMMENT '退款说明',
  `dateline` int(10) unsigned NOT NULL  DEFAULT '0' COMMENT '申请退款时间',
  `status` enum('1','2','3','4','5','6') DEFAULT '1' COMMENT '处理状态 1-待处理 2-退款中 3-已退款 4-拒绝退款 5-待支付平台处理  6-支付平台处理失败',
  `refund_images` char(255) NOT NULL DEFAULT '' COMMENT '退款图片',
  `remark` char(255) NOT NULL DEFAULT '' COMMENT '处理备注',
  `enddate` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '处理时间',
  `refund_amount` float(10,2) NOT NULL COMMENT '退款金额',
  `refund_sn` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '退款编号',
  `notify_mark` char(200) NOT NULL DEFAULT '' COMMENT '退款之后第三方通知备注',
  PRIMARY KEY (`refund_id`),
  UNIQUE KEY `refund_sn` (`refund_sn`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_refund` */

/*Table structure for table `pre_returngoods` */

DROP TABLE IF EXISTS `pre_returngoods`;

CREATE TABLE `pre_returngoods` (
  `rg_id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `rec_id` int(11) unsigned NOT NULL COMMENT '商品列表id',
  `goods_id` int(11) unsigned NOT NULL COMMENT '商品id',
  `order_id` int(11) unsigned NOT NULL COMMENT '订单号',
  `order_sn` bigint(20) unsigned NOT NULL,
  `member_uid` int(11) unsigned NOT NULL COMMENT '用户ID',
  `member_name` char(150) NOT NULL DEFAULT '' COMMENT '用户名',
  `user_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '管理员ID',
  `user_name` char(150) NOT NULL DEFAULT '' COMMENT '管理员名',
  `causes_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '退货原因ID',
  `causes` char(255) NOT NULL DEFAULT '' COMMENT '退款说明',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '申请退款时间',
  `status` enum('1','2','3','4','5','6') DEFAULT '1' COMMENT '处理状态 1-待处理 2-退款中 3-已退款 4-拒绝退款 5-待支付平台处理  6-支付平台处理失败',
  `return_images` varchar(500) NOT NULL DEFAULT '' COMMENT '退款图片',
  `remark` char(255) NOT NULL DEFAULT '' COMMENT '处理备注',
  `enddate` int(10) unsigned DEFAULT NULL COMMENT '处理时间',
  `return_amount` float(10,2) NOT NULL DEFAULT '0' COMMENT '退款金额',
  `return_goodsnum` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '退货数量',
  `shipping_express_id` tinyint(1) NOT NULL DEFAULT '0' COMMENT '配送公司ID',
  `shipping_code` char(150) DEFAULT '' COMMENT '物流单号',
  `return_sn` bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '退货编号',
  `notify_mark` varchar(200) NOT NULL DEFAULT '0' COMMENT '退款之后第三方通知备注',
  PRIMARY KEY (`rg_id`),
  UNIQUE KEY `return_sn` (`return_sn`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_returngoods` */

/*Table structure for table `pre_send_msg` */

DROP TABLE IF EXISTS `pre_send_msg`;
CREATE TABLE `pre_send_msg` (
  `send_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `send_phone` char(11) NOT NULL DEFAULT '' COMMENT '手机号',
  `send_ip` char(20) NOT NULL DEFAULT '' COMMENT '请求IP',
  `send_type` char(50) NOT NULL DEFAULT '' COMMENT '短信类型',
  `send_text` char(255) NOT NULL DEFAULT '' COMMENT '短信内容',
  `send_wxtext` char(255) DEFAULT NULL DEFAULT '',
  `send_webtext` char(255) DEFAULT NULL DEFAULT '',
  `send_data` varchar(255) NOT NULL DEFAULT '' COMMENT '短信数据序列化存储',
  `add_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '添加时间',
  `member_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '会员ID',
  `is_send` tinyint(2) NOT NULL DEFAULT '0' COMMENT '是否已发送 1（已发送） 0（未发送）2（待二次发送）3（发送失败） 4（订单付款未发送） 5（订单已付款）',
  `send_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发送时间',
 
  PRIMARY KEY (`send_id`)
)
/*Data for the table `pre_send_msg` */

/*Table structure for table `pre_setting` */

DROP TABLE IF EXISTS `pre_setting`;

CREATE TABLE `pre_setting` (
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '配置项名称',
  `value` text NOT NULL DEFAULT '' COMMENT '配置项，序列化',
  PRIMARY KEY (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_setting` */

insert  into `pre_setting`(`name`,`value`) values ('access_token',''),('access_token_time',''),('sms_account',''),('sms_password',''),('sms_login_password',''),('article_title','注册协议'),('article_content','注册协议正文'),('close_reason',''),('count_code','发呆发'),('email_addr','大的'),('email_host',''),('email_id',''),('email_pass',''),('email_port','25'),('email_secure','0'),('enterprise_address',''),('enterprise_contact',''),('enterprise_name','ShopDZ商城'),('expense','a:2:{s:5:\"price\";s:4:\"1000\";s:4:\"type\";s:1:\"0\";}'),('express_query_id',''),('express_query_key',''),('footer_info','ShopDZ INC.'),('form_submit','submit'),('messagesetting','a:13:{s:8:"goodsout";a:2:{s:4:"name";s:18:"商品出库提醒";s:4:"temp";s:50:"您的订单已经出库。订单编号@。【@】";}s:12:"orderpayment";a:2:{s:4:"name";s:12:"订单付款";s:4:"temp";s:66:"您有一笔订单@于@分钟后失效，请及时支付。【@】";}s:14:"paymentsuccess";a:2:{s:4:"name";s:12:"付款成功";s:4:"temp";s:56:"@的款项已经收到，请留意出库通知。【@】";}s:9:"couponuse";a:2:{s:4:"name";s:15:"优惠券使用";s:4:"temp";s:59:"您有优惠券已经使用，优惠券编号：@。【@】";}s:13:"couponexpires";a:2:{s:4:"name";s:15:"优惠券过期";s:4:"temp";s:65:"您有一个优惠券即将在@过期，请记得使用。【@】";}s:11:"memberlogin";a:2:{s:4:"name";s:6:"注册";s:4:"temp";s:60:"您的验证码是@，请于@分钟内正确输入。【@】";}s:7:"pwdfind";a:2:{s:4:"name";s:12:"密码找回";s:4:"temp";s:60:"您的验证码是@，请于@分钟内正确输入。【@】";}s:7:"pwdedit";a:2:{s:4:"name";s:12:"密码修改";s:4:"temp";s:60:"您的验证码是@，请于@分钟内正确输入。【@】";}s:11:"orderrefund";a:2:{s:4:"name";s:24:"订单退款审核通过";s:4:"temp";s:83:"您的订单退款已经审核通过，正在等待退款。退款单号@。【@】";}s:13:"refundsuccess";a:2:{s:4:"name";s:12:"退款完成";s:4:"temp";s:69:"您的订单退款已完成。退款单号@，退款金额@。【@】";}s:11:"returngoods";a:2:{s:4:"name";s:24:"商品退货审核通过";s:4:"temp";s:92:"您的商品退货已经审核通过，正在等待退货和退款。退货单号@。【@】";}s:18:"returngoodssuccess";a:2:{s:4:"name";s:12:"退货完成";s:4:"temp";s:81:"您的商品退货退款已完成。退货单号@，退货退款金额@。【@】";}s:16:"recommendbalance";a:2:{s:4:"name";s:18:"推荐奖励结算";s:4:"temp";s:118:"您最新的推荐推荐奖励已结算，您可以去商城用户中心的推荐有礼查看详情和提现。【@】";}}'),('msgpwd',''),('points_order_comments','50'),('points_order_max','5'),('points_order_rate','20'),('points_recommend_register','1'),('points_register','20'),('points_share_shopping','1'),('points_sign_in','30'),('record_number','京ICP：1234567'),('shop_goods',''),('shop_login',''),('shop_logo',''),('shop_member',''),('shop_name','ShopDZ商城'),('smg_login','1'),('smskey','1223'),('smssetting_submit','1'),('spread_reward','a:3:{s:8:\"reward_1\";i:10;s:8:\"reward_2\";i:20;s:8:\"reward_3\";i:20;}'),('statistics_code','&lt;script&gt;&lt;/script&gt;'),('status','on'),('subval','1'),('url','wxRespons'),('web_introduce','好的商城，没那么贵！\r\n由Discuz!原班开发团队倾力打造！传统企业从线下销售转型互联网+的首选！'),('web_status','0'),('wx_access_token',''),('wx_access_token_timeout',''),('wx_login','off'),('wx_AppSecret',''),('wx_defaultresponse','欢迎关注！'),('wx_expire_time','1472016613'),('wx_JsApiTicket',''),('wx_AppID',''),('wx_lookresponse','欢迎关注！'),('wx_share','off'),('wx_sharedesc',''),('wx_shareimg',''),('wx_sharetitle',''),('spread','a:5:{s:18:\"wx_withdraw_status\";i:0;s:24:\"wx_withdraw_audit_status\";i:0;s:8:\"maxprice\";s:4:\"2000\";s:8:\"minprice\";s:1:\"1\";s:7:\"content\";s:217:\"&lt;p&gt;&lt;span style=&quot;font-family: &amp;quot;microsoft yahei&amp;quot;; font-size: 14px; line-height: 25px; text-align: right; background-color: rgb(255, 255, 255);&quot;&gt;提现说明&lt;/span&gt;&lt;/p&gt;\";}');

/*Table structure for table `pre_sms` */

DROP TABLE IF EXISTS `pre_sms`;

CREATE TABLE `pre_sms` (
  `sid` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `to_id` int(11) NOT NULL DEFAULT '0' COMMENT 'ID',
  `to_name` varchar(50) NOT NULL DEFAULT '',
  `title` varchar(255) NOT NULL DEFAULT '',
  `message` varchar(255) NOT NULL DEFAULT '',
  `from_id` int(11) NOT NULL DEFAULT '0',
  `from_name` varchar(50) NOT NULL DEFAULT '',
  `type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '    0     1     2      3',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '    0   1:    2:',
  `del_type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '     0    1     2',
  `dateline` int(10) NOT NULL DEFAULT '0',
  `readtime` int(10) NOT NULL DEFAULT '0',
  `parent_sid` int(11) NOT NULL DEFAULT '0' COMMENT 'ID    sid',
  `message_ismore` tinyint(1) NOT NULL DEFAULT '0' COMMENT ' 0 1 ',
  PRIMARY KEY (`sid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_sms` */

/*Table structure for table `pre_sms_cron` */

DROP TABLE IF EXISTS `pre_sms_cron`;

CREATE TABLE `pre_sms_cron` (
  `cid` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `mids` text NOT NULL COMMENT 'ID',
  `title` char(255) NOT NULL DEFAULT '',
  `message` char(255) NOT NULL DEFAULT '',
  `from_id` int(11) NOT NULL DEFAULT '0' COMMENT 'ID',
  `from_name` varchar(50) NOT NULL,
  `dateline` int(10) NOT NULL,
  `type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '    0     1     2      3',
  `cron_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '    0    1',
  `crontime` int(10) NOT NULL DEFAULT '0',
  `parent_sid` int(10) NOT NULL DEFAULT '0' COMMENT 'ID    sid',
  `message_ismore` tinyint(1) NOT NULL DEFAULT '0' COMMENT ' 0 1 ',
  PRIMARY KEY (`cid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_sms_cron` */

/*Table structure for table `pre_sms_log` */

DROP TABLE IF EXISTS `pre_sms_log`;

CREATE TABLE `pre_sms_log` (
  `log_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `log_phone` char(11) NOT NULL DEFAULT '' COMMENT '手机号',
  `log_captcha` char(10) NOT NULL DEFAULT '' COMMENT '短信动态码',
  `log_ip` char(20) NOT NULL DEFAULT '' COMMENT '请求IP',
  `log_text` char(255) NOT NULL DEFAULT '' COMMENT '短信内容',
  `log_type` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '短信类型:1为注册,2为修改密码,3为找回密码,默认为1',
  `add_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '添加时间',
  `member_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '会员ID,注册为0',
  `is_use` int(2) NOT NULL DEFAULT '0' COMMENT '是否已验证 1（验证） 0（未验证）',
  PRIMARY KEY (`log_id`),
  KEY `log_phone` (`log_phone`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_sms_log` */

/*Table structure for table `pre_sms_receipt` */

DROP TABLE IF EXISTS `pre_sms_receipt`;

CREATE TABLE `pre_sms_receipt` (
  `rid` int(10) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `sid` int(10) NOT NULL DEFAULT '0' COMMENT 'ID',
  `readtime` int(10) NOT NULL DEFAULT '0',
  `read_userid` int(10) NOT NULL DEFAULT '0' COMMENT 'ID',
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_sms_receipt` */

/*Table structure for table `pre_sms_template` */

DROP TABLE IF EXISTS `pre_sms_template`;

CREATE TABLE `pre_sms_template` (
  `tid` int(10) NOT NULL AUTO_INCREMENT,
  `code` varchar(50) NOT NULL DEFAULT '' COMMENT '消息识别码',
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '消息名',
  `title` varchar(50) NOT NULL DEFAULT '' COMMENT '消息模板标题',
  `content` varchar(255) NOT NULL DEFAULT '' COMMENT '消息模板内容',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '消息开启状态   1：开启   2：关闭',
  `dateline` int(10) NOT NULL DEFAULT '0' COMMENT '消息添加编辑时间',
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

/*Data for the table `pre_sms_template` */

insert  into `pre_sms_template`(`tid`,`code`,`name`,`title`,`content`,`status`,`dateline`) values (1,'member_register','会员注册','注册成功','尊敬的会员，您已经注册成功。',1,1473061038),(2,'orderpayment','订单付款提醒','请支付您的订单','您有一笔订单{$a}于{$b}分钟后失效，请及时支付。',1,0),(3,'goodsout','商品出库提醒','您的商品已出库','您的订单已经出库。订单编号{$a}。',1,0),(4,'paymentsuccess','付款成功提醒','您的订单已付款成功','编号为{$a}的订单款项已经收到，请留意出库通知。',1,0),(5,'couponuse','优惠券使用提醒','您的优惠券已使用','您有优惠券已经使用，优惠券编号：{$a}。',1,0),(6,'couponexpires','优惠券即将到期提醒','您的优惠券即将过期','您有一个优惠券即将在{$a}过期，请记得使用。',1,0),(7,'refundsuccess','订单退款成功提醒','您的订单已退款成功','您的订单退款已经审核通过，正在等待退款。订单编号{$a}，退款单号{$b}，退款金额{$c}。',1,0),(8,'returngoodssuccess','订单退货成功提醒','您的订单已退货成功','您的商品退货退款已完成。订单编号{$a}，退货单号{$b}，退货退款金额{$c}。',1,0);

/*Table structure for table `pre_spec` */

DROP TABLE IF EXISTS `pre_spec`;

CREATE TABLE `pre_spec` (
  `spec_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `spec_name` char(50) NOT NULL,
  `listorder` int(11) NOT NULL DEFAULT '0',
  `built_in` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1',
  PRIMARY KEY (`spec_id`),
  UNIQUE KEY `spec_name` (`spec_name`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `pre_spec` */

insert  into `pre_spec`(`spec_id`,`spec_name`,`listorder`,`built_in`) values (1,'颜色',0,1),(2,'尺寸',0,1),(3,'规格',0,1);

/*Table structure for table `pre_spec_value` */

DROP TABLE IF EXISTS `pre_spec_value`;

CREATE TABLE `pre_spec_value` (
  `spec_value_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `spec_id` int(11) NOT NULL DEFAULT '0' COMMENT 'id',
  `spec_value` char(80) NOT NULL,
  `built_in` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1内置的不允许删除',
  PRIMARY KEY (`spec_value_id`),
  UNIQUE KEY `spec_id` (`spec_id`,`spec_value`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

/*Data for the table `pre_spec_value` */

insert  into `pre_spec_value`(`spec_value_id`,`spec_id`,`spec_value`,`built_in`) values (1,1,'白色',0),(2,2,'XL',0),(3,3,'规格',0),(4,3,'太阳',0),(5,3,'紫荆',0),(6,3,'铃兰',0),(7,3,'马蹄',0),(8,1,'棕色',0),(9,1,'米色',0),(10,1,'粉色',0),(11,3,'十五格',0),(12,2,'180*180',0);

/*Table structure for table `pre_special_item` */

DROP TABLE IF EXISTS `pre_special_item`;

CREATE TABLE `pre_special_item` (
  `item_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '专题项目编号',
  `special_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '专题编号',
  `item_type` varchar(50) NOT NULL DEFAULT '' COMMENT '项目类型',
  `item_data` varchar(2000) DEFAULT '' COMMENT '项目内容',
  `item_usable` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '项目是否可用 0-不可用 1-可用',
  `item_sort` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '项目排序',
  `item_name` varchar(16) NOT NULL DEFAULT '' COMMENT '类型名称',
  PRIMARY KEY (`item_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `pre_special_item` */

insert  into `pre_special_item`(`item_id`,`special_id`,`item_type`,`item_data`,`item_usable`,`item_sort`,`item_name`) values (1,0,'adv_list','a:3:{i:0;a:3:{s:3:\"img\";s:35:\"Common/2016-09-07/57cf918b4aa6b.jpg\";s:4:\"type\";s:5:\"goods\";s:4:\"data\";s:1:\"1\";}i:1;a:3:{s:3:\"img\";s:35:\"Common/2016-09-07/57cf919ccdd6b.jpg\";s:4:\"type\";s:5:\"goods\";s:4:\"data\";s:1:\"1\";}i:2;a:3:{s:3:\"img\";s:35:\"Common/2016-09-07/57cf91a71376b.jpg\";s:4:\"type\";s:5:\"goods\";s:4:\"data\";s:1:\"1\";}}',1,255,'幻灯模块'),(2,0,'adv_nav','a:4:{i:0;a:4:{s:3:\"img\";s:35:\"Common/2016-09-07/57cf91c1d43b2.png\";s:5:\"title\";s:6:\"首页\";s:4:\"type\";s:3:\"url\";s:4:\"data\";s:36:\"http://shopdz.shopdz.cn/wap/\";}i:1;a:4:{s:3:\"img\";s:35:\"Common/2016-09-07/57cf920969be6.png\";s:5:\"title\";s:6:\"订单\";s:4:\"type\";s:3:\"url\";s:4:\"data\";s:48:\"http://shopdz.shopdz.cn/wap/myorder.html\";}i:2;a:4:{s:3:\"img\";s:35:\"Common/2016-09-07/57cf9259f0873.png\";s:5:\"title\";s:9:\"购物车\";s:4:\"type\";s:3:\"url\";s:4:\"data\";s:47:\"http://shopdz.shopdz.cn/wap/basket.html\";}i:3;a:4:{s:3:\"img\";s:35:\"Common/2016-09-07/57cf925e7e7af.png\";s:5:\"title\";s:12:\"个人中心\";s:4:\"type\";s:3:\"url\";s:4:\"data\";s:47:\"http://shopdz.shopdz.cn/wap/member.html\";}}',1,255,'图文导航'),(3,0,'adv_html','<div style=\"display: inline-block;width:100%;background#fff;height: 3rem;font-size: 2rem;text-align: center;line-height: 1.6;\">家居&nbsp;|<span style=\"font-size: 1.2rem;letter-spacing:1px;color: #aaa;padding-left: 5px;\">回家，放松身心</span></div>',1,255,'预置通栏模板'),(4,0,'goods','a:1:{s:5:\"goods\";a:4:{i:0;s:1:\"1\";i:1;s:1:\"2\";i:2;s:1:\"3\";i:3;s:1:\"4\";}}',1,255,'商品展示');

/*Table structure for table `pre_spread` */

DROP TABLE IF EXISTS `pre_spread`;

CREATE TABLE `pre_spread` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `member_uid` int(11) NOT NULL COMMENT '会员id',
  `member_mobile` varchar(11) NOT NULL DEFAULT '' COMMENT '手机号',
  `member_truename` varchar(20) NOT NULL DEFAULT '' COMMENT '真实姓名',
  `add_time` int(10) NOT NULL COMMENT '会员注册时间',
  `order_id` int(11) NOT NULL COMMENT '订单id',
  `order_sn` bigint(20) unsigned NOT NULL COMMENT '订单号',
  `spread_state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '会员的开启状态 1为已结算 0为未结算',
  `spread_level` tinyint(1) NOT NULL DEFAULT '0' COMMENT '级别: 1级别 2级别 3级别   ',
  `spread_comminssion_rate` float(10,2) NOT NULL DEFAULT '0' COMMENT '各等级佣金比例',
  `spread_state_time` int(10) NOT NULL  DEFAULT '0' COMMENT '结算时间',
  `reward_amount` float(10,2) DEFAULT '0.00' COMMENT '提现金额',
  `refund_amount` float(10,2) DEFAULT '0.00' COMMENT '退款金额',
  `spread_type` tinyint(10) NOT NULL DEFAULT '0'  COMMENT '0  订单数据  1 提现数据',
  `order_add_time` int(10) NOT NULL DEFAULT '0'  COMMENT '订单生成时间',
  `cron_state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0 结算计划任务 1 60天后跑退款退货的orderid',
  `cron_time` int(10) NOT NULL DEFAULT '0'  COMMENT '计划任务执行时间',
  `order_amount`    float(10,2) DEFAULT '0.00' COMMENT '订单金额',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uniq_name` (`member_uid`,`order_id`) USING BTREE,
  KEY `member_id` (`member_uid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_spread` */

/*Table structure for table `pre_spread_account` */

DROP TABLE IF EXISTS `pre_spread_account`;

CREATE TABLE `pre_spread_account` (
  `account_id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_uid` int(11) unsigned NOT NULL COMMENT '用户ID',
  `member_name` varchar(20) NOT NULL DEFAULT '' COMMENT '用户名',
  `all_price` float(10,2) NOT NULL DEFAULT '0' COMMENT '该用户的所有提成，累计增加',
  `settlement_price` float(10,2) NOT NULL DEFAULT '0' COMMENT '已经结算的钱，既是可提现的金额',
  `no_settlement_price` float(10,2) NOT NULL DEFAULT '0' COMMENT '未结算的钱',
  `frozen_price` float(10,2) NOT NULL DEFAULT '0' COMMENT '提现申请冻结的钱',
  `add_time` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '申请时间',
  `enddate` int(10) unsigned DEFAULT NULL DEFAULT 0 COMMENT '最后处理时间',
  `qrcode` varchar(20) NOT NULL DEFAULT '' COMMENT '推广的二维码地址',
  PRIMARY KEY (`account_id`),
  UNIQUE KEY `member_uid` (`member_uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户账户表';

/*Data for the table `pre_spread_account` */

/*Table structure for table `pre_spread_bank` */

DROP TABLE IF EXISTS `pre_spread_bank`;

CREATE TABLE `pre_spread_bank` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `bank_id` int(11) NOT NULL DEFAULT '0' COMMENT '银行id',
  `bank_no` char(35) NOT NULL DEFAULT '' COMMENT '银行卡号',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '银行名',
  `bank_name` varchar(20) NOT NULL DEFAULT '' COMMENT '银行卡真实姓名',
  `add_time` int(10) NOT NULL COMMENT '注册时间',
  `member_uid` bigint(20) unsigned NOT NULL COMMENT 'member_id',
  PRIMARY KEY (`id`),
  KEY `member_uid` (`member_uid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_spread_bank` */

/*Table structure for table `pre_spread_order_cron` */

DROP TABLE IF EXISTS `pre_spread_order_cron`;

CREATE TABLE `pre_spread_order_cron` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `order_id` int(11) NOT NULL COMMENT '订单id',
  `order_add_time` int(10) NOT NULL DEFAULT '0' COMMENT '订单生成时间',
  `add_time` int(10) NOT NULL DEFAULT '0' COMMENT '计划任务执行时间',
  `cron_state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0 未执行 1 已执行',
  `cron_type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0 新增订单 1 退款订单 2 退货订单',
  `cron_time` int(10) NOT NULL DEFAULT '0' COMMENT '计划任务执行时间',
  PRIMARY KEY (`id`),
  KEY `order_id` (`order_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_spread_order_cron` */

/*Table structure for table `pre_spread_withdraw_cash` */

DROP TABLE IF EXISTS `pre_spread_withdraw_cash`;

CREATE TABLE `pre_spread_withdraw_cash` (
  `cash_id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `cash_sn` bigint(20) unsigned NOT NULL COMMENT '申请单号',
  `member_uid` int(11) unsigned NOT NULL COMMENT '用户ID',
  `member_name` char(150) NOT NULL  DEFAULT '' COMMENT '用户名',
  `member_mobile` char(11) NOT NULL DEFAULT '' COMMENT '手机号',
  `user_id` int(11) unsigned NOT NULL  DEFAULT '0' COMMENT '管理员ID',
  `user_name` varchar(20) NOT NULL  DEFAULT '' COMMENT '管理员名',
  `bank_no` char(35) NOT NULL DEFAULT '' COMMENT '银行卡号/微信openid',
  `bank` char(25) NOT NULL DEFAULT '' COMMENT '银行名字',
  `bank_name` varchar(20) NOT NULL DEFAULT '' COMMENT '银行卡真实姓名',
  `add_time` int(10) unsigned NOT NULL COMMENT '申请时间',
  `status` enum('1','2','3','4') DEFAULT '1' COMMENT '处理状态 1-待处理 2-拒绝 3-同意  4-通过，打款失败',
  `remark` varchar(255) NOT NULL  DEFAULT '' COMMENT '处理备注',
  `enddate` int(10) unsigned DEFAULT NULL COMMENT '处理时间',
  `cash_amount` float(10,2) NOT NULL  DEFAULT '0' COMMENT '提现金额',
  `notify_mark` varchar(200) NOT NULL DEFAULT '' COMMENT '退款之后通知备注',
  `type` enum('1','2') DEFAULT '1' COMMENT '提现类型 1-银行卡 2-微信',
  PRIMARY KEY (`cash_id`),
  UNIQUE KEY `cash_sn` (`cash_sn`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_spread_withdraw_cash` */

/*Table structure for table `pre_storage` */

DROP TABLE IF EXISTS `pre_storage`;

CREATE TABLE `pre_storage` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `person` varchar(16) NOT NULL DEFAULT '',
  `name` varchar(20) NOT NULL DEFAULT '',
  `telphone` varchar(20) NOT NULL DEFAULT '',
  `add_province` int(4) NOT NULL DEFAULT '0' COMMENT 'id',
  `add_city` int(4) NOT NULL DEFAULT '0' COMMENT 'id',
  `add_dist` int(4) NOT NULL DEFAULT '0' COMMENT 'id',
  `add_community` varchar(255) NOT NULL DEFAULT '',
  `status` tinyint(4) unsigned NOT NULL DEFAULT '0' COMMENT ' 1',
  `ext_info` text NOT NULL,
  `dateline` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_storage` */

/*Table structure for table `pre_user_token` */

DROP TABLE IF EXISTS `pre_user_token`;

CREATE TABLE `pre_user_token` (
  `token_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '令牌编号',
  `member_id` int(10) unsigned NOT NULL COMMENT '用户编号',
  `member_name` varchar(50) NOT NULL  DEFAULT '' COMMENT '用户名',
  `token` varchar(50) NOT NULL   DEFAULT '' COMMENT '登录令牌',
  `login_time` int(10) unsigned NOT NULL  DEFAULT '0' COMMENT '登录时间',
  `client_type` varchar(10) NOT NULL  DEFAULT '' COMMENT '客户端类型 android wap',
  `openid` varchar(50) DEFAULT NULL COMMENT '微信支付jsapi的openid缓存',
  PRIMARY KEY (`token_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_user_token` */

/*Table structure for table `pre_wx_keywords` */

DROP TABLE IF EXISTS `pre_wx_keywords`;

CREATE TABLE `pre_wx_keywords` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键id',
  `keyword` char(255) DEFAULT NULL COMMENT '关键词',
  `content` text NOT NULL DEFAULT '' COMMENT '回复文本内容',
  `isimg` tinyint(1) DEFAULT NULL COMMENT '是否为图文 1 图文 0 文本',
  `tid` int(10) DEFAULT NULL COMMENT '素材模板id',
  `states` tinyint(1) DEFAULT NULL COMMENT '是否启用',
  `displayorder` int(11) DEFAULT NULL COMMENT '排序',
  PRIMARY KEY (`id`),
  UNIQUE KEY `keyword` (`keyword`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_wx_keywords` */

/*Table structure for table `pre_wx_menu` */

DROP TABLE IF EXISTS `pre_wx_menu`;

CREATE TABLE `pre_wx_menu` (
  `id` tinyint(5) NOT NULL AUTO_INCREMENT,
  `lid` int(10) DEFAULT '0' COMMENT '分类id',
  `name` char(255) DEFAULT NULL COMMENT '菜单名称',
  `type` char(10) DEFAULT NULL COMMENT '菜单触发类型 click  view',
  `keywords` char(255) DEFAULT NULL COMMENT '关键词',
  `url` varchar(255) DEFAULT NULL COMMENT '菜单触发url',
  `displayorder` int(10) DEFAULT '0' COMMENT '排序',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `pre_wx_menu` */

/*Table structure for table `pre_wx_message` */

DROP TABLE IF EXISTS `pre_wx_message`;

CREATE TABLE `pre_wx_message` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code` char(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `content` text,
  `states` tinyint(4) DEFAULT NULL COMMENT '状态',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;


DROP TABLE IF EXISTS `pre_message`;
CREATE TABLE `pre_message` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code` char(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `wx_content` text COMMENT '微信发送模板',
  `wx_states` tinyint(4) DEFAULT NULL COMMENT '状态',
  `message_content` text COMMENT '短信发送模板',
  `message_states` tinyint(4) DEFAULT NULL,
  `web_content` text COMMENT '站内信发送模板',
  `web_states` tinyint(4) DEFAULT NULL,
  `web_title` char(255) DEFAULT NULL COMMENT '站内信标题',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;
-- ----------------------------
-- Records of pre_message
-- ----------------------------
INSERT INTO `pre_message` VALUES ('1', 'goodsout', '商品出库提醒', '您的订单已经出库。订单编号{order_sn}。【shop_name】', '1', '您的订单已经出库。订单编号@。【@】', '1', '您的订单已经出库。订单编号{order_sn}。【shop_name】', '1', '您的商品已出库');
INSERT INTO `pre_message` VALUES ('2', 'orderpayment', '订单付款', '您有一笔订单{order_sn}于{time}分钟后失效，请及时支付。【shop_name】', '1', '您有一笔订单@于@分钟后失效，请及时支付。【@】', '1', '您有一笔订单{order_sn}于{time}分钟后失效，请及时支付。【shop_name】', '1', '请支付您的订单请支付您的订单');
INSERT INTO `pre_message` VALUES ('3', 'paymentsuccess', '付款成功', '您的订单{order_sn}的款项已经收到，请留意出库通知。【shop_name】', '1', '您的订单@的款项已经收到，请留意出库通知。【@】', '1', '您的订单{order_sn}的款项已经收到，请留意出库通知。【shop_name】', '1', '您的订单已付款成功');
INSERT INTO `pre_message` VALUES ('5', 'couponexpires', '优惠券过期', '您有一个优惠券即将在{coupn_sn}过期，请记得使用。【shop_name】', '1', '您有一个优惠券即将在@过期，请记得使用。【@】', '1', '您有一个优惠券即将在{coupn_sn}过期，请记得使用。【shop_name】', '1', '您的优惠券即将过期');
INSERT INTO `pre_message` VALUES ('6', 'memberlogin', '会员注册', '1', '1', '您的验证码是@，请于@分钟内正确输入。【@】', '1', '尊敬的会员，您已经注册成功。', '1', '注册成功');
INSERT INTO `pre_message` VALUES ('7', 'pwdfind', '密码找回', '1', '1', '您的验证码是@，请于@分钟内正确输入。【@】', '1', '1', '1', null);
INSERT INTO `pre_message` VALUES ('8', 'pwdedit', '密码修改', '1', '1', '您的验证码是@，请于@分钟内正确输入。【@】', '1', '1', '1', null);
INSERT INTO `pre_message` VALUES ('9', 'orderrefund', '订单退款审核通过', '您的订单退款已经审核通过，正在等待退款。退款单号{refund_sn}。【shop_name】', '1', '您的订单退款已经审核通过，正在等待退款。退款单号@。【@】', '1', '您的订单退款已经审核通过，正在等待退款。退款单号{refund_sn}。【shop_name】', '1', '您的订单已退款成功');
INSERT INTO `pre_message` VALUES ('10', 'refundsuccess', '退款完成', '您的订单退款已完成。退款单号{refund_sn}，退款金额：{total}。【shop_name】', '1', '您的订单退款已完成。退款单号@，退款金额@。【@】', '1', '1', '1', null);
INSERT INTO `pre_message` VALUES ('11', 'returngoods', '商品退货审核通过', '您的商品退货已经审核通过，正在等待退货和退款。退货单号{return_sn}。【shop_name】', '1', '您的商品退货已经审核通过，正在等待退货和退款。退货单号@。【@】', '1', '1', '1', null);
INSERT INTO `pre_message`  VALUES ('12', 'returngoodssuccess', '退货完成', '您的商品退货退款已完成。退货单号{return_sn}，退货退款金额{total}。【shop_name】', '1', '您的商品退货退款已完成。退货单号@，退货退款金额@。【@】', '1', '您的商品退货退款已完成。退货单号{return_sn}，退货退款金额{total}。【shop_name】', '1', '您的订单已退货成功');
INSERT INTO `pre_message` VALUES ('13', 'recommendbalance', '推荐奖励结算', '您最新的推荐推荐奖励已结算，您可以去商城用户中心的推荐有礼查看详情和提现。【shop_name】', '1', '您最新的推荐推荐奖励已结算，您可以去商城用户中心的推荐有礼查看详情和提现。【@】', '1', '您最新的推荐推荐奖励已结算，您可以去商城用户中心的推荐有礼查看详情和提现。【shop_name】', '1', '推荐奖励已结算');
INSERT INTO `pre_message` VALUES ('14', 'delivergoods', '管理员订单提醒', '您的商城有一笔订单{order_sn}已经支付，请及时发货。【shop_name】', '1', '您的商城有一笔订单@已经支付，请及时发货。【@】', '1', '1', '1', '1');




DROP TABLE IF EXISTS `pre_other_shop`;
CREATE TABLE `pre_other_shop` (
  `shop_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '第三方商城id',
  `shop_code` char(16) NOT NULL DEFAULT '' COMMENT '第三方商城code',
  `shop_name` char(16) NOT NULL DEFAULT '' COMMENT '第三方商城名称',
  `shop_config` text NOT NULL DEFAULT '' COMMENT '第三方商城配置',
  `shop_state` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '第三方商城状态',
  PRIMARY KEY (`shop_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- 扫码支付
DROP TABLE IF EXISTS `pre_other_pay`;
CREATE TABLE `pre_other_pay` (
  `pay_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '支付id',
  `order_sn` bigint(20) unsigned NOT NULL COMMENT '支付订单号',
  `trade_no` char(50) NOT NULL DEFAULT '' COMMENT '支付单号',
  `payment_code` char(10) NOT NULL COMMENT '支付方式',
  `order_amount` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '支付金额',
  `pay_starttime` int(10) unsigned DEFAULT '0' COMMENT '支付发起时间',
  PRIMARY KEY (`pay_id`),
  UNIQUE KEY `order_sn` (`order_sn`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `pre_user_getdata`;
CREATE TABLE `pre_user_getdata` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '主键id',
  `modename` varchar(255) DEFAULT NULL COMMENT '模块名称',
  `goodsnum` int(10) DEFAULT NULL COMMENT '商品数量',
  `shopdata` text COMMENT '商品调用数据',
  `usergetdata` text not null DEFAULT '' COMMENT '调用方式',
  `state` tinyint(1) DEFAULT '0' COMMENT '是否启用 1 启用 0 不启用',
  `dataline` int(11) DEFAULT NULL COMMENT '创建时间',
  `displayorder` int(11) DEFAULT NULL,
  `getcode` varchar(255) NOT NULL DEFAULT '' COMMENT '随机唯一码',
  PRIMARY KEY (`id`),
  UNIQUE KEY `getcode` (`getcode`) USING HASH
) ENGINE=InnoDB  DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `pre_gift`;
CREATE TABLE `pre_gift` (
  `gift_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '礼品id',  
  `gift_name` varchar(100) NOT NULL DEFAULT '' COMMENT '礼品名称',  
  `gift_image` varchar(255) NOT NULL DEFAULT '' COMMENT '礼品图片',  
  `gift_storage` mediumint(5) unsigned NOT NULL DEFAULT '0' COMMENT '礼品库存',  
  `gift_price` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '礼品价格',  
  `gift_state` tinyint(1) DEFAULT '1' COMMENT '礼品状态1正常  0 被删除',  
  `credits_exchange` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1积分兑换   0 不允许',  
  `gift_points` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '兑换所需要积分数量',  
  `limit_num` smallint(3) NOT NULL DEFAULT '0' COMMENT '每人限兑N件',  
  `start_time` int(10) NOT NULL DEFAULT '0' COMMENT '允许兑换开始时间',  
  `end_time` int(10) NOT NULL DEFAULT '0' COMMENT '允许兑换结束时间',  
  `add_time` int(10) NOT NULL DEFAULT '0' COMMENT '添加时间',  
  `update_time` int(10) NOT NULL DEFAULT '0' COMMENT '修改时间',  
  `goods_common_id` int(10) NOT NULL DEFAULT '0' COMMENT '关联商品id',  
  `goods_name` varchar(200) NOT NULL DEFAULT '' COMMENT '关联商品的商品名称',  
  `listorder` int(10) NOT NULL DEFAULT '0' COMMENT '排序值',  
  `gift_description` text COMMENT '礼品介绍',  
  PRIMARY KEY (`gift_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='礼品表';

DROP TABLE IF EXISTS `pre_wx_imgtext`;
CREATE TABLE `pre_wx_imgtext` (
  `tid` int(10) NOT NULL AUTO_INCREMENT,
  `modename` varchar(255) DEFAULT NULL,
  `content` text,
  `imgnum` tinyint(4) DEFAULT NULL,
  `dataline` int(11) DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8;
DROP TABLE IF EXISTS `pre_plugin`;
CREATE TABLE `pre_plugin` (
  `code` varchar(13) NOT NULL DEFAULT '' COMMENT '插件编码',
  `name` varchar(150) NOT NULL DEFAULT '' COMMENT '中文名字',
  `version` varchar(255) NOT NULL DEFAULT '' COMMENT '插件的版本',
  `author` varchar(30) NOT NULL DEFAULT '' COMMENT '插件作者',
  `config` text DEFAULT NULL COMMENT '配置信息',
  `config_value` text NOT NULL DEFAULT '' COMMENT '配置值信息',
  `desc` varchar(255) NOT NULL DEFAULT '' COMMENT '插件描述',
  `status` tinyint(1)NOT NULL DEFAULT '0' COMMENT '是否启用',
  `type` char(50) NOT NULL DEFAULT '' COMMENT '插件类型 payment支付 login 登陆 shipping物流',
  `icon` varchar(255) DEFAULT NULL COMMENT '图标',
  `bank_code` text COMMENT '网银配置信息',
  `scene` tinyint(1) DEFAULT NULL COMMENT '使用场景 0 PC+手机 1 手机 2 PC',
  `order_type_sn` char(10) NOT NULL DEFAULT '' COMMENT '使用场景 插件使用支付系统，会在订单号尾部添加标志，只能是2位整数 比如 08 09'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
CREATE TABLE `pre_foot_print` (
  `log_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `member_id` int(10) unsigned NOT NULL COMMENT '会员ID',
  `member_name` char(150) NOT NULL COMMENT '会员名',
  `common_goods_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '商品common_goods_id',
  `add_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '添加时间',
  `goods_name` char(150) NOT NULL DEFAULT '' COMMENT '商品名称',
  `goods_image` char(255) NOT NULL COMMENT '商品图片',
  `gc_id` int(10) unsigned DEFAULT '0' COMMENT '商品分类ID',
  `log_price` float(10,2) DEFAULT '0.00' COMMENT '商品价格',
  `log_msg` char(255) DEFAULT NULL COMMENT '足迹备注',
  PRIMARY KEY (`log_id`),
  UNIQUE KEY `member_id_common_goods_id` (`member_id`,`common_goods_id`),
  KEY `member_id` (`member_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='足迹表';